{
  "valerian": {
    "title": "Valerian and The City of a Thousand Planets",
    "release": 2017,
    "jacob": {
      "title": "My Thoughts on Valerian",
      "author": "Jacob",
      "text": "When I first walked away from Valerian and the City of a Thousand planets, I felt relieved.  Based on a comic book series of the same name, this adaptation contains very little to keep the audience engaged beyond the sex appeal that comes with flashy animations, handsome actors, and tip top visual design and direction.  This appeal fades quickly as the narrative, and dialog are not very engaging.  The main actors themselves deliver lines that feel sophomoric and are lacking poise and expertise of professionals. Valerian exudes a boastful air as a major in some galactic law enforcement institution, and comes across as Johnny Bravo.  He mentions his epic love life and his sky high aptitude as a special agent, but he is always unprepared and by sheer luck and the actions of those around he is able to succeed.  The problem with this is that the emotional resonance I have with this character is that of a stoic idiot with an enormous ego, which rubbed me the wrong way constantly.  I felt for Laureline as she complains about his behavior and attitude, until she somehow falls even more in love with him by the credits.  The advent of this decision brought about by a moral conflict/resolution between the two characters which felt contrived immediately.I get that this is based on a comic, (which I have not read) and that for the most part the narrative of graphic novel can be allowed some leeway to showcase a more visually compelling experience, and in that sense this film is quite fun.  Character art and visual set pieces allow you to become lost and engrossed in the stories atmosphere and setting.  But there was a big gap for me as Valerian and Laureline were just so one dimensional.  Like watching two models blue steel their way through every and all situations, without a trail of breadcrumbs to connect the dots."
    },
    "megan": {
      "title": "Valerian Reviewwwwww",
      "author": "Megan",
      "text": "Mind-blowing advanced CGI? Check. An accomplished and highly regarded sci-fi director? Got him. An astronomical budget? Through the roof. Sound like the formula for the next sci-fi cult classic? If so, then you forgot the same vital ingredients the creators of Valerian did: a compelling storyline and an engaging cast. While the film was wrought with intriguing futuristic concepts and beautiful design, it's visuals weren't enough to make up for the poor acting and sub par writing. Both starring actors, Cara Delevingne and Dane DeHaan, gave underwhelming performances. They failed to bring any charisma to their characters, establishing no chemistry with the audience or each other. They are not solely responsible for the flat tone of the film, however. After all, the script gave them little to work with. We first meet Major Valerian and Sergeant Lorelaine while they are enjoying a virtual beach. A playful, choreographed wrestling match ensues, sparking hope for a sexy sort of tension. Unfortunately, that was the epitome of chemistry, and the rest of the film lacks any hint of flirtation, arousal or even close friendship. Even when he proposes marriage, there is no sense of romance, love or excitement. In fact, the only catalyst for his proposition is to combat Lorelaine for calling out his fear of commitment. What a great foundation for marriage, saving face. The lack of emotion isn’t limited to the title character, however. This sense of apathy expands through the length of the film. I would argue that this is due to a complete absence of backstory. The gaping deficit of context surrounding the characters inhibits the viewer from empathizing with them. The information whole was so distracting that I actually turned to my partner to ask if the movie was a sequel. It seemed as though the title character was intended to be a smooth, charming Casanova of sorts. His empty lines and blank history made it nearly impossible to frame him this way or even find him attractive hero. The heaviest collateral damage from this oversight came in the death of Rihanna’s character, Bubbles. Because our main character was so devoid of substance, his emotional response came across as cheesy. A moment that was inserted as a sentimental motif was just too little too late. While the incredible imagery that accompanied this empty plot wasn’t enough to save the film, it does have merit and deserves some mention. Particularly, I found the technology presented very intriguing. Early on, we see a huge empty park in the desert with hundreds of people wandering around. It is then revealed that they are immersed in some kind of virtual travel to another dimension via a VR like headset. Even more fantastic is that they can purchase items and then somehow transport them back to their reality. Strangely enough though, their purchases are nothing exciting and seem a poor choice on the writer’s part. If one of the few redeeming qualities of your film is it’s science fiction concepts, why not have them purchase futuristic gadgets? Instead, they are excited about the pile of junk they’ve acquired. What a wasted opportunity. There is no denying that Valerian was both innovative and technically impressive. It was fun to watch for the imagery alone. However, this doesn’t keep the film from feeling less like a cohesive and immersive story, and more like a highlight reel of a writer’s rooms best sci-fi ideas."
    },
    "ivan": {
      "title": "Can We Discuss WHAT THE FUCK Happened To VALERIAN and If its Redeemable Qualities Can Somehow Shine Through the Blunders that Reside at the Core of the Film?",
      "author": "Ivan",
      "text": "Like many that hold 'The Fifth Element' dearly in their hearts from their youth, I was pretty damn amped about Valerian. 2 of 4 of the trailers made it look like a decent enough lil adventure story, and the lushness of the visuals were enough to get my gears churning putting together all these little sci-fi concepts into *some* sort of sensible world-view. See, that’s what I absolutely LOVE about sci-fi as a genre and setting. It’s a straight-up playground for any creative visionary, and visuals/concepts alone can sometimes carry a sci-fi movie to great heights. The Valerian trailers touched on a sense of excitement that *I remembered* the Fifth Element touching on. It looked fun, silly, and dramatic. There was a sense of rigidity in the lead actors that I did my best to dissuade myself from feeling. To be completely honest, neither of the two leads have done anything in any flick that I have actually really been impressed by. I wasn’t going to let a trailer get me to vilify what could be a solid flick. As reviews poured in around 70% on RT, I was actually pleasantly surprised… but then I started reading them and the numbers kept dipping over time. Still, I bit the bullet last night and watched Valerian: City of a Thousand Planets and hooollly shit, what happened?!? **Redeemable Qualities** [Spoilers from here on out]I am stoked I saw this. Really happy to have seen it, actually, even though I think it was actually boring and hard to watch at times. I laughed during scenes I was supposed to laugh at, and found some of its thematic silliness to hit home well enough. I was legitimately amped on the introduction which showed diplomatic greetings over 150ish years and amongst an plethora of diverse alien species. My love of Sci-Fi and RPG style games (Mass Effects and KOTOR are great examples) really tuned my imagination when piecing together lore. Each alien race had enough detail and biological design that made my mind swirl: Ooh, how do these guys gather food? Is this a working class? Are these data-sentient only? How does his tentacle not wither outside his suit?” THIS. This questioning and curiosity around concepts alone make this movie something worthwhile. “How does an alien exist that can reproduce nay material plugged into it? Why is this other alien race purely pacifistic?” These questions often came from the impeccable design the movie lavishly had on display. Honestly, the design and visual direction of the movie is easily its strongest shine. Spacecraft architecture, UI interfaces, weapon concepts, platforming tools, handheld interdimensional portals, and the clothing. Oh MY GOODNESS, the CLOTHING! The clothing and design of the fashion was extraordinary. Not only did the clothing look incredible, pull from various cultures, imply some practicality, it was all encompassing and really built the world up (especially in the intro scene). The clothing was beautiful and engrossing in a way that supported this movie’s value as pure eye candy, and it led to certain cerebral provocations. I had so many curiosities… but the more I thought about them, the more each concept and idea felt shallow and untethered to the universe crafted before us (Why the fuck does the Mul race need 20megaton energy pearls, and how come they aren’t utilized by ANY character in this movie?) and much less to any central narrative. I genuinely liked some Sci-Fi elements of this flick, but then there wasn’t any new concept that felt new and fresh and made me really think. I found much intrigue in the description of Alpha, with its neuron-building aliens, its underwater marine meanderers, and its finance-loving data-aliens. Sure, these bite-sized concepts got me enticed and many of them were gorgeous, but the sum of their parts add up to less than each one might have stood as a fascinating youtube video, or something. This is entirely because the central narrative and driving force of the movie is about as off-kilter and uncharismatic as it gets. **Shit to Beef About**Fuck man, there’s a lot to beef about in this fucking flick. Since I’m on the narrative and the action and world-building, I’ll stay here for a second before moving to the elephant in the room. As I mentioned, Sci-Fi concepts have much less impact when they fail to actually drive the storyline forward and instead exist only to demonstrate some concept. Laureline’s entire expedition to the water-zone had her doing no actual heroics, save for sticking her head into a jellyfish butthole, AND that was done only to locate Valerian’s location. There are probably a thousand different side-quests that she could have done, and this movie chose this one. That’s fine, I guess, but it didn’t build her character in any capacity and there was a huge Checkov’s Gun blasted at our face when she stayed in the Jellyfish a second longer than was allowed yet there were ZERO repurcussions. Ok, fine. I guess we got a semi-inspired marine-life biology scene and got to look at Cara Delevingne stretch her ability to express fear and bewilderment, but this scene didn’t add to the whole in any way. The action was *not* terrible. The melee combat with the dumb floppy aliens was actually pretty great, while the gun fight was horrendous. One of the best action bits of the trailer showcases Valerian running through multiple walls before exploding out into a chasm and then using a platform generator to traverse a gap, run through a neuron-harvesting field, and then propel underwater to arrive at a destination. Why does he do this? Is he being chased? Is he in trouble? Is it necessary? Well… no. He literally runs through those because it’s a shortcut. The best action scene has no gravity to it, at all. The movie has no stock in our emotions at all, it would seem. It never creates tension, and I’d legitimately be surprised if anyone felt anything for these characters other than annoyance. And here we get to the crux of the problem: our two lead actors. **Acting, Charisma, and Screen Presence**I didn’t expect the acting to be excellent based on the trailers, but I honestly didn’t expect this level of ineptness. It honestly is SO fascinating because of how much of a blunder this is. Like how the FUCK did you get actors that are this weak? Cara’s acting is relatively ok. She never wows, but she does her part has an occasional note of emotional expression that hits home. I liked her ending monologue about love, rule-breaking, and what she needs from commitment. It was directed at the wooden barn door that is Dane DeHaan, so it was effectively a monologue. Despite Cara’s best efforts, I was not inspired in any capacity, but I *can still* see why she was cast (those eyebrows, amirite?). I don’t want to sound incendiary, but I have no fucking idea why how Dehaan snagged this role. None. Like, what was Luc Besson going for with this? I really want to peep the source material comics to see if there’s some remnant of understanding it’ll denote as to why DeHaan was the most uncharismatic, phoned-in, annoyingly voiced, low-effort, semi-sarcastic, monotone leading man. There’s GOT to be some vision they were going for, right? This fool had ZERO fucking screen presence. He had no energy, no chemistry with his lead (save for literally the final kiss which looked plausibly genuine), had no zest to his punchlines or jokes, and just behaved inconsistently as fuck between his “soldier” mentality and his grade-school attempt at playful banter. It was actually frustrating to endure. It made me realize just how important charm and energy matter in on-screen characters, and DeHaan’s depiction of this space-rogue/military agent/spy dude was probably the largest blemish of a leading man in an otherwise well-crafted movie I’ve seen in cinema. That seems hyperbolic, but fuck homies. **If you liked his acting, PLEASE let me know what you liked. I am genuinely curious what about his portrayal drew you to him, and how you related to him.** I feel like I could talk about the acting and how important it is have captivating characters that *can* be subdued or reserved yet still hold screen presence. Examples would be Gosling in Drive, or [Dan Steven’s in The Guest](https://www.reddit.com/r/TrueFilm/comments/2s6ozj/the_guest_and_the_cinematic_expression_of_human/). Acting aside, the movie had no attempt at building Valerian as a character to give a shit about. So Valerian is a ladykiller…. That’s the only backstory we get? How? With THAT level of charm? It makes no sense. And Laureline makes fun of his lack of commitment, so his solution is to propose right then and there? How are these two into each other? And she’s *actually* pondering a life with him…. Why? He’s had about 40 other partners he brushed off, and then like, he’s inexplicably going to be faithful to Laureline for some reason? The fuck is this? And he’s a soldier says he “plays by the rules” yet is constantly shitting right where he eats and banging his partners? WHAT?! It’s a weird feeling when the most unrealistic thing about a sci-fi movie is the very human element and the only thing I can’t suspend my disbelief about. And it’s not like Luc Besson doesn’t understand good acting or how to NAIL this challenging tone of silly slapstick characters. You’ve seen The Fifth Element, right? If you haven’t go peep that immediately. I literally watched it right after Valerian to see how it stacked up. Korben Dallas, Leeloo, Zorg, and motherfuckin’ Ruby Rhod are DRIPPING with charm. They are all so over-the-top and adorable, flamboyant and energetic, emotive and they all have range. Korben’s sarcastic “fuck off with your bullshit” demeanor actually works and builds towards his character. In the first 2 minutes of him being on screen, we learn a TON about him. He’s an ex-marine, fucking up at his job, has mommy issues, has a bad smoking habit, and has amazing combat boots. I mean, Luc Besson directed these characters to success. It just makes the intention behind what happened with Valerian’s character make no sense at all. What happened? What am I missing? Are people relating to DeHaan in this role? Is he embodying something to aspire to, in any capacity? Somebody, please, send help. Help me understand. Please. **TL;DR**Luc Besson made the Fifth Element with fun characters and tonally enjoyable scenes of goofy sci-fi shlockiness. Valerian’s lack of fun characters illustrate how quickly a movie can crash right into the ground. Beyond some lush visuals and richness, beyond incredible aesthetic design and especially incredible costuming (this could win an Oscar just like Suicide Squad did), and beyond Ri-Ri’s solid cabaret performance, this flick ground to a halt with its uncharismatic lead. Hopefully others can explain what Valerian’s character was going for and how it worked for them. **RECOMMENDATIONS****Recommended for fans of this genre?** Yes. And only of this genre. This movie is for those that like hard sci-fi concepts and piecing together a lush universe and imagining better stories than what is currently on-screen. It’s for folks that care more about the aesthetic design and the way things might work than the characters.  **Recommended for non-fans of this genre?** No. Honestly, no. I struggle to recommend this to anyone who would not like sci-fi because there is no emotional core to this film.  Semi-arbitrary score: 2 out of 5 stars."
    }
  }
}
