{
  "movies": [
    {
      "id": 1,
      "release": "July 2017",
      "name": "Valerian and the City of a Thousand Planets"
    },
    {
      "id": 2,
      "release": "July 2017",
      "name": "Atomic Blonde"
    },
    {
      "id": 3,
      "release": "July 2017",
      "name": "Dunkirk"
    },
    {
      "id": 4,
      "release": "August 2017",
      "name": "Naked"
    },
    {
      "id": 5,
      "release": "September 2017",
      "name": "It"
    },
    {
      "id": 6,
      "release": "September 2017",
      "name": "Mother!"
    },
    {
      "id": 7,
      "release": "September 2017",
      "name": "Kingsman: The Golden Circle"
    },
    {
      "id": 8,
      "release": "October 2017",
      "name": "Blade Runner 2049"
    }
  ],
  "reviews": [
    {
      "movieId": 1,
      "submissions": [
        {
          "title": "Can We Discuss WHAT THE FUCK Happened To VALERIAN and If its Redeemable Qualities Can Somehow Shine Through the Blunders that Reside at the Core of the Film?",
          "author": "e-vaughn",
          "markdown": "Like many that hold 'The Fifth Element' dearly in their hearts from their youth, I was pretty damn amped about Valerian. 2 of 4 of the trailers made it look like a decent enough lil adventure story, and the lushness of the visuals were enough to get my gears churning putting together all these little sci-fi concepts into *some* sort of sensible world-view. See, that’s what I absolutely LOVE about sci-fi as a genre and setting. It’s a straight-up playground for any creative visionary, and visuals/concepts alone can sometimes carry a sci-fi movie to great heights.\n\nThe Valerian trailers touched on a sense of excitement that *I remembered* the Fifth Element touching on. It looked fun, silly, and dramatic. There was a sense of rigidity in the lead actors that I did my best to dissuade myself from feeling. To be completely honest, neither of the two leads have done anything in any flick that I have actually really been impressed by. I wasn’t going to let a trailer get me to vilify what could be a solid flick. As reviews poured in around 70% on RT, I was actually pleasantly surprised… but then I started reading them and the numbers kept dipping over time. Still, I bit the bullet last night and watched Valerian: City of a Thousand Planets and hooollly shit, what happened?!?\n\n## Redeemable Qualities [Spoilers from here on out]\n\nI am stoked I saw this. Really happy to have seen it, actually, even though I think it was actually boring and hard to watch at times. I laughed during scenes I was supposed to laugh at, and found some of its thematic silliness to hit home well enough. I was legitimately amped on the introduction which showed diplomatic greetings over 150ish years and amongst an plethora of diverse alien species. My love of Sci-Fi and RPG style games (Mass Effects and KOTOR are great examples) really tuned my imagination when piecing together lore. Each alien race had enough detail and biological design that made my mind swirl: Ooh, how do these guys gather food? Is this a working class? Are these data-sentient only? How does his tentacle not wither outside his suit?![valerian Lorraine](https://pbs.twimg.com/media/C8GYxQAWkAEl5Co.jpg)”\n\nTHIS. This questioning and curiosity around concepts alone make this movie something worthwhile. “How does an alien exist that can reproduce nay material plugged into it? Why is this other alien race purely pacifistic?” These questions often came from the impeccable design the movie lavishly had on display. Honestly, the design and visual direction of the movie is easily its strongest shine. Spacecraft architecture, UI interfaces, weapon concepts, platforming tools, handheld interdimensional portals, and the clothing. Oh MY GOODNESS, the CLOTHING! The clothing and design of the fashion was extraordinary. Not only did the clothing look incredible, pull from various cultures, imply some practicality, it was all encompassing and really built the world up (especially in the intro scene). The clothing was beautiful and engrossing in a way that supported this movie’s value as pure eye candy, and it led to certain cerebral provocations.\n\nI had so many curiosities… but the more I thought about them, the more each concept and idea felt shallow and untethered to the universe crafted before us (Why the fuck does the Mul race need 20megaton energy pearls, and how come they aren’t utilized by ANY character in this movie?) and much less to any central narrative.\n\nI genuinely liked some Sci-Fi elements of this flick, but then there wasn’t any new concept that felt new and fresh and made me really think. I found much intrigue in the description of Alpha, with its neuron-building aliens, its underwater marine meanderers, and its finance-loving data-aliens. Sure, these bite-sized concepts got me enticed and many of them were gorgeous, but the sum of their parts add up to less than each one might have stood as a fascinating youtube video, or something.\n\nThis is entirely because the central narrative and driving force of the movie is about as off-kilter and uncharismatic as it gets.\n\n## Shit to Beef About\n\n![valerian shit](https://gifed.video/gif/001/pearl_alien_valerian_and_the_city_of_a_thousand_planets.gif)Fuck man, there’s a lot to beef about in this fucking flick. Since I’m on the narrative and the action and world-building, I’ll stay here for a second before moving to the elephant in the room. As I mentioned, Sci-Fi concepts have much less impact when they fail to actually drive the storyline forward and instead exist only to demonstrate some concept. Laureline’s entire expedition to the water-zone had her doing no actual heroics, save for sticking her head into a jellyfish butthole, AND that was done only to locate Valerian’s location. There are probably a thousand different side-quests that she could have done, and this movie chose this one. That’s fine, I guess, but it didn’t build her character in any capacity and there was a huge Checkov’s Gun blasted at our face when she stayed in the Jellyfish a second longer than was allowed yet there were ZERO repurcussions. Ok, fine. I guess we got a semi-inspired marine-life biology scene and got to look at Cara Delevingne stretch her ability to express fear and bewilderment, but this scene didn’t add to the whole in any way.\n\nThe action was *not* terrible. The melee combat with the dumb floppy aliens was actually pretty great, while the gun fight was horrendous. One of the best action bits of the trailer showcases Valerian running through multiple walls before exploding out into a chasm and then using a platform generator to traverse a gap, run through a neuron-harvesting field, and then propel underwater to arrive at a destination. Why does he do this? Is he being chased? Is he in trouble? Is it necessary? Well… no. He literally runs through those because it’s a shortcut. The best action scene has no gravity to it, at all.\n\nThe movie has no stock in our emotions at all, it would seem. It never creates tension, and I’d legitimately be surprised if anyone felt anything for these characters other than annoyance. And here we get to the crux of the problem: our two lead actors.\n\n## Acting, Charisma, and Screen Presence\n\nI didn’t expect the acting to be excellent based on the trailers, but I honestly didn’t expect this level of ineptness. It honestly is SO fascinating because of how much of a blunder this is. Like how the FUCK did you get actors that are this weak? Cara’s acting is relatively ok. She never wows, but she does her part has an occasional note of emotional expression that hits home. I liked her ending monologue about love, rule-breaking, and what she needs from commitment. It was directed at the wooden barn door that is Dane DeHaan, so it was effectively a monologue. Despite Cara’s best efforts, I was not inspired in any capacity, but I *can still* see why she was cast (those eyebrows, amirite?).\n\nI don’t want to sound incendiary, but I have no fucking idea why how Dehaan snagged this role. None. Like, what was Luc Besson going for with this? I really want to peep the source material comics to see if there’s some remnant of understanding it’ll denote as to why DeHaan was the most uncharismatic, phoned-in, annoyingly voiced, low-effort, semi-sarcastic, monotone leading man. There’s GOT to be some vision they were going for, right?\n\nThis fool had ZERO fucking screen presence. He had no energy, no chemistry with his lead (save for literally the final kiss which looked plausibly genuine), had no zest to his punchlines or jokes, and just behaved inconsistently as fuck between his “soldier” mentality and his grade-school attempt at playful banter. It was actually frustrating to endure. It made me realize just how important charm and energy matter in on-screen characters, and DeHaan’s depiction of this space-rogue/military agent/spy dude was probably the largest blemish of a leading man in an otherwise well-crafted movie I’ve seen in cinema. That seems hyperbolic, but fuck homies. **If you liked his acting, PLEASE let me know what you liked. I am genuinely curious what about his portrayal drew you to him, and how you related to him.** I feel like I could talk about the acting and how important it is have captivating characters that *can* be subdued or reserved yet still hold screen presence. Examples would be Gosling in Drive, or [Dan Steven’s in The Guest](https://www.reddit.com/r/TrueFilm/comments/2s6ozj/the_guest_and_the_cinematic_expression_of_human/).\n\nActing aside, the movie had no attempt at building Valerian as a character to give a shit about. So Valerian is a ladykiller…. That’s the only backstory we get? How? With THAT level of charm? It makes no sense. And Laureline makes fun of his lack of commitment, so his solution is to propose right then and there? How are these two into each other? And she’s *actually* pondering a life with him…. Why? He’s had about 40 other partners he brushed off, and then like, he’s inexplicably going to be faithful to Laureline for some reason? The fuck is this? And he’s a soldier says he “plays by the rules” yet is constantly shitting right where he eats and banging his partners? WHAT?! It’s a weird feeling when the most unrealistic thing about a sci-fi movie is the very human element and the only thing I can’t suspend my disbelief about.\n\nAnd it’s not like Luc Besson doesn’t understand good acting or how to NAIL this challenging tone of silly slapstick characters. You’ve seen The Fifth Element, right? If you haven’t go peep that immediately. I literally watched it right after Valerian to see how it stacked up. Korben Dallas, Leeloo, Zorg, and motherfuckin’ Ruby Rhod are DRIPPING with charm. They are all so over-the-top and adorable, flamboyant and energetic, emotive and they all have range. Korben’s sarcastic “fuck off with your bullshit” demeanor actually works and builds towards his character. In the first 2 minutes of him being on screen, we learn a TON about him. He’s an ex-marine, fucking up at his job, has mommy issues, has a bad smoking habit, and has amazing combat boots. I mean, Luc Besson directed these characters to success. It just makes the intention behind what happened with Valerian’s character make no sense at all.\n\n![valerian what happened](https://68.media.tumblr.com/388b275bed68efaf981e3d6061ce1b86/tumblr_ogfugmWi8T1tamedoo1_500.gif)What happened? What am I missing? Are people relating to DeHaan in this role? Is he embodying something to aspire to, in any capacity? Somebody, please, send help. Help me understand. Please.\n\n## TL;DR\n\nLuc Besson made the Fifth Element with fun characters and tonally enjoyable scenes of goofy sci-fi shlockiness. Valerian’s lack of fun characters illustrate how quickly a movie can crash right into the ground. Beyond some lush visuals and richness, beyond incredible aesthetic design and especially incredible costuming (this could win an Oscar just like Suicide Squad did), and beyond Ri-Ri’s solid cabaret performance, this flick ground to a halt with its uncharismatic lead. Hopefully others can explain what Valerian’s character was going for and how it worked for them.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Yes. And only of this genre. This movie is for those that like hard sci-fi concepts and piecing together a lush universe and imagining better stories than what is currently on-screen. It’s for folks that care more about the aesthetic design and the way things might work than the characters.\n\n**Recommended for non-fans of this genre?** No. Honestly, no. I struggle to recommend this to anyone who would not like sci-fi because there is no emotional core to this film.\n\nSemi-arbitrary score: 2 out of 5 stars."
        },
        {
          "title": "Valerian Reviewwwwww",
          "author": "Megan",
          "markdown": "Mind-blowing advanced CGI? Check. An accomplished and highly regarded sci-fi director? Got him. An astronomical budget? Through the roof.\n\nSound like the formula for the next sci-fi cult classic? If so, then you forgot the same vital ingredients the creators of Valerian did: a compelling storyline and an engaging cast.\n\n![valerian crash](https://media.tenor.com/images/2aba59f067b1c2f43337953efeb91cee/tenor.gif)While the film was wrought with intriguing futuristic concepts and beautiful design, its visuals weren't enough to make up for the poor acting and sub par writing. Both starring actors, Cara Delevingne and Dane DeHaan, gave underwhelming performances. They failed to bring any charisma to their characters, establishing no chemistry with the audience or each other. They are not solely responsible for the flat tone of the film, however. After all, the script gave them little to work with.\n\nWe first meet Major Valerian and Sergeant Lorelaine while they are enjoying a virtual beach. A playful, choreographed wrestling match ensues, sparking hope for a sexy sort of tension. Unfortunately, that was the epitome of chemistry, and the rest of the film lacks any hint of flirtation, arousal or even close friendship. Even when he proposes marriage, there is no sense of romance, love or excitement. In fact, the only catalyst for his proposition is to combat Lorelaine for calling out his fear of commitment. What a great foundation for marriage, saving face. The lack of emotion isn’t limited to the title character, however. This sense of apathy expands through the length of the film. I would argue that this is due to a complete absence of backstory.\n\nThe gaping deficit of context surrounding the characters inhibits the viewer from empathizing with them. The information hole was so distracting that I actually turned to my partner to ask if the movie was a sequel. It seemed as though the title character was intended to be a smooth, charming Casanova of sorts. His empty lines and blank history made it nearly impossible to frame him this way or even find him attractive hero. The heaviest collateral damage from this oversight came in the death of Rihanna’s character, Bubbles. Because our main character was so devoid of substance, his emotional response came across as cheesy. A moment that was inserted as a sentimental motif was just too little too late.\n\nWhile the incredible imagery that accompanied this empty plot wasn’t enough to save the film, it does have merit and deserves some mention. Particularly, I found the technology presented very intriguing. Early on, we see a huge empty park in the desert with hundreds of people wandering around. It is then revealed that they are immersed in some kind of virtual travel to another dimension via a VR like headset. Even more fantastic is that they can purchase items and then somehow transport them back to their reality. Strangely enough though, their purchases are nothing exciting and seem a poor choice on the writer’s part. If one of the few redeeming qualities of your film is it’s science fiction concepts, why not have them purchase futuristic gadgets? Instead, they are excited about the pile of junk they’ve acquired. What a wasted opportunity.\n\nThere is no denying that Valerian was both innovative and technically impressive. It was fun to watch for the imagery alone. However, this doesn’t keep the film from feeling less like a cohesive and immersive story, and more like a highlight reel of a writers' rooms best sci-fi ideas."
        },
        {
          "title": "My thoughts on Valerian",
          "author": "Jacob",
          "markdown": "When I first walked away from Valerian and the City of a Thousand planets, I felt relieved.  Based on a comic book series of the same name, this adaptation contains very little to keep the audience engaged beyond the sex appeal that comes with flashy animations, handsome actors, and tip top visual design and direction.  This appeal fades quickly as the narrative, and dialog are not very engaging.\n\nThe main actors themselves deliver lines that feel sophomoric and are lacking poise and expertise of professional special forces agents. Valerian exudes a boastful air as a major in some galactic law enforcement institution, and comes across as Johnny Bravo.  He mentions his epic love life and his sky high aptitude as a special agent, but he is always unprepared and by sheer luck and the actions of those around him, he is able to succeed.  The problem with this is that the emotional resonance I have with this character is that of a stoic idiot with an enormous ego, which rubbed me the wrong way constantly.  I felt for Laureline as she complains about his behavior and attitude, until she somehow falls even more in love with him by the credits.  The advent of this decision brought about by a moral conflict/resolution between the two characters which felt contrived immediately.\n\n![valerian aliens](http://cdn.movieweb.com/img.news.tops/NEoHmnwuKlNTsr_2_b/Valerian-City-Thousand-Planets-Character-Posters.jpg)I get that this is based on a comic, (which I have not read) and that for the most part the narrative of graphic novel can be allowed some leeway to showcase a more visually compelling experience, and in that sense this film is quite fun.  Character art and visual set pieces allow you to become lost and engrossed in the stories atmosphere and setting.  All of these aspects of the film are good, quite good, but there was a big gap for me in storytelling as Valerian and Laureline were just so one dimensional. I did not empathize with them and found myself wishing that they were replaced with different actors or received better direction or.. something.  Like watching two models blue steel their way through every and all situations, without a trail of breadcrumbs to connect the dots."
        }
      ]
    },
    {
      "movieId": 2,
      "submissions": [
        {
          "title": "Atomic Blonde’s Chemical Composition Shines Brighter than the Mix of Its Parts",
          "author": "e-vaughn",
          "markdown": "# The Action Landscape in 2017\n\nIt’s a great time to be an action movie cinaphile. While the 90s and early 2000s held their respective heads above water, the recent years’ entries have provided some interesting blends of incredibly well-choreographed action, solid editing, and stylistic cinematography. Moving away from the horrific shaky-cam, hyper-editing, sloppy action of the Bourne movies or Bond entries like Quantum of Solace, we find ourselves in a landscape with fresh action-flicks like The Raid 1 & 2, John Wick, and now Atomic Blonde.\n\nUnlike those other flicks which have a cemented identify in their action core, Atomic Blonde tries to be a bit more than a wonderfully well-crafted dynamo. Unfortunately, that ambition reveals several missteps that must be highlighted along with its successes.\n\n# Atomic Bombshells that Work\n\n![atomic blonde fight](https://cdn.theatlantic.com/assets/media/img/mt/2017/07/atomic2/lead_960.jpg?1501211410)Atomic Blonde has much to be praised. I’ll get to the most exceptional component of its action in a little bit.\n\nIt’s got a stylistic tone and aesthetic that is reminiscent of its comic-book adaption roots. I love the soundtrack and 80’s vibe peppering the flick, while still maintaining a contemporary visual feel and cadence. The editing is fun and experimental early in the movie, but the latter half is strangely missing any editing gimmickery or flare.\n\nThe fashion is exceptional. Both Theron’s character and Macavoy’s are dripping with style and intentional clothing choices. There is a sexiness to the film and the color contrast is sharp throughout, without ever feeling too glossy or oversaturated. The movie is mostly cool hues that exaggerates the neon whenever it appears.\n\nAnd of course… the reason you likely watched the movie is the fighting and action. This is far from the first badass female protagonist we’ve seen leveraging physical combat to overcome her obstacles, but it might legitimately be the most well-constructed underdog fight scenes of any film in recent memory. The physicality of Theron’s performance, the style of martial arts she uses, the amount of brutal punishment she endures, the choice to contain abundant long takes and intimate hand-held camera footage… all of these make the action incredibly striking. Dripping with oomph, even.\n\nTo see a female combatant handle herself with such savagery is rare. To see a female fighter actually have grounded physics to her combat and deliver strikes and engagements that provide a realistic sense of momentum and weight is beyond rare. To see a female combatant clearly unable to outmaneuver a male opponent that has 100lbs on her is rare. To see a fighter that takes ridiculous punishment and showcase fight scenes where enemies visibly get winded and bleed out is rare. To have all of these massive action-focused positives embedded in a movie that tries to aim for more is also rare.\n\nThere are several note-worthy scenes to this flick. The hallway long-fight is exceptional. It’s an insanely long take (very likely interspersed with clever cuts when the camera hits flush against someone’s clothing or a wall, close-up) yet it moves dynamically and brutally. I can’t deny that I was in a state of awe for most of the fight scenes. Like John Wick’s palpable love of murdering goons, Theron’s character clearly enjoyed the physical struggle, which made me enjoy her struggle.\n\n# Atomic Elements that Fizzled\n\nWhile the intentional physical struggles were a sight to see, there were several components to this movie that prevent it from being a dazzling knockout.![atomic blonde action](http://cinemavine.com/wp-content/uploads/2017/04/atomic-blonde-movie-charlize-theron-1-1.png)\n\nFirst and foremost, this movie is almost immediately comparable to John Wick in its style of action and combat (yet it very handily relies more on hand-to-hand combat, rather than gunplay). However, it isn’t a revenge thriller. It’s a spy flick. A spy flick that has a relatively weak plot, designed only to propel the story forward in search of a singular confidential “list” in the bowels of Berlin.\n\nThis plotting forces comparisons to much stronger spy-flicks like Mission Impossible, or character driven capers like the Bond franchise flicks. Unfortunately, the star player that is Theron’s character does not have the gravitas to hold down a spy-thriller. Her coldness makes her feel more like a Glacial Blonde rather than an Atomic one. I don’t recall a single moment where she is charming in her personality. There is never a moment where she actually uses disguises or persuasion, mental trickery, or anything that would normally be contained in an espionage picture. In fact, she’s so glamorous and beautiful that she sticks out like a sore thumb.\n\nFor a movie that should and will very likely aim for a franchise streak, we’ll need to see more dynamic expression from our Atomic Blonde in order to preserve any notion of credibility that she’s actually good at being a spy… and not just a blood-thirsty combatant. Oddly enough, James Macavoy’s character lays on the eccentricity and spy-skills throughout, so the movie does have a notion that these elements are somewhat important.\n\nIt’s a bit funny that the most realistic parts of the film are the physics-based fight scenes, yet the CIA sections and spy-bits feel untethered and in need of backstory, which I hope to see developed in future films.\n\n# [TL;DR] An Atomic Brew that Still Works\n\nAll in all, Atomic Blonde is a pretty enjoyable movie for anyone hungry for an excellent action film. For fans of well-crafted choregraphy and stunning camera work, definitely peep this bad boi. For fans of style of substance and bountiful eye candy, this one’s for you. For folks that don’t much care for the driving force of plot in their actioners, this’ll definitely be an easy one to give grace to. Here’s hoping that any future sequel or prequel or whatever film that stars Theron’s character once more has her demonstrating a bit more of her psychological competence. Keep the kicks and random-object fight scenes coming, and I’ll still be snagging a ticket to see if the next Blonde picture goes as nuclear as this one.\n\n**RECOMMENDATIONS**\n\n**Recommended for fans of this genre?** Yes! Most definitely, this is a strong entry in action. Did you read my praise for how well-constructed the action is? It’s the best part! Go peep this homie. It’s definitely got comparisons to John Wick in many ways.\n\n**Recommended for non-fans of this genre?** Maybe. There is enough of a crispy cool package here that is diverse and beautiful that many can enjoy it, even if they’re not action fans. However, the action is easily the greatest part and the strongest contributor, so if you’re averse to action, give this a pass.\n\n## Semi-arbitrary Score: 8.5/10"
        },
        {
          "title": "Great Noir Action with an Intriguing Narrative",
          "author": "Jacob",
          "markdown": "**I’m a big fan of the noir style of storytelling.**  The dark undertones and gritty characatures have always been appealing to me throughout many mediums.  There’s just something sexy about people acting joyless while swilling hard liquor and chain smoking.  Atomic Blonde captures many of those moments perfectly while dealing out a hefty dose of fighting.  The story itself is not half bad but it does trip over itself a little bit at the end, leaving a pretty satisfying taste of blood, vodka, and cigarette smoke in the air.\n\nAtomic Blonde is an adaptation of The Coldest City, a noir style graphic novel from earlier this decade.![atomic blonde dark room](https://coronadotimes.com/wp-content/uploads/2017/07/delphine-and-lorraine.jpg)  And as an adaptation it subscribes wholeheartedly to the stylized dark brooding unhappiness that noir is known for. The main characters live off a diet of booze and tobacco while shifting from bars, back rooms and alleyways of 1980s Berlin.  All of which are just a means to keep their toils in check as they come closer to unraveling the mystery of “Satchel” and the secrets kept between world powers.\n\n**This brings us to story.**  On the surface this story starts with the murder of British spy, some stolen top secret information, and the blonde bombshell sent into the fray to fix everything and find out who done it.  The story contains plenty of intrigue, espionage, and thrills to keep things moving along at pretty good pace, and slows down just enough to enjoy the action and steez the movie really wants to convey.  From the very beginning of the stories exposition, things have gone south for the West and there’s a hill of beans between our Protagonists and the answers they seek.\n\nThe plot points contains nothing crazy, pretty standard James Bond antics but what this movie did well was present the plot in a sexy stylized way.  The only real qualm I had with the movie was the very end when some of character's true intentions and motivations are revealed, living a bit of a head scratching feeling.  I think this really came down to Charlize Theron’s character Lorraine Broughton, whose character was very very cold.  It was hard to get a sense of what motivated her at one point as she was just felt like a machine.  And I think for me the right shade of miserable is necessary as a protagonist of a noir thriller.\n\n**The great bits of this movie for me were clearly its style and action.**  I very much enjoyed the fight scenes throughout the film.  The hand to hand combat felt pretty satisfying and the limited gunplay was handled very well.  Even though Charlize’s character was a skinny white girl, I felt her scrappiness really shone through, allowing her smarts and skill to really make up for her reduced stature.  She also gets the shit kicked out of her which feels appropriate.  Several action sequences also featured long extended shots, with the camera remaining close to the protagonist.  These added to the feeling of stylized grit that Atomic Blonde worked hard to portray.\n\nAll in all. This movie was a success.  The colors, music and overall aesthetic gave me all the right noir triggers to keep me excited.  The narrative does an okay job of providing the audience with mystery and intrigue but has a pretty unsatisfying ending featuring a main character that is unrelatable and cold.  Would watch again."
        },
        {
          "title": "Atomic Blonde",
          "author": "Megan",
          "markdown": "**Vodka on the rocks**\n\n is not only the preferred drink of the title character, but a perfect metaphor for this film- cold, powerful and sure to lead to a good time. Charlize Theron plays Agent Lorraine Broughton, a top ranked M16 badass on the hunt for double agents in 80s Berlin.\n\nWhile the story was a little shaky (there were honestly points I was downright confused at what she was looking for), the incredible fight choreography more than made up for it. I can't recall another film where the fight scenes so realistically highlighted the struggle to come back after taking a hit. The violence felt real and raw, and her wins felt all the more satisfying. Charlize’s steely charm, the punk aesthetic, and the incredible fashion design all contribute to an immensely fun watch. Perhaps I was drawn in by the violence and the glamour...but is that such a bad thing?\n\nAfter the film, I was discussing it with some friends who suggested that Lorraine was almost too cold to be likable. They thought her character fell flat and lacked charm or charisma. It made me pause. A character I found empowering, they saw as a shell.\n\nLater that night, I thought of Wonder Woman. Anyone who has seen me in the last few months is aware of my passion for WW. I could go on and on (and I will in a review to come) about my feelings for this important film. It comes down to this- the thing I love most about Wonder Woman is the complexity of Diana. She is a character who not only exemplifies strength, but also compassion, intelligence, loyalty, and justice. She is not a one-dimensional character, not a stereotyped, flat excuse for progress in film, but an inspiration.\n\nCompared to WW, Atomic Blonde is definitely not the picture of honor. Her intentions are questionable and her loyalties are muddied. She does not embody compassion or diplomacy or embrace nurturing instincts, but she is intelligent, and competent, and a force to be reckoned with. So, was it empowering to see Charlize kick a ton of ass and see hollywood glorify a woman for her physical strength? Fuck yeah! The truth is, we need an increase in both the quantity and diversity of female representation in film. Not all women are empaths. Not all women have pure motivations. And not all women have the capacity to maintain a perfect poker face while being interrogated or take a punch to the gut like a champ or walk off a bodyslam. Women are complex, and I am glad to see a strong, complex, substantial female character in Lorraine Broughton. She isn’t perfect, but her strengths are inspiring and her humanity makes her engaging.\n\n **4/5 Stars**"
        }
      ]
    },
    {
      "movieId": 3,
      "submissions": [
        {
          "title": "Dunkirk – a movie that’s less cinema and more vicarious amusement park",
          "author": "e-vaughn",
          "markdown": "# The Lineage of Mr. Nolan\n\nChristopher Nolan has slowly and steadily crept his way up to the mantle of A-list Directors that I find consistently compelling. The moment I processed the entirety of Momento and rewatched it, I had a growing feeling this man possessed a cinematic flair that would be worth noting for years to come. Today, I am staggered by just how undershot my initial praise has been.\n\nBatman Begins, the Prestige, the Dark Knight, the incredibly well crafted Inception, and then Interstellar had Nolan on a hot hot hot streak. When it was announced that Dunkirk was a war movie that relied heavily on practical effects and it was to have one of the highest budgets, it was easy to get excited. When it was lauded during early reviews, it was easy to get excited. When it landed at 94% on Metacritic, with reviews claiming quips like it was along the lines of “a war movie that stands among greats like Saving Private Ryan and the Thin Red Line”, it was easy to get excited. But when I sat there, watching this movie, I was surprised as just how hard it was to get excited.\n\n# More of a Proof of Concept Rather Than a Film\n\nIt’s easy to watch Dunkirk and gawk at the craftsmenship. As a cinephile that appreciates the struggle of film making and will often praise uniqueness (even when it’s uniquely unpleasant), this movie is a safe bet for recommendations. In a way, this feels like a war movie that is unlike any other war movie, or almost any other movie I’ve laid eyes on. It’s much more of an experience or vicarious ride than most movies. Because it is this way, it also has many purposefully missing components that impact connectivity to it as a film and decrease relatability, interest, or investment in what is happening on screen.\n\n![dunkirk beach](http://cdn5.thr.com/sites/default/files/2017/07/dunkirk_still_8.jpg)The technical proficiency is phenomenal. The movie is LOUD. It’s bombastic and physically hurts at times. It showcases dizzying cinematography and scope. It has a sense of presentness for the audience because of its framing and intimate proximity with the few character the camera follows. Right out of the gate as we’re shown the only footage in the actual town of Dunkirk, bullets start flying and immediately entranced me in this feeling of claustrophobia, hopelessness, and sheer luck. A squad of about ten min immediately is cut down to a single survivor, and there is no emotional affect apparent from the character we’re left with.\n\nThe other 3 fragmented storylines showcase a familial sea ship (one day’s timeline), a dogfighting aircraft (1 hour timeline), and the aforementioned stranded private on the coast awaiting pickup (approximately one week’s timeline, if I recall correctly). These characters have no backstory and very little personality, save for the seamen’s moral compass. These characters are purposefully removed from humanity in a depiction that lends them to be more like avatars, rather than characters. No backstory. No experiential motivations for their actions. No forward momentum other than saving themselves or someone else’s life.\n\n# Detached Action is Boring Action\n\nThis creates a viewing experience that is inherently detached, for me. As I watched bullets flying and sat gripping on my seat-rest due to the cacophony of war-mess, I found myself never really impressed by the action. I was constantly impressed by the shots and framing and scope, but never the action. These depictions of war feel huge, realistic, and completely not glamorous. There is no glory here on screen. No advocacy that lends our audience to ever want to be near these environments. Even when the heroism in the air causes the soldiers to erupt into applause, it feels like an insignificant moments as these faceless avatars are thrust into the next minute where they must continue to strive towards survival.\n\nAt the end of the relatively meager 106 minute runtime (especially small for a war film), I found myself physically exhausted from the action. It was an ordeal to sit through because it was never-ending noise and unemotional action. Not “poorly crafted”, action, mind you. But unattached action. I found myself yearning to take this intended experience a step further, and watch it in IMAX. Or better yet, snag a pair of VR goggles and experience the whole film in a 1st Person POV from someone’s perspective. Really put me in the action. If that’s the aim, that is.\n\nThere was one compelling thought provoking moment that really surprised me. And this stands as a spoiler. \n\nWhen the young boy on the sea vessel tells Cilian Murphy’s character that his friend will be fine, even when he won’t… I was quite shocked. This was the single rousing moment of surprise in the whole film, and I found the boy’s decision to be one that took more nobility than the majority of sacrificial acts constantly on display. It also required more processing than the entirety of the rest of the movie. I was simultaneous impressed and contemplative.![dunkirk sitting beach](https://media1.popsugar-assets.com/files/thumbor/mHOiKUjNOEzftyHNJk3hItZLpzo/fit-in/2048xorig/filters:format_auto-!!-:strip_icc-!!-/2016/12/16/794/n/1922283/ddc0efbec1c70c9e_1.gif)\n\nOther than that, the credits rolling gave me a sense of relief. Not because of tension, but because I could now rest. I want to highlight that I am tying this sense of exhaustion as a unusual reaction in my that stems from feeling the characters have no life or audience investment ask of them. I’ve watched countless action films and rarely feel “tired” watching any movie. This reaction makes this movie feel truly unique in this way, for me, and I must say that its uniqueness makes it feel all at once novel, hard to recommend, and also pale in comparison to other War Movies that I might place above it (Saving Private Ryan, We Were Soldiers, Black Hawk Down, Full Metal Jacket, Fury, and even Enemy at the Gates).\n\n# Conclusions and whatnot (TL;DR):\n\nDunkirk is a unique experience. It doesn’t feel cinematic. It feels vicarious and detached. It feels abstract and ungrounded. It feels like a tour of war rather than a character journey. It abstains from compelling dialogue and characters, and embraces claustrophobia and a feeling of hopelessness. It’s not a fun movie to watch. I wouldn’t want to watch it again… I don’t think. But I admire and respect it. I feel it crafts an experience comparable to that of a videogame, yet is decidedly a passive interaction. It doesn’t give me much to chew on because my teeth were clenched a bit too hard throughout. It’s boom boom loud and expendably violent, yet it doesn’t reward us with gore for the gorehounds or style for the fashionistas. It rewards us for enduring… and that’s not exactly a fun experience for a movie. And that’s ok.\n\n**RECOMMENDATIONS**\n\n**Recommended for fans of this genre?** Yes. For fans of war movies specifically, this is a unique experience and its beyond well-crafted enough to recommend one endures the runtime. It’s realistic and detached and desensitizing and not beautiful…. And sometimes that’s just the right depiction of war we need in our lives.\n\n**Recommended for non-fans of this genre?** No. I wouldn’t recommend this movie to most folks. I wouldn’t recommend it to action movie fans. I wouldn’t recommend it to non-action fans, or folks that watch movies to get lost in the experience. I wouldn’t recommend this to folks who care more about characters than the visuals. I wouldn’t recommend this to anyone looking to mull over the complexities of life or be provoked into brainy discussions. I would recommend this to someone who’s looking for a ride rather than a movie though.\n\n## Semi-arbitrary Score: 6.0/10"
        },
        {
          "title": "A Visceral Portrayal of War and its Humanity",
          "author": "Jacob",
          "markdown": "Christopher Nolan has always done a pretty good job of instilling his own brand of cerebrality to his films.  Something for your brain to chew on while the story plays out in front of you.  His batman movies were clearly elevated beyond most other superhero movies, with characters and themes that felt a little more serious and poignant rather than fantastical.  Movies like Inception and Interstellar gave us a fantastical quest but broke them down to showcase the stories themselves, making the characters and their struggles the set pieces for the narrative.\n\n**Dunkirk has done this to the max.**  Everything in this movie is done to showcase the characters in this movie and the primal motivations they have in a very dire situation.![dunkirk beginning](http://ww3.hdnux.com/photos/63/77/22/13628578/3/920x920.jpg)The movie starts off with a bit of slow exposition, hammering home that the entire British army is up against a wall and is trying to get home, then all hell breaks loose and the feelings of desperation mixed with fear begin and rarely cease.\n\n*The real character in this movie comes from the atmosphere.*  There is very little dialogue and the only characters that really have names are civilians.  The only thing we really get to know about these characters are their rank and what army they fight for. Everything else you need to know about them builds off of their behaviors as they try to escape their situation.\n\n**And their situation is pretty fucked.**  This movie does a great job at instilling that sentiment.  The story revolves around several groups of people caught up in what seems like a logistics nightmare mixed with the emotions of war.  Everyone is desperately trying to get off this beach and are sometimes acting irrational and deceitful.  Their story is one base emotions and the ones that make a difference are able to put those emotions aside and act dutifully.![dunkirk planes](https://www.technobuffalo.com/wp-content/uploads/2017/05/Dunkirk-Trailer-2-35.jpg)\n\nI think what Dunkirk has done very successfully is build a sense of tension, it’s hard to deny Nolan that.  From the beginning to the end you feel as though there is a horrible and dire situation on this beach, and not only are these characters experiencing the stress from these moments, but you as the audience are as well.  There are really loud and unpleasant noises, unglamourous and subtle action sequences that only let you experience the fervor of war, and long periods of pregnant, silent pensiveness.  You are here to empathize and experience these events, not feel wonderment or an impression of intrigue through exposition and plot.\n\n**But where does Dunkirk fall Short?**  For it’s impressive feats of war portrayal Dunkirk did make me feel uncomfortable at times, but in an engrossing way.  I wasn’t wanting the movie to end but I was looking for some catharsis which is achieved in a very small way when the story's conclusion finally reveals itself.  It was somewhat satisfying, but generally I was felt like there wasn’t much here in terms of face value entertainment.  It is a very special film that makes you respect the act of war and makes you feel connected to it in a way few other war movies have been able to do.  But it’s not a Summer night burner that you want to watch with a bunch of buddies."
        }
      ]
    },
    {
      "movieId": 4,
      "submissions": [
        {
          "title": "Naked - Reviewing, Analyzing, and Liking the Unlikeable",
          "author": "e-vaughn",
          "markdown": "![Naked](https://images-na.ssl-images-amazon.com/images/M/MV5BYmIzMzk2OTgtNWI1ZC00YTQxLWJiYWYtMzE5MTY4ODRiMTEzXkEyXkFqcGdeQXVyNzAwMjc4ODA@._V1_UY1200_CR135,0,630,1200_AL_.jpg)\n## Intentional Movie Choices\n\nThese days, I almost always watch my movies with a sense of intention. I almost always choose a movie that I know I want to watch, have read a bit about, believe it’ll have some tangible merit incased within its frames, and generally expect my time to be rewarded with something I can walk away from.\n\nEven if a movie has JUST ONE scene, or JUST ONE thought it elicited, I consider that movie a movie worth my time. If you read my other reviews, you’ll see that I based my recommendations on different profiles of folks who may/may not get that “lil bit of value” of that particular picture/game/experience.\n\nThe other night, I was feeling particularly apathetic towards choosing a piece of media to watch. This is a rarity for me. Instead of choosing a movie I had already read about, or progressing in whatever latest game I had been chipping away at (currently, it’s Hitman and Runbow), I yearned for a super low-brow, low effort, easy flick to enjoy.\n\n## Marlon Waynes and the Naked Premise\n\nMoving across the Netflix page, I immediately stumbled upon the movie for me. It was called “Naked” and it prominently featured Marlon Waynes on the cover. Now, I’ve grown up watching Marlon in a great many things. I have a serious soft-spot for this boi. He’s got an on-screen charm that is at once goofy and eccentric, and his use of physical comedy and gross-out humor has always led to a chuckle or two.\n\nI remember staying up past my bedtime as an 10 year old just to catch a half-hour of the [Waynes Brothers sitcom](https://en.wikipedia.org/wiki/The_Wayans_Bros.). I remember cackling like a hyena as a young kid in the theater watching Scary Movie 1. I remember Marlon’s demeanor and goofyness, his never-serious persona always seemingly able to roll with any on-screen punches. \n\nThen I remember being blown away by the only serious role I’ve seen him in as he destroyed our emotional center alongside Jarad Leto, Ellen Byrstyn, and Jennifer Connelly in Requiem for a Dream. Marlon was consistently entertaining to me, and now proved his ability to throw some cinematic heat in our direction. I then lost sight of him, until peeping a relatively low-effort but laughable “A Haunted House”. This movie was… ok, at best. Another parody in line with Scary Movie knew exactly what it was aiming for, and it hit with a self-awareness that one expects from a parody.\n\nThen years passed and I forgot about Marlon. Then, last night happened, and Naked popped up on the list of flicks. I pretty much started watching it immediately.\n\n“So it’s groundhogs day, but like, with Marlon Waynes’ style of goofball humor… and he wakes up naked in an elevator and has to get to his wedding on time?!” Ok, shit, that sounds fun.\n\nHonestly, I feel that this whole Groundhog’s Day/Edge of Tomorrow/Source Code/Westworld style of movie is always fun. Almost, literally, always. When is it not fun? It’s great to see the variations of shit played out, and I had no doubt that Marlon would throw down.\n\n![Naked Marlon](https://i2.wp.com/teaser-trailer.com/wp-content/uploads/Naked-movie.jpg?ssl=1)We see Marlon in this exact starting point like 40 times in this thing\n\n\n\n## Laughs and Sillyness\n\nSo this movie did its exposition and set up towards a romcom. Marlon’s a passionate substitute teacher who’s clearly afraid of commitment. He has a cute interaction with his fiancée as they board the plane and Regina Hall and him have pretty solid on-screen chemistry from the getgo. Her father is sulking, rigid, hard-ass of a dude who has beef with Marlon cuz he ain’t go no ambition. That’s fine, but man am I stoked to see some resolution from this dad-dude’s cold af attitude.\n\nThe movie quickly moves into the timeloop set point, with Marlon waking up repeatedly in the elevator. Personally, it’s easy to enjoy the character problem solving his way through a ton of different set pieces in order to achieve a perfect “wedding day” experience.\n\n![Goofy Marlon](https://static1.squarespace.com/static/51b3dc8ee4b051b96ceb10de/t/5968d56d86e6c08c90fd0715/1500042672613/)**No matter how stupid or goofy, Marlon pretty much always goes in on every scene he’s doing.**\n\nIt rolls through different characters, attempts, fight scenes, solid usages (though nothing truly unique) of the resetting time loop, and Marlon is going in in pretty much every scene. This one scene where his broken arm looks like a crazy straw that he pretends to suckle in his drugged-up post-ambulance state had me rolling on my couch giggling like a lil youngin’.\n\nThere were enough scenes that actually had me chuckling out loud, and it wasn’t too long before I started to wonder if this is the most I’ve laughed at like… any romcom, ever? No… could it be? \n\n# RomCom Heavy Lifting\n\nA romcom needs more than laughs though, right? And as the second half of the movie plays out, the audience is beginning to get reflections of deeper romance insights. These aren’t on some high-brow, philosophical musings… but they are sweet and down-to-earth and encourage a reflection of the powers of relationships. Might I remind you that while the movie isn’t ever taking itself too seriously, it’s somehow comfortable sitting in some thickness round its depiction of romance.\n\nIn often more ways than one, the movie depicts several important themes regarding romance, the autonomy of choosing our own partners, and believing in our lovers even when all others don’t see “what you see in him”.  It also hits on the tangible milestones of our romantic society: writing one’s own vows, enduring the trivial traditions of marriage, and of course suffering through the uphill battle of trying to win the favor of your fiancé’s father.\n\nThe movie is almost always goofy and aware of how flabbergasting silly it is. And then it comes through with some solid lil romantic scenes. We see Marlon move closer and closer to redemption in this time-looped “hour” every time he is sent back. \n\nThe ending was cute. The final dance was cute. The climax and resolution were cute. The whole thing, for fuck’s sake, is pretty damn cute.\n\nHaters Hating HEAVY\n\nAs the movie wrapped, I found that I had transitioned from the sleepy, low-effort self I was when I picked the movie to an energized and intentional state. I enjoyed the movie enough that I believe it kind of rocketed into the top 3 RomComs I have ever seen. I listed 10 Things I Hate About You and PS I Love You as some other standouts, Crazy Stupid Love, and 500 Days of Summer, and of course, Groundhog’s Day. And maybe the Wedding Singer… and maybe like Knocked Up (which I love). Is Amelie a RomCom? Oh, and There’s Something About Mary is great. Aww, ok, maybe Naked is like top 10 then. Maybe top 5? I dunno, it was FUN, ok?\n\n![screaming Marlon](http://3.bp.blogspot.com/-ctXo79f_kaA/U1R8v0zL8lI/AAAAAAAABjg/t9Inrb9w5Qg/s1600/hauntedhouse2+5.jpg)**Expect to see Marlon screaming a TON, just like this, in this movie. Is this why haters be hating? Cuz of his high pitched startle-scream?**\n\nI expected this movie to have like, a 34% on Rottentomatoes… but it didn’t. It has a whopping ZERO percent. That’s horrifically low. I don’t know what folks were expecting, or whether the movie was viewed as too slapstick, too low-bro, or too raunchy… or if they were somehow annoyed by Marlon, but *damn* son, 0% is fucking harsh.\n\nI walked into this movie knowing it would be goofy and silly, and most like a B-movie at best. So “bad it’s actually phenomenal” doesn’t quite work here, because the movie is pretty damned fun and not really cringy. It felt like it was hitting every note it was trying to hit, just like nails on a chalkboard try to sound somewhat abrasive. It was pretty self-aware, and came away feeling really sweet.\n\nMaybe this is one of those movies where it’s just purely subjectively fielded, and your mileage is going to vary greatly.\n\n**TL;DR**\n\nNaked was a surprisingly sweet and hilarious lil flick. Heart-warming and competently led by what I consider to be a charming leading man in Marlon Waynes, we get a fun time-loop RomCom similar to Gronudhog’s Day… except it doesn’t take itself seriously at all. It’s got abundantly dumb but still giggle-inducing scenes. It’s got characters that you either are rooting for or love to hate on. It’s got some solid time it set aside for real talk and grounded shit. It’s cute. Peep it.\n\n**Recommendations**\n\n**Recommended for fans of this genre:** Yes. So if you’re a RomCom homie or a comedy homie, or want something definitively light, I’d say yes, absolutely. This movie has enough laughs and enough lightness that it’s just enjoyable. It’s not that crass and has enough scenes to make it worth your time, IMO.\n\n**Recommended for non-fans of this genre:** I also want to say yes. Mostly because I want to see how you react to this thing if you don’t like to laugh, and if you don’t like romance, and you don’t like sci-fi. Ok. Honestly, you probably won’t like it. You’ll think the comedy is low-brow and the romantic scenes are sappy, and the acting is childish. If you want something heavy to weigh you down, this movie will be a helium balloon that lifts you up, all begrudgingly and shit. Good luck!\n\n**Arbitrary score out of 10:** 8.4/10"
        }
      ]
    },
    {
      "movieId": 5,
      "submissions": [
        {
          "title": "IT (2017) – When Copious Blood Meets Cinematic Polish",
          "author": "e-vaughn",
          "markdown": "## The Horror Landscape IT Stems From\n\n![IT (2017)]( https://upload.wikimedia.org/wikipedia/it/a/a9/It_film_2017.jpg)\n\nHorror’s been one of my most beloved genres for the longest time. I naturally gravitated towards horror when I was younger due to the visceralness of it, the special effects, the intensity, the sex, the comedy, the gore, and the idea that by watching these very “adult” films I was somehow shortcutting myself in the world of adulthood. I spent years learning about extreme horror films, studying the classics, reveling in the shlocky b-movieness of them, and even took a class at the University of Washington study the horror film genre.\n\nIt was in this class that I let my natural appreciation become a genuine love and respect for the genre. Horror films present to us a cinematic catharsis. They ground themselves in the most base and primal of human emotions: fear, lust, and humor. They are rides much more than most other genres, and while they may appear shallow on surface level viewing as a result of their visual, gripping nature… the masterful works imbue frequent symbolism and recurring themes to make statements about the human condition.\n\nWhether it’s a demonization of sex/promiscuity through the frequent murder of “loose” characters, a hard slap to the face of sinners to realign one’s religious “incentives”, or the constant use of a “final girl” to demonstrate progressiveness (feministic protagonists overcoming masculine horrors), persistence (last woman standing), and personality purity (character development and survival through desirable traits), horror movies have themes on themes on themes.\n\nHorror films often marinade in grotesquerie. They blossom amongst fear. They thrive from the disgust of their audience. In the miniseries and the 2017 version of IT, Pennywise the Dancing Clown exists to feed off of the fear of children. Much like the films themselves exist to leach off of the fear of the audience, the 2017 version of IT is a consistently polished and well-crafted traditional horror film.\n\n## The Polish and Concept of IT\n\nIT in 2017 is on a completely different level of budget and polish than the 1990 miniseries, and about 3 times the budget (12 mil compared to 35 mil, which is actually ridiculously low for 2017 anyhow). Instead of going towards a gritty, low-lighting, dirty aesthetic, the newest IT is glossy and polished through and through.\n\nThe premise of a fear-fueled paranormal clown that has little to no rules creates an easy horror concept to stick with. The rules are hardly etched in stone for the audience and the characters, so we are both stuck guessing about what could come next.\n\n## Filming and Visuals and Creepyness\n\nDue to this relatively easy premise, IT comes out the gate swinging for intensity, creepiness, and visual splendor. More than most other horror films, IT plays like a budding set piece of horror scenes designed primarily to take advantage of creepy and experimental cinematography techniques.\n\nMacro Shots ![IT uses the various techniques in the Horror wheelhouse liberally. Jump scares, macro shots, picture-to-black cutting, voice distortion, and much more]( http://68.media.tumblr.com/8682117f55d496a635e28959df2ee3c3/tumblr_onl5d9ufNz1qd4rf5o3_540.gif)\n\nAs Pennywise has the innate ability to identify the most feared component of a child’s psych, we are drawn into pulling characterization from each kid based on what they shit themselves freaking out about. A hypochondriac by proxy’s revulsion of disease, an orphan’s firey childhood memory, or a young woman’s period provide snippets into these kids’ background struggles and hint at some of the anxiety caused by avoiding our issues rather than confronting them directly.\n\nThroughout, the movie has ample room to play with horror imagery. It’s largest strength is how many film techniques it exploits to create vivid and creepy visuals. This movie doesn’t hit that hard on psychological horror, or bleak human horror. It’s main potency stems from the polish and craftsmenship each vignette or scene builds tension upon. Each scene has enough style and visual flair that it has the potential to imprint itself into your brain.\n\n![Mama Movement Test](http://33.media.tumblr.com/beee32d7b9942008f4cc5ff4af933d2d/tumblr_nw33emQihs1rdredko3_400.gif)The director’s prior movie, Mama, had some experimental techniques that played with the actual movements of the monster. \n\nIT uses a large variety of filming and editing techniques to make each scene come alive. Pennywise’s attempts at personifying anything remotely human while evoking maximal fear is pretty easy to see in every scene.\n\n![Pennywise appeared in many shapes in sizes in this 2017 adaptation, and formed his appearance to each characterizes most touchy sqirms]( http://cdn1us.denofgeek.com/sites/denofgeekus/files/styles/main_wide/public/2017/07/stephen-king-it-pennywise-the-clown.jpg?itok=FvisgCfB)\n\nFrom the way Bill Skarsgaard places emphasis on odd parts of his speech, to the way he drools and loses focus in his eyes (one eye often askew, locked onto the camera in a 4th wall breaking way), to the filming techniques used when he dances to exaggerate the unnaturalness of his movements… the movie is jam packed with visual luster that feels ripe for crafting nightmares.\n\n## The Shit that Scares Us\n\nI recall the strongest lingering visual from any horror movie came from the waterlogged snippet of the girl in the closet from the movie The Ring. I must have watched it when I was 14 or so, but that single second of menacing bloat on that girl’s face freaked me the fuck OUT. It remained in my memory for over a year, stalking my dreams and rising my heart rate whenever I thought of a waterlogged corpse. It wasn’t until I went back years later to stop the footage right on the screen and sat in the anxiety of that horrific face that I decompressed my fear.\n\nI feel that IT managed to pack in a great many visuals that approached the intensity of that particular scene. I really appreciated how intense it dropped its shit. It embraced its hard-R rating. It actually reminded me quite a bit of another well-received remake that I loved: The Evil Dead (2013).\n\n## Movement\n\n![IT plays heavily with various cinematraphic techniques to create a purposeful uncanny valley effect with the horror icons. Everyone moved unnaturally and creepily]( https://media.tenor.com/images/c56d833df8c57ffd5657d42b8c412f0b/tenor.gif)\n\nAs horror has most often relied on style over substance, IT double-down on the style and editing. Analyzing this movie from a cinematography perspective alone seems like it would be ripe for discussion. But all of its isolated scenes that worked wouldn’t resonate much without a strong cast and chemistry that, thankfully, was no absent.\n\nCast and Remake Comparisons\n\nThese young kids were great. They were funny, they were cute, and they displayed palpable fear in an incredibly believable way.\n\n## Reactions\n\n![The child actors nailed the expression of fear, friendship, and funniness. Nearly every one of these kids was top notch in their respective roles.]( http://digitalspyuk.cdnds.net/17/31/320x160/landscape-1501685544-giphy-43.gif)\n\nI’d venture to say that nearly every single component of this remake was better, and at the risk of over-using this word because it’s just so damned fitting --- polished. The kid actors were great. The freedom to swear added a great deal of comedy and “boys will be boys” language that had me giggling like I was 14 once more. The blood and gore caked on these children was a gore-hounds, and the way they often shook violently at some seizure made me wonder how some of these scenes were shot. Honestly, the bathroom blood volcano coloring had such a delightful crimson to it that reminded me, once again, of The Evil Dead remake.\n\nThe movie also chose to dig a bit deeper with psychological abuse that wasn’t really touched upon in the original miniseries. Here we see several catalysts for why the bullies are the bullies, through a cycle of abuse that is juxtaposed by Bev’s background story and her relatively well-composed demeanor. I don’t recall this level of psychological trauma in the original, but it was welcome and grounded the film just a little in the real life horrors some of us face day in day out.\n\nAnd of course there’s the comparisons of our two depictions of Pennywise. There is no knock against Tim Curry’s 1990 depiction of Pennywise, but Bill Skarsgard straight knocked it out of the park. Less human and less relatable than Curry’s depiction, Bill’s clown talks just a bit less, moves just a bit more, and feel much more alien and multi-dimensional.\n\nEven in the opening scene, we see Bill’s Pennywise effectively set the tone for the film. A strange accent mixed with actually making Georgie laugh mixed with blank-facing to pull back from providing the exact opposite emotions created this uneasy tug and pull experiencing Georgie’s confusion.\n\n“Creepiness” is a rather strange emotions to tease out. It seems to serve to explore the times we find a subject uneasy or increase tension in us. Does it stem from misalignments in expectations, or feelings of being watched, or chased? Either way, this new IT feels like he’s got creepiness on lock.\n\n## Themes and Symbolism\n\nOne doesn’t have to dig awfully deep to pick out some of these themes and motifs in IT. The balance of “belief” vs. “fear” as a double-edged sword is portrayed strongly, but ultimately begs more questions than it answers due to the film’s non-rigid rule set. When does Pennywise need to kill these kids? How much of a resource is fear, and is he using it efficiently? Why is he leading kids to kill adults? Is it based on some ancient quota that we touch on lightly but never fully explore?\n\nRecurring themes of the red balloon, floating, loss of innocence, and puberty are also explored in some capacity. We see bullies that push their violence more than most on-screen bullies do, and we’re tasked to weight the evils we see on screen. Is IT a worse evil than these near-homicidal kids, or are the negligent, physically abusive, or sexually abusive parental figures the stem of their problems? How do we derive hope amongst the reality that IT actually murders our friends, and how do we derive hope when our authority figures that are supposed to help us are the ones keeping us in a cycle of fear, limitations, and continued violence?\n\n**TL;DR**\n\nAfter a single viewing, there are plenty of things to get hyped about in regards to IT. The child acting and delivery is solid throughout. The gore and violence should satisfy most of the gore-hounds out there, and horror aficionados should revel in the technical mastery displayed in the stylized editing and cinematography. People looking to be scared shitless will have heart-rates spiked due to the creepiness on screen and the loud, startling sound-design. People looking for relatable characters should find at least one bit of resonance amongst the various children, exploited phobias, and sense of foreboding.\n\nAll in all, this is one very polished horror film that knows its strengths and puts doubles-down on highlighting them.\n\n**Recommendations**\n\n**Recommended for fans of this genre:** Duh. If you like horror, you should absolutely see this. Beyond the legacy, this movie has so many solidly crafted elements that gotta peak the interest of any horror buff.\n\n**Recommended for non-fans of this genre:** Yes. This is a harder recommendation as horror is very specific and abrasive for some folks. There are those that simply won’t want to experience this type of terror, and that’s understandable and I obviously can’t recommend this film to anyone that can’t consent to seeing gore, child-violence, experience terror, and be bombarded with horrific imagery. However, for those that can handle those things, the movie shines brightly enough in between the macabre moments to make it worthwhile for non-fans as well.\n\n**Arbitrary score out of 10:** 9.2/10"
        },
        {
          "title": "Horror Tropes meet Summer Adventure",
          "author": "Jacob",
          "markdown": "*I’m not a huge fan of the horror genre.*  It contains many tropes which I consider to be a little cheap. It can sort of feel like embodying a rat in maze and the only way out it to brave the path ahead of you. There is often no subtlety and you can often feel the terrifying moments coming before they startle you.  But Horror movies do not have to be this way.  The genre has an incredible opportunity to push the creative envelope by being afforded the chance to push our imaginations to experience things that we may not want to think about. To push us and challenge our comfort zones.\n\n‘It’ comes from a great horror pedigree, based of a miniseries written by Stephen King.  The 1990 story I think did a pretty good job of pushing comfort zones, as well as having some pretty great disturbing scenes without relying on jump scares to make you uneasy.  Plus it birthed the classic clown as a supremely scary thing, using subtle imagery and lighting.  In this remake, Pennywise is every bit as horrifying and even feels like a more realised villain thanks to Bill Skarsgard and some exceptional camera and lighting work.  The story is also just as solid as the first, but contains some excellent child acting and a very compelling narrative of contemporary friendship.\n\n![Pennywise smile](http://horrorbuzz.com/wp-content/uploads/2017/09/IT1.jpg)The general story of the movie without any spoilers is pretty simple: There is a town, and for some reason there is this fucking clown that eats kids.  Great premise, full of room for allegory and good juxtaposition of teleology.  *Clowns are supposed to make you feel better, not eat your offspring*.  So now that that’s out of the way, let's talk about this clown.  This clown is extremely unsettling and eerie.  Bill Skarsgard does a great job of nailing the mannerisms of a clown while obviously having an appetite for pre pubescent humans.  The way his eyes glow, the way he drools when around the kids, it’s all got a great attention to detail that immerses you in this ridiculous and terrifying reality.\n\nSomething that I really appreciated, which I’m not sure was in the original miniseries, was that we see Pennywise’s ability to change shape into some surreal and horrifying things.  His arms change into huge macabre looking claws that are agile and deadly, he takes the forms of terrors that the kids project, lending this sense of mystery and terror not knowing exactly what he is or what he is capable of.  His default form of a butt ass looking clown gives this presence of a silly albeit eerie thing that’s true purpose is supremely obfuscated since it clearly has a goal.  Toying with these kids is a priority and he does so in pretty terrifying and creative ways which I appreciated.\n\n![It children underground](https://pixel.nymag.com/imgs/daily/vulture/2017/09/06/06-it.w710.h473.jpg)**These poor kids**.   While they are pretty unlucky in terms of circumstance they are very good actors.  I felt like these kids were great friends and they behaved as legitimate friends do. They busted each others balls, made quips about their moms, and exhibited that give and take that like real relationship has.  Which was something the original nailed, and I am really glad that this remake made this a priority as well.  Each character felt like they had real personality that carried through the whole movie.  The jokes they make are legitimately funny, their conversations, their body language, their facial expressions. All very engrossing and most of all fun to watch.\n\n![kids outside well house](https://www.comicbookmovie.com/images/articles/banners/153918.jpg)\n\nThere were some interesting subtextual elements that I think are worth discussing as well that gives this movie some added thought fodder.  The main one was how cold and unsympathetic all the adult characters behaved throughout the film.  They were downright unlikable in every instance.  Either they acted angry and/or frustrated with the children or where cold and judgmental.  All acts of catharsis and importance seemed to be enacted by one of the children or another child actor.  FLoating was also a big theme, I won’t get into too much detail to avoid spoilers but the floating balloons, the floating kids in the well, which we may see play out a little more in the sequels.\n\n**Would I recommend It?** Totally.  All of it’s parts were quite fun and even though I’m not big horror fan, this movie has a lot of things going for it. The narrative, acting, and thrilling horror moments all play out quite well and I think should be experienced by any consumer of film."
        }
      ]
    },
    {
      "movieId": 6,
      "submissions": [
        {
          "title": "Megan Reviews Mother!",
          "author": "Megan",
          "markdown": "As long as I can remember, a recurring nightmare has haunted me. Every few months I’d find myself stuck in a horrific situation, a seeming hell with no escape. The situation itself varies- running into an alley while being chased by men, held hostage in a tortuous prison, being stranded on an island or deep in the woods. While each dream begins differently, they always end on the same chilling note. I try with all my might to scream for help, but my voice makes no sound. No matter how hard I try, my screams are silent.\n\nI have never seen another film which so accurately captures this feeling. Throughout the movie, I empathized deeply the main character, Jennifer Lawrence’s Mother. I could feel the fear and frustration strangling her. I found myself wanting to scream at the movie screen while she battled increasingly absurd and infuriating tribulations. The fact alone that mother! could pinpoint this experience made it a worthwhile watch.\n\n![passionate embrace](http://cinemavine.com/wp-content/uploads/2017/07/mother-movie-trailer-aronofksy-4.png)The plot centers around Mother and her relationship with Him (Javier Bardem). Him is in the midst of a long bout of writer’s block. When a Man shows up at the door, Him ends up inviting him to stay in their house without consulting Mother first. Man’s wife, Woman soon joins, and Him continues his welcoming parade to the dismay of Mother. Tensions continue to raise when Man and Woman turn out to be less than ideal houseguests. They end up breaking Him’s most valuable possession- a precious stone. The plot snowballs into an absurd sequence of events. While far-fetched, the incredible acting blurs their plausibility. The guests’ sons show up and start a fight that ends with a death. The next day Mother shares with Him that she is pregnant. His joy melts his writer’s block, and he finishes his greatest work. Instantly super fans show at the house by the thousands, trying to catch a glimpse of the Poet.\n\nFrom this point forward, the religious parallels in the film are both abundant and disturbingly familiar. Well at least, familiar to me. Having been raised in a fundamentalist Christian church, I am well-versed in the the Bible’s account of Jesus. From the idolization of a seemingly philosophic leader, to the offering of a Son, to the sick cannibalistic ceremony that followed (*cough* Communion *cough*), the film was wrought with religious references.![jennifer screaming](http://digitalspyuk.cdnds.net/17/32/480x270/gallery-1502177969-giphy-82.gif)\n\nMany have written their own interpretations of this allegory. I might as well take my own stab at it, although the author’s intent is likely somewhere in the middle of all these theories.\n\nI think the story serves to warn the audience of the implications of blindly popularizing a leader. Arguably, it does so by breaking down the steps that cultivate a religious figure. It uses hyperbolic examples from the Bible as a history lesson. It says, “Audience, you know how a few people started following Jesus around, and then more and more joined and suddenly rumors flew that he could perform miracles? And everybody lost their shit trying to get to him? Remember how his death led to his reverence that continues 2000 years later (even though, ya know, no one these days has ever spoken to the guy)? Oh yeah, and remember how his followers now believe they can eat his body and blood for atonement? You know what that leads to, audience? Do you?\n\nIt leads to millions of people with a one track mind. Gargantuan communities filled with people willing to suspend their own critical thinking skills, judgment, and reasoning in exchange for a life on auto-pilot.”\n\nThe film showcases this phenomena with the uncontrollable mob. Their eagerness to get to the Poet trumps any moral responsibility they feel for the people or environment around them. And why do they adore him anyway? Why would they risk sacrificing their sanity? Because he provided them with some type of comfort or consolation that filled the “insert meaning here” gap in their lives. Though they knew nothing about Him, they put his words on a pedestal, and the fame and adoration went to his head.\n\n![angry javier](http://www.indiewire.com/wp-content/uploads/2017/08/screen-shot-2017-08-01-at-11-43-10-am.png?w=780)This type of blind belief is dangerous. When people are born into or adopt belief systems that give them a script on how to live, it often costs them their autonomy. It is easier to be given a set of rules to live by than to actually think critically and develop your own values. There are millions of people who would rather apply one rule to a multitude of circumstances than to carefully examine each problem and make an informed decision about it. Though the film doesn’t establish a set of rules, it does display the “mob mentality” that results from a lack of independent thinking. When one person eats the baby, they all want to eat the baby.\n\nDoesn’t blind belief sound great already? Not only can submission to religion ease your mental load, it can strip you of any responsibility to your environment or the global community, too. What an exciting offer! In the film, the mob trashes the entire house, disregarding any respect or consideration for others. Often times religious groups are so inwardly focused that they isolate themselves from the rest of the world. I grew up in a church that cared very little about the “unbelievers” and taught that telling them how sinful they are is how to show them love.\n\nIs this allegory only limited to religion? I would argue not. How did we end up a reality TV star as a president, after all? Countless voters heard a vague but promising message and followed right along. Electing the guy who sounds good, but has questionable character and morals, relieves any personal responsibility to actually educate yourself on the issues as well as your encourages your isolation and biases against the rest of society. I can only hope the real-life consequences aren't as tragic.\n\nI am Mother. In this allegory, I am the one looking out at the tragedy that is my family, my former friends, my church. My heart is broken when I see the harm they are causing. I try to reason with them. I beg them to listen. I watch them destroying themselves, destroying me, and destroying the environment. I feel so filled with frustration I could scream.\n\n**But will anyone hear me?**"
        },
        {
          "title": "Mother! A Deep Well of Allegorical, Surrealist Horror Visualizations",
          "author": "e-vaughn",
          "markdown": "## A Polarizing Beast\n\nI been rattling off all kinds of thoughts ‘bout various flicks lately. There’s a lot of good cinema gracing us in 2017, and it’s exciting to spend energy processing why we like the shit we like. Err’body owes it to themselves to mindfully reflect on the what makes them “ooh” and what makes them “ewww”, or even what fails to make them so much as “mehh”.\n\nRecently I wrote about the value of uniqueness and how a single scene in a flick can make it one worth recommending (Dunkirk review). Mother! is the type of film that is unique and experiential enough that it’s easy to recommend to basically any mature viewer just for the sake of having them experience it, process it, and try to piece together what the fuck it’s about.\n\nIt’s polarizing in the sense that many will find it artistic, harrowing, and beautiful… while others will recoil from it in disgust, find its symbolism in place of plotting to be pretentious, and find it frustrating. I believe that this film is an experience that sort of has to be sat through and analyzed from one’s own point of view. In that advocacy comes an appraisal of this film’s existence.\n\n## Darren Aronofksy’s Mystique\n\nThis movie is the brain child of Darren Aronofsky. If you like thought-provoking and relentelessly disturbing cinema, he’s your man. He made Requiem for a Dream. Have you seen that shit? That might be one of cinema’s biggest gut-punches ever. He made the Wrestler, which was grounded and morose. He made Black Swan which explored the sacrificial drives of artists. And now he’s made Mother!, an intimate religious/environmentalist allegory that, like his other films, packs quite a punch.\n\n![cracked JLaw](https://i.ytimg.com/vi/0T0EaIMamIQ/maxresdefault.jpg)Others have touted that this is Aronofsky’s most disturbing movie, but I won’t uphold that belief. It’s way less potent than Requiem for a Dream due to its whimsical surrealism.\n\nIf you don’t care much about spoilers and want the movie explained to you, here’s a fun little synopsis and breakdown. I sincerely recommend you watch the movie first and experience it yourself, though.\n\n## Craftsmenship and Horror Techniques\n\nSo this movie establishes its cinematic fervor pretty much immediately. The movie is intimate. The camera is glued closely to our mother protagonist, Jennifer Lawrence for what feels like 70% of screentime. It’s about her journey and HER reactions. It’s her world, and we’re her audience, and she’s our vessel.\n\nThe movie uses extreme close ups on her face often. Like, I mean, all the time. Every reaction is almost always her reaction. Every point of emotional expression is viewed through her eyes. Any time a character appears on screen and reacts, it’s like we’re only seeing it through her eyes. It’s actually really intimate and beautifully crafted. The cinematography and lighting and setting are all so well crafted, as we journey through time and this house that represents a variety of things.\n\n![split actors faces](https://images.moviepilot.com/image/upload/c_fill,h_470,q_auto:good,w_620/mvdhgflwqdn8owqc4tk6.jpg)This movie is surrealist. It’s going to bob and weave a bit and it’s going to feel untethered sometimes, yet things end up making sense when you start gathering your jigsaw pieces and assembling shit.\n\nThe sound design is great, and something I noticed pretty much immediately. It was, again, intimate and crisp and noticeable. Voices came loud up front and the house creaked and breathed with a life of its own.\n\nJLaw’s acting was, as per usual, pretty solid. She felt like another character in this (and didn’t feel like Jlaw) due to her demureness and meekness. Her expressions start out so hindered until they built to boiling points throughout the story, and especially during the climax. Her pain is easy to empathize with.\n\nThe movie achieves a feeling of claustrophobia and helplessness. It’s actively frustrating. There are times I was gritting my teeth in annoyance. The side characters are so well presented in their absolute dickishness that I kind of forgot good people existed while watching this movie.\n\nFrom a Horror standpoint, this movie doesn’t rely on jump scares. For the most part, it seeps in its images enough to get you to feel jilted and on-edge due to the grime on-screen – not due to the anxiety of a startling moment.\n\n## Scene after Scene after Scene\n\nI don’t think this movie is very fun. It’s not really meant to be fun. It does however, have scene after scene and performance after performance that gets under your skin. Whether it’s the blatant misogyny,![mother house](https://media1.popsugar-assets.com/files/thumbor/NJiZB_b10h281XzCmC55C5HAjtY/fit-in/2048xorig/filters:format_auto-!!-:strip_icc-!!-/2017/09/13/812/n/1922283/tmp_Y1XXtj_80a53f477952456f_House.jpg) the disregarding of personal space, respect, or humanity, the juxtaposition of religious indoctrination against self-righteousness, or the motherfucking destruction of beautiful COUNTERTOPS! Fuck. That scene pissed me off so much. Those fucking assholes. It’s rare that side characters can fill me with such disdain but fuck, there were so many that got me borderline livid. And the countertops. My GOD. How could they do that?!\n\nThere are more scenes that feel like sandpaper against your eyes than not. And then the 3rd half of the movie kicks itself into overdrive and you just have to buckle up.\n\n**TL;DR**\n\nWalk into this movie knowing it’s a trip. Walk into it with your expectations cut. Walk into it expecting to think and have to derive your own conclusions. The movie has so many off-the-wall moments and characters and scenes that get your gears grinding. It’s a worthwhile journey if you don’t mind a little abrasion when peeping flicks in the cinema.\n\n**Recommendations**\n\n**Recommended for fans of this genre:** Yes. For fans of thought-provoking cinema, or horror for the style, or metaphors, or just batshit insane visualization. Peep this.\n\n**Recommended for non-fans of this genre:** Yes. I recommend this flick to non-fans of Horror as long they don’t mind a bit of mental gymnastics to understand what’s happening on-screen. Also, just gotta consent to being disturbed a bit and you’re good to go. It’s interesting enough of a flick that you should peep it and see how it makes you feel. Contrersial films can be great. Polarizing ones can be the most thought-prokoking. And you get to spend time wondering why you hated it so much, or why you loved it so much.\n\n**Semi-arbitrary score out of 10:** 8.5/10"
        },
        {
          "title": "A Crescendo of Craziness",
          "author": "Jacob",
          "markdown": "*Boy oh boy what a crazy flick.*  I was expecting something wild when I walked into this movie, and I was not disappointed in the slightest.  When I first saw the previews for this film it seemed like your average ‘white girl in a house that is haunted‘ sort of affair, and my interest was not peaked at all.\n\n### *spoiler: this is not about a girl in a haunted house.*\n\n Then I learned that this film was directed by Darren Aronofsky, the same man that directed 2010’s Black Swan and 2000’s Requiem for a Dream.  After which I became quite curious and kept my eye on it as the promotional material for the film was released.  Now the Movie is released and I can say that the movie is quite **messed up** in the best way possible.\n\nFrom the beginning of the film, things are very ominous yet tranquil.  The audience becomes introduced to the House and Jennifer Lawrence’s character which have a special relationship to one another.  Things seem quite idyllic as the setting is set, and we are introduced to Jennifer’s husband Javier Bardem, what’s not to love?![michelle and jennifer getting into it](https://media.giphy.com/media/121GkWUHtEpPi/giphy.gif)  But very quickly things start to unravel.  Jennifer and Javier’s paradise is thrown a curve when some strangers show up and we begin to see the true nature of this arrangement.\n\nWe come to realize that these stranger’s aren’t just simple strangers but the **harbingers for a cycle that ties these characters together**, from the house to it’s creators and its inhabitants.  All of which is expertly shown, not told.  One thing that Mother! did a great job of was crafting a narrative that is always moving.  Even though there is not a ton of dialogue, there is so much going on all the time that has major consequences for the main characters.  The reactions and body language of the characters tell the story quite well and even though there is a ton of allegory and surreal moments the plot feels relatively straightforward and motivations seemed pretty clear.\n\n*Honestly there were a lot of WTF moments* when things seemed to be going in a direction that I could not foresee, but by the end things fit together pretty well and were rather Cathartic.  There was only one scene that I think could be described as fairly disturbing and it is quickly followed up with swift effective retribution by the main characters involved.\n\n![jennifer as mother](https://images-na.ssl-images-amazon.com/images/M/MV5BMzc5ODExODE0MV5BMl5BanBnXkFtZTgwNDkzNDUxMzI@._V1_SY1000_CR0,0,674,1000_AL_.jpg)What I appreciated the most from this movie was that it is very hard to describe what actually happened in this movie.  Of course there were characters, and they did things, but that’s not really the point of a movie like Mother!  Mother! is about ideas and the human condition, what it means to create and feel inspiration.  This movie did a great job of piecing together this patchwork of ideas and allegories in a pretty surreal manner that made me as an audience member kind of feel lost in it's both beautiful and grotesque presentation.  By the end I was no longer thinking of the characters as people experiencing the events unfolding in front of me, but as symbols on a sprawling tapestry.\n\nEven though this movie feels whimsical and allegorical when it comes to specific narrative plot points,  it never feels lost.  I was glued to my seat in awe as this crazy mystery of this house and these people swirls around the screen.  Every character represents something important to the story and every action is answered justly.\n\n I could talk about my interpretations of what the characters represent and what discussion this movie is trying to ignite but I think there is so much to talk about that it will have to wait for a different time and setting.  I’m so glad that movies like Mother! exist and I’m glad there are people like Darren Aronofsky that are trying to do something so intentional with their stories and expression.  Mother! is certainly not for everyone but it is a very unique and special film and one of my favorites this year by far."
        }
      ]
    },
    {
      "movieId": 7,
      "submissions": [
        {
          "title": "A Rare Flick That Makes Me Question What I Even Liked About the First One…",
          "author": "e-vaughn",
          "markdown": "## Intro Franchising and Praise for Kingsmen 1:\n\nIt’s rare that movies strike me as poor enough for me to actually recommend against seeing them. A small theme in my recent reviews is that a movie can contain even just *one* scene that makes it worthwhile for me. Just one…\n\nI don’t know if Kingsmen 2 had any such scene. That feels a lil wild to write considering that I recall seriously enjoying Kingsmen 1\n\nIt’s been over a year since I seen Kingsmen 1, but that movie had some serious badassery on screen. It was silly, almost satirical in its tone. This made it lighthearted and an interesting blend of comedy + action. Origin stories are often easier to nail than sequels, but Kingsmen 1 was *fun*. Fun to watch. Fun to see actors like Sam Jackson acting quirky and silly. [Fun to watch some of my favorite hobbies presented on-screen (like, this short snippet displays more character prowess from Eggsy in K1 then 90% of K2)](https://www.youtube.com/watch?v=onHfVUCKNGc).\n\n[And let’s never forget one of the most amazing and balls-to-the-wall brutal action scenes in the Church.](https://youtu.be/25683IE5v9g) There’s a fuck-ton of analysis to be done on this church scene ALONE, and it honestly stands as one of the better brawling action scenes I’ve ever seen in any action movie. The centralized chaos, the rhythmic and moving bodies, the complexity of choreography combined with the dynamic cinemagraphy that frames the action in a way that embraces the chaos yet demonstrates clarity… and the shock value. The music. The tension leading up to the violence. The amount of depravity and seeing our character completely unhinged.\n\nAs far as action movies go, it’s THAT fucking good. It might just be an action-cinema masterpiece\n\nKingsmen 2…. Has almost NONE of that dope shit in it.\n\nAs the sequel’s trailer played over and over before my eyes before the various movies I plopped my ass into theaters to watch, I found my already tempered excitement waning even more. [Something about the way the missile burrows a hole into the ground to rub-out the HQ rubs me the wrong way….](https://youtu.be/4PggfbzJcvA?t=29)\n\n## K2’s Characters Feel Different, K2’s Plot Drags:\n\nOk, so the movie basically reveals that Colin Firth is coming back in the very first trailer. I’m not too irked by this as far as trailer spoilers go, but while I remember enjoying most characters from the original, they are either killed off immediately in the sequel or dramatically change in terms of their personalities. Firth’s prior depiction and badassery from K1 is gone completely out the window and replaced by a amnesic meekness that just don’t fly. Egsy is still relatively charming, at points, but there are some off-kilter goofy character moments on display throughout.\n\nThe film squanders Channing Tatum, and introduces a variety of Statesmen that are apparently instantly trustable. This movie isn’t meant to be a bulletproof in its plotting, but man the pace and disregard for consistent realism is weak. We live in a sci-fi world with ridiculous gadgetry, but the encryption of the entire Kingsmen database is broken by a cyber-prosthetic in seconds?It’s hard to say what happened. The worst character depiction in the first movie was maybe Sam Jackson’s overly silly, lispy performance. And yet it worked. It was clearly silly and embraced the “hehe, look how much he’s like Bond villans” satirism. Yet Jackson has the swagger to pull off a blood-phobic super villain, and he shined in his role.\n\nKingsmen 2 has a villain that fell flat. Julianne Moore is a wonderful actress, but damn if her bubble-gum delivery throughout K2 didn’t continually miss the mark. Predictable in her sadism yet nonsensical in her actual motivations, she bordered on annoying. I mean, are we really going to see her methodically set up a meat grinder scene just to demonstrate her “villainy”? Not only was that scene tasteless in its content, it was wimpy in its shock-value, and made no sense in the character motivations. Why the fuck would anyone even want to join the Golden Circle? The entire antagonist circle feels so flimsy, it borders on half-assed.\n\nWe have 2 random dudes, 15 random guards, a Kingsmen reject and his festival-focused girlfriend… and handful of robo-cronies as the main circle. Then we have a grating performance by Sir Elton John, which I found neither charming nor humerous, despite liking Elton as a homie.\n\nAll in all, the characters I loved in K1 are replaced by impersonators. The largest grievance may have been Firth’s flip-flopping characterization. The fun of over-the-top agents in action falls apart when their badassery is completely neutered by weak plotting…  and even new characters like Whiskey end up betraying out hearts. I found myself not really rooting for any of them, and wondering if they were actually wonderful in the first movie as I had recalled.\n\n## Action and Violence:\n\nThe first movie had some unflinching violence in the vein of Mathew Vaughn’s other movies like Kick-Ass. That shit was incredible. Seeing people diced up, double-tapped in the dome, and fought using a variety of sci-fi gadgets was like watching a stylistic and slightly sociopathic Bond movie.\n\nApart from the very first car chase scene in K2… the action was weak. There wasn’t a single shocking moment or worthwhile fight scene after the introduction. I honestly found myself bored. Was it the editing? Was it the uninteresting characters? Was it the seemingly unfocused “kitchen sink” approach they had to action? “Oh, let’s bring in an electrified whip! We’ll kill one person with it. Then we’ll bring in headshots that don’t kill people! OH, and how about robot dogs? And a robot barber?”\n\nThese things can be cool when applied in the right way, or if applied with the right amount of force and tact. Instead, we have characters throwing away their lives while singing songs, when they simply could have taken off their shoes.\n\nEven a rehash of the iconic bar-scene from K1 of “Manners maketh man” is brought back here… but it’s limp due to a forced catalyst for the whole thing, and the fact it demonstrates one of our characters “falls from grace”.\n\n## Rethinking Shit:\n\nI don’t usually get salty about a movie or fail to find value in a movie, but it feels like every single “mediocre” component of K2 is better expressed through K1 and other action rompers. I am struggling to imagine what about this movie is recommendable to my homies. I have no doubt some will be able to forgive the movie’s shortcomings and even enjoy it. But more me, all components failed to essentially hit the mark\n\nI’mma have to go watch Kingsmen 1 again to see if it might change my view of K2, or if, shittily, K2 may have changed my view of K1.\n\n**RECOMMENDATIONS**\n\n**Recommended for fans of this genre?** No. Nah. Pass. There’s better action and better satire in most other action flicks. There’s better dialogue and more enjoyable characters. Fuck, just watch Kingsmen 1.\n\n**Recommended for non-fans of this genre?** No. Not for comedy, action, or critical thinkers. Maybe… just maybe, and this is a HUGE maybe…. But fans of Elton John might like it? I don’t know. He’s not exactly a knock-out in this.\n\n**Semi-arbitrary Score: 4.5/10**"
        }
      ]
    },
    {
      "movieId": 8,
      "submissions": [
        {
          "title": "Pulpy Sci-Fi Noir that Breathes Life in Every Frame",
          "author": "e-vaughn",
          "markdown": "## Blade Runner’s Cyberpunky Impact\n\nRidley Scott’s 1982 Cult Hit Blade Runner is often credited with a great many introductions. It’s often described as the first mainstream cyberpunk aesthetic put to film. The countless films and media it has influenced on its stylistic grit and fashion alone are many discussions in and of themselves. While earlier short stories have touched upon the disparaging slums of the future and painted them as technological outcasts, none imparted a unified vision quite like Blade Runner.\n\n![Ryan Gosling wife ad](https://cdn.vox-cdn.com/uploads/chorus_asset/file/9376591/blade3.jpg)I love hard Sci-Fi, thought provoking films, and I cherish tension and tone. When I watched Blade Runner years back, I recall not enjoying it, much like the early critics and audiences that were exposed to the film in theaters in the early 80s. it wasn’t until much later that it received its Cult Status and respect. I haven’t gone back to explore the movie since feeling disappointed by it many moons back, but I was quite excited about Blade Runner 2049. Not only was it obvious that Gosling, Ford, and Vileenveie were a powerhouse team, but each and every trailer was art in motion.\n\n## A Sci-Fi Fever Dream\n\n15 minutes into the movie, I was already in awe. Blade Runner 2049 is, upon first impressions from this Sci-Fi lover, a masterpiece. Straight up, I couldn’t get over the craftsmenship of the film and the attention to detail in every single scene. The movie is RICH.\n\n![vivid color office](https://s3.drafthouse.com/images/made/blade_runner_2049_5_758_426_81_s_c1.jpg)Running at nearly 3 hours long, there wasn’t a single time that it dragged for me. Not a single feeling of slow pace among the lengthy and prolonged scenes that built on tone and world more than plot advancement. There are abundant scenes that exist purely to craft the world, immerse you in a neon-caked LA cityscape, douse you with ambient and overpowering music, and make you *feel*.\n\nThe film flows from plot development and following a detective lead, noir style, to building a romantic connection between Gosling and his consumer-bought AI girlfriend. As the plot progresses and the lead builds, the next scene adds to the lushness of the world. In a world of so much stimulation, it’s unclear who is human, and what it even means to be human.\n\nI found myself never really sure of the motivations behind each character, whether they were synthetic, self-aware, or the rules they played by. Each scene dropped more hints, more clues, and more strands to follow as to how the world worked. Beyond the already-complex main plot, there were enough side-stories to fill a miniseries that I would gladly watch. And gladly discuss at length.\n\nI love science fiction. I believe that movies have the ability to inspire their audience to achieve greater things and build a world that they may want to see. When it’s a dark sci-fi flick like Blade Runner, it doesn’t even much matter to me that it sours most displays of technological progress with sorrow and pain. Whether it’s a probable human pain or a synthetized and designed pain, the catharsis exists for us and it really should make us question.\n\nThe morality of the film is so grayscale that I would be hardpressed to make any claims about who is a villain and who is a hero. Leto’s character commands each moment on-screen and purposefully disturbs with his violent nonchalance… but his achievements fall under the umbrella of beneficence. There is enough interesting shit on screen and in-world in this film that it can provide hours of discussion for those that have a desire to carry on with heavy mental lifting.\n\nAnd that’s not even the main plot alone, which requires actual focus and attention to parse. Even in the end… our 4 person viewing party talked for over an hour throwing out clues and hints and moments that stood out as evidence to some bewildering theory we thought the movie was casting upon us.This is definitely a movie one should watch twice. And I would very much love to.\n\n## The Frames Themselves\n\nThis movie is pure eye-candy. If you haven’t peeped the [cyberpunk aesthetic](https://www.reddit.com/r/cyberpunk) before, and the concept of a grimy, striving future appeals to you, you might find this movie to be art in motion. It’s gorgeous in every scene. The shots of hovercars cruising through the city coast you through a woozy simulation of actual flight.![ryan harrison combat](https://bloximages.newyork1.vip.townnews.com/omaha.com/content/tncms/assets/v3/editorial/f/75/f75bfafa-a02c-5237-8cf5-9168f1eaf48f/59d6ecd4b9001.image.jpg) The combat scenes and action feels weighty, brutal, and rude in their disregard for humanity. Whose life has any meaning in this savage world? The replicants are portrayed as relatably human and bizarre, weird, and robotic. Human yet not ever quite human. With this portrayl comes a beauty in the acting. The pain on display. And the movie makes us wallow in it. In every death (and my god, some of these deaths are insanely visceral…. One of the most tense climaxes I’ve ever seen is on display here). In every gutwrenching realization or recognition of mistake, or foolishness that our characters reveal to themselves, there feels like a nuance and contemplation on display that these actors masterfully depict.\n\nPerhaps it’s because of the artistic merit, the tone, the lushness of the world, or the acting itself, but I found myself so much more sentimental of plot development than I do in most movies. The plot isn’t a doomsday scenario, or immediately threatening to this world, but it maintains a sense of weight. And it constantly builds on its sci-fi world by layering scene after scene of thought provoking content.\n\n![clone room](https://cdn.vox-cdn.com/uploads/chorus_asset/file/9376599/blade2.png)I’ve long held the opinion that sci-fi has the ability to create intrigue merely through images and world building. Just seeing future tech or a snippet of how society works gets my gears turning and trying to piece together the way this world works. This director’s slower pace in his films tends to lend itself the best to sci-fi and movies with lush world. To movies where the environment is a character itself. Where moments in Villeneuve’s Sicario tense but slow, Blade Runner’s genre crafted much more value in each slow moment. Even his latest effort, Arrival, while sci-fi, isn’t world-building or propelling the lore of the world in most scenes that the aliens aren’t on screen or being analyzed. Blade Runner, however, is generating detail every single second it’s depicting the world because it is so far into the future and so lush ins depictions of the world.\n\nThis is the exact reason that while others have claimed this movie felt slow, I found it constantly gripping. Not only is it atmospheric throughout, it’s showing characters or environments that are always interesting to analyze. I had similar experiences while watching Westworld.\n\n##  What Makes a Masterpiece?\n\nWhat a lofty question, right? How can one determine quality in a primarily subjective medium? More ways than one… that’s for sure. I look back on this film and ask myself “What could it have done better?” I don’t feel that adding gratuitous nudity, gore, or different dialogue would have aided the core of the film. It stands to reason that there isn’t anything this film needed to amplify the feelings and emotions it already evoked, then maybe it’s approaching perfection? Could it have been shorter? Not for me. Could it have had more plot development? Better acting? More of the “good stuff” that I’ve already called out? I mean, sure, I guess so. But I didn’t find myself yearning for those things, because it so effectively satiated me with its runtime and visual display.\n\n![Jared Leto lookin crazy](https://i0.wp.com/media2.slashfilm.com/slashfilm/wp/wp-content/images/Blade-Runner-2049-trailer-breakdown-6-700x293.jpg)I do believe that it’s hard to identify a masterpiece from a single viewing. I don’t even know if calling something so lofty serves it much more than simply explaining what makes it great. But you know what? This movie was so exceptional and hit so smoothly on so many cylinders that I think it is damn near perfect for what it was trying to be. So well realized in its own goals that it feels damn near flawless.\n\nAnd now we’re left with a discourse, and continued discussion of the movie. A discussion that blossoms the values of the film even more. We’re left with a desire to share in this experience. A lingering desire to let this film inspire other filmmakers or inspire the general public to contemplate, appreciate, and THINK. I’m happy leaving that here.\n\n## [TL;DR]\n\nIn the face of almost unobtainable expectations due to Blade Runner 2049 being a sequel to a beloved cult classic, it manages to succeed in being a better movie than Blade Runner in almost every way. It’s well-acted, it’s visually stunning, it’s tense and atmospheric, it’s thought-provoking, it’s intense, and has plenty of scenes in a film I’ve never seen. It makes me wonder and dream. It’s a joy to experience. For anyone that has the energy to engage and analyze, ponder and try to piece together this sci-fi film noir, I implore you peep this movie.\n\n**RECOMMENDATIONS**\n\n**Recommended for fans of this genre?** Absolutely. Any fan of sci-fi, dramas, thrillers, mysteries, noir, excellent film-making, or thought-provoking spectacle… you should see this movie. If you’ve got the attention and focus to process nearly 3 hours of complex science fiction, love discussing cinema, or want to be moved, fucking peep this jam.\n\n**Recommended for non-fans of this genre?** No. I don’t believe that every exceptional film is recommendable to everyone. Some individuals merely don’t have the attention to sit through slower scenes that run up to nearly 3 hours. Some aren’t going to enjoy the mental gymnastics required to understand the plot. Some won’t find the aesthetics or the eardrum smashing music to add to the experience. Some folks want every single movie to be a casual affair. One they can watch to veg-out. This isn’t that movie. I almost think it would be disrespectful to watch this movie with a half-asleep candor. As such this feels like an exquisite film that simply isn’t for all movie audiences…. And that’s totally ok.\n\n## Semi-arbitrary Score: 9.5/10"
        },
        {
          "title": "The Perfect Sequel to a Cult Classic",
          "author": "Jacob",
          "markdown": "There were so many opportunities that Director Denis Villeneuve had to cash in on the not super popular but very well respected Blade Runner of 1982.  *But he didn’t, and I so respect him for it.*  This new Blade Runner is very much its own thing, channeling the same things that made the first Blade Runner so great but adding new contemporary ideas that make for an engrossing, exciting, and thought provoking experience.  While it is quite a long journey with many lengthy mood setting shots, it succeeds in building a brutal yet cohesive sci-fi world, that will leave you with many questions about the future and humanity.\n\n![action gosling](https://i.kinja-img.com/gawker-media/image/upload/s--PqN-CkTw--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/vyrnkanrhbpcbdveomz6.jpg)For the average movie goer, this film has parts that are sure to confuse.  The plot is dense, as the story is a continuation of the original, which presented a lot of opportunities for reflection and built a narrative around some philosophically ambiguous material.  What makes us human? What about human life is intrinsically valuable?  Questions that in my opinion do not have answers that the majority of people can agree upon… *but boy oh boy does almost everyone, from dogmatists to logicians, have something to say about it.*  At least if you give them the opportunity.\n\nThis brings us to the general plot of the movie which is overall very approachable.  In the future there are synthetic individuals, and they were once made illegal but are not any more.  Blade Runners are the people within law enforcement that are sent out to kill these synthetics and in this particular story we follow Agent K, a young Blade Runner played by Ryan Gosling.  K is sent to uncover the secrets of a potentially remarkable synthetic and bring them to justice.  A simple plot that quickly spirals out of control as the mysteries of synthetic existence and the connections to the previous movie reveal themselves.\n\nThere are some great twists and poignant moments that are really well scripted, and make for a story that really keeps the audience invested, even to the point where I legitimately wanted to know more about the world I was witnessing.  **Like How the fuck synthetic life works?** And why do these synthetics do what humanity wants? Or do they actually not? And who controls what in this crazy brutal sci-fi world of 2049.\n\nAll of these questions felt so appropriate, not misplaced due to sloppy writing or world building.  Questions that produce intrigue not confusion. It’s as though you as the audience member have been *gifted* a chance to witness this fantasy reality and be privy to it’s secrets.  Secrets that are potentially game changing in the world of synthetic creatures and thus to the future that is portrayed.\n\n![syberpunk girl](https://i.pinimg.com/736x/9c/46/05/9c46051551f2fadbb50f1e2ff7bac6a8--cyberpunk-art-cyber-punk.jpg)An impressive feature that this movie bears is an extremely cohesive storyline when put into context of the original film, yet not a storyline that requires prior knowledge of the events leading up to 2049.  If you have seen the original Blade Runner you will feel very comfortable with the Cinematography and the Soundtrack. The producers were able to score the masterful Roger Deacons (who was the Director of Photography for the Original film) as well as Hans Zimmer and Benjamin Wallfisch to compose the music. Hans Zimmer who of course cannot keep his dick out of contemporary sci-fi action films while never ceasing to bring an incredible atmosphere, tension and emotional resonance with his music.  Alongside him is Benjamin Wallfisch who seems to be composing almost every musical score for the movies in this blog.\n\nThe result is an incredibly colorful and vivid portrayal of a sci-fi future, that creates a remarkable cyberpunk aesthetic while building on the themes and emotions of the original film.  The frames showcase the setting in an extremely unique way, making the characters seem miniscule in a world being utilized in the most efficient way possible, an engineered machine.  Buildings, structures, monuments, and even refuse are massive while juxtaposed to the pygmy living spaces and transports that carry people.\n\nCombined with a brooding and enveloping soundscape that follows the characters and hangs in the air to give this future an uncomfortable feeling, the cinematics and overall presentation of this story is really really masterful.![cypberpunk skyline](https://i.pinimg.com/originals/8b/4a/f2/8b4af2070c8debe29341531c391b90fc.jpg)  As the audience looks down on the world while they are transported from monolithic structure to overcrowded or cramped living space, we get the feeling that existence has progressed on a remarkable yet not too farfetched path.  To say the least the visuals and sound did a great job of telling a story as much as the actors and script writers themselves.\n\nTheses strengths really carry the movie as a whole and make up for the fact that while the story was never boring and did drive my interest, it was pretty run of the mill as far as general plot and story arch.  This is not to say I felt disappointed by the story, but there was definitely room for innovation.  The original made such an impact by of telling a story that was not only thought provoking but super creative for its time. This sequel was a clear continuation of those concepts without too much innovation, instead it brought a more masterful execution.\n\nThis was super close to being a true masterpiece. It had all the potential, all the right people and was executed almost perfectly.  Comparing this to my favorite sci-fi movie of the past year, Arrival (also directed by Villeneuve), it has so much more moving visual and aesthetic moments, as well as pure brutal sci-fi concepts.  But the story in Arrival was so layered and rich, and even *Blade Runner Uno* stood up a little better in the story department.  Despite that, this movie was amazing and I think every sci-fi fan should see this and internalize its major successes while pondering the immense amount of great plot points it left untouched.\n\n"
        },
        {
          "title": "Megan Reviews Blade Runner",
          "author": "Megan",
          "markdown": "When I walked into the theater to see Blade Runner 2049, I was going in blind. Well, at least with heavily foggy vision. I have never seen the original Blade Runner, but my friend gave me a quick (somewhat muddled) plot summary on the car ride over. Regardless of my lack of background knowledge, the film proved engaging, snaking my attention from the first scene forward.\n\n![joi & car in hover car](https://video-images.vice.com/articles/59dbdba25634f13025a8545c/lede/1507581453530-Screen-Shot-2017-10-09-at-43720-PM.png?crop=1xw:0.8559027777777778xh;center,center&resize=1050:*)The plot follows Agent K, a human-like manufactured replicant, on his quest to track down rogue replicants of prior generations. After the discovery of a pregnant replicant skeleton, K sets out to find the human/replicant offspring. If found, the child would be the first of its kind and proof that human/replicant reproduction is possible. Once word of the potential child reaches the Wallace Corporation, the creator of the replicant species, a deadly race ensues. While K seeks to rescue the offspring and discover its origins, Wallace sets out to eliminate the threat such a child could bring to his company.\n\nThe twists and turns unraveling throughout the film gripped my attention. I couldn't help but pitch my theories to my boyfriend's ear while we watched. My predictions aside, I must say I was pleasantly surprised with the resolution.\n\nComplementing the action and suspense, the sci-fi elements illuminated the screen. I felt like a kid on Christmas, dazzled by the various futuristic technology. One that stood out was K's AI companion, Joi. Not only could she be used to complete basic household tasks (a la Amazon's Alexa), ![joi and K](https://cdn.traileraddict.com/content/screencap/120683.jpg)but she also provided an emotional relationship (much like Spike Jonze's Her). I couldn't help but wonder if someday similar AI might provide support and connection to people who may otherwise not have the opportunity to find a human companion.\n\nAnother striking piece of technology was used by Wallace, the physically blind antagonist. He is constantly accompanied by small flying camera bots that seemingly capture live images and instantaneously transmit them to his brain. The real world application of such a technology could eliminate a life altering barrier for millions.\n\nSuch innovations always intrigue as they hint at the potential tools we just might have the chance to experience.\n\nWhile I had to whisper clarifying questions here and there to keep up, I found the film accessible and enjoyable overall for someone new to the franchise.\n\n**8/10**"
        }
      ]
    }
  ]
}
