{
  "movies": [
    {
      "id": 1,
      "release": "July 21, 2017",
      "name": "Valerian and the City of a Thousand Planets"
    },
    {
      "id": 2,
      "release": "July 28, 2017",
      "name": "Atomic Blonde"
    },
    {
      "id": 3,
      "release": "July 21, 2017",
      "name": "Dunkirk"
    },
    {
      "id": 4,
      "release": "August 11, 2017",
      "name": "Naked"
    },
    {
      "id": 5,
      "release": "September 8, 2017",
      "name": "It"
    },
    {
      "id": 6,
      "release": "September 14, 2017",
      "name": "Mother!"
    },
    {
      "id": 7,
      "release": "September 22, 2017",
      "name": "Kingsman: The Golden Circle"
    },
    {
      "id": 8,
      "release": "October 6, 2017",
      "name": "Blade Runner 2049"
    },
    {
      "id": 9,
      "release": "October 13, 2017",
      "name": "Professor Marston and the Wonder Women"
    },
    {
      "id": 10,
      "release": "October 13, 2017",
      "name": "Happy Death Day"
    },
    {
      "id": 11,
      "release": "November 3, 2017",
      "name": "Thor: Ragnarok"
    },
    {
      "id": 12,
      "release": "November 17, 2017",
      "name": "Justice League"
    },
    {
      "id": 13,
      "release": "November 10, 2017",
      "name": "Murder On the Orient Express"
    },
    {
      "id": 14,
      "release": "December 1, 2017",
      "name": "The Disaster Artist"
    },
    {
      "id": 15,
      "release": "November 3, 2017",
      "name": "Lady Bird"
    },
    {
      "id": 16,
      "release": "December 15, 2017",
      "name": "Star Wars: The Last Jedi"
    },
    {
      "id": 17,
      "release": "December 1, 2017",
      "name": "The Shape of Water"
    },
    {
      "id": 18,
      "release": "November 22, 2017",
      "name": "Coco"
    },
    {
      "id": 19,
      "release": "January 12, 2018",
      "name": "Paddington 2"
    },
    {
      "id": 20,
      "release": "December 8, 2017",
      "name": "I, Tonya"
    }
  ],
  "reviews": [
    {
      "movieId": 1,
      "submissions": [
        {
          "title": "Can We Discuss WHAT THE FUCK Happened To VALERIAN and If its Redeemable Qualities Can Somehow Shine Through the Blunders that Reside at the Core of the Film?",
          "author": "e-vaughn",
          "markdown": "Like many that hold 'The Fifth Element' dearly in their hearts from their youth, I was pretty damn amped about Valerian. 2 of 4 of the trailers made it look like a decent enough lil adventure story, and the lushness of the visuals were enough to get my gears churning putting together all these little sci-fi concepts into *some* sort of sensible world-view. See, that’s what I absolutely LOVE about sci-fi as a genre and setting. It’s a straight-up playground for any creative visionary, and visuals/concepts alone can sometimes carry a sci-fi movie to great heights.\n\nThe Valerian trailers touched on a sense of excitement that *I remembered* the Fifth Element touching on. It looked fun, silly, and dramatic. There was a sense of rigidity in the lead actors that I did my best to dissuade myself from feeling. To be completely honest, neither of the two leads have done anything in any flick that I have actually really been impressed by. I wasn’t going to let a trailer get me to vilify what could be a solid flick. As reviews poured in around 70% on RT, I was actually pleasantly surprised… but then I started reading them and the numbers kept dipping over time. Still, I bit the bullet last night and watched Valerian: City of a Thousand Planets and hooollly shit, what happened?!?\n\n## Redeemable Qualities [Spoilers from here on out]\n\nI am stoked I saw this. Really happy to have seen it, actually, even though I think it was actually boring and hard to watch at times. I laughed during scenes I was supposed to laugh at, and found some of its thematic silliness to hit home well enough. I was legitimately amped on the introduction which showed diplomatic greetings over 150ish years and amongst an plethora of diverse alien species. My love of Sci-Fi and RPG style games (Mass Effects and KOTOR are great examples) really tuned my imagination when piecing together lore. Each alien race had enough detail and biological design that made my mind swirl: Ooh, how do these guys gather food? Is this a working class? Are these data-sentient only? How does his tentacle not wither outside his suit?![Hey guys, yyyya mind explaining wtf is going on?](https://pbs.twimg.com/media/C8GYxQAWkAEl5Co.jpg)\n\n**THIS**. This questioning and curiosity around concepts alone make this movie something worthwhile. “How does an alien exist that can reproduce nay material plugged into it? Why is this other alien race purely pacifistic?” These questions often came from the impeccable design the movie lavishly had on display. Honestly, the design and visual direction of the movie is easily its strongest shine. Spacecraft architecture, UI interfaces, weapon concepts, platforming tools, handheld interdimensional portals, and the clothing. Oh MY GOODNESS, the CLOTHING! The clothing and design of the fashion was extraordinary. Not only did the clothing look incredible, pull from various cultures, imply some practicality, it was all encompassing and really built the world up (especially in the intro scene). The clothing was beautiful and engrossing in a way that supported this movie’s value as pure eye candy, and it led to certain cerebral provocations.\n\nI had so many curiosities… but the more I thought about them, the more each concept and idea felt shallow and untethered to the universe crafted before us (Why the fuck does the Mul race need 20megaton energy pearls, and how come they aren’t utilized by ANY character in this movie?) and much less to any central narrative.\n\nI genuinely liked some Sci-Fi elements of this flick, but then there wasn’t any new concept that felt new and fresh and made me really think. I found much intrigue in the description of Alpha, with its neuron-building aliens, its underwater marine meanderers, and its finance-loving data-aliens. Sure, these bite-sized concepts got me enticed and many of them were gorgeous, but the sum of their parts add up to less than each one might have stood as a fascinating youtube video, or something.\n\nThis is entirely because the central narrative and driving force of the movie is about as off-kilter and uncharismatic as it gets.\n\n## Shit to Beef About\n\n![Much of this movie revolves around these little monsters that shit magic, literally](https://gifed.video/gif/001/pearl_alien_valerian_and_the_city_of_a_thousand_planets.gif)\n\nFuck man, there’s a lot to beef about in this fucking flick. Since I’m on the narrative and the action and world-building, I’ll stay here for a second before moving to the elephant in the room. As I mentioned, Sci-Fi concepts have much less impact when they fail to actually drive the storyline forward and instead exist only to demonstrate some concept. Laureline’s entire expedition to the water-zone had her doing no actual heroics, save for sticking her head into a jellyfish butthole, AND that was done only to locate Valerian’s location. There are probably a thousand different side-quests that she could have done, and this movie chose this one. That’s fine, I guess, but it didn’t build her character in any capacity and there was a huge Checkov’s Gun blasted at our face when she stayed in the Jellyfish a second longer than was allowed yet there were ZERO repurcussions. Ok, fine. I guess we got a semi-inspired marine-life biology scene and got to look at Cara Delevingne stretch her ability to express fear and bewilderment, but this scene didn’t add to the whole in any way.\n\nThe action was *not* terrible. The melee combat with the dumb floppy aliens was actually pretty great, while the gun fight was horrendous. One of the best action bits of the trailer showcases Valerian running through multiple walls before exploding out into a chasm and then using a platform generator to traverse a gap, run through a neuron-harvesting field, and then propel underwater to arrive at a destination. Why does he do this? Is he being chased? Is he in trouble? Is it necessary? Well… no. He literally runs through those because it’s a shortcut. The best action scene has no gravity to it, at all.\n\nThe movie has no stock in our emotions at all, it would seem. It never creates tension, and I’d legitimately be surprised if anyone felt anything for these characters other than annoyance. And here we get to the crux of the problem: our two lead actors.\n\n## Acting, Charisma, and Screen Presence\n\nI didn’t expect the acting to be excellent based on the trailers, but I honestly didn’t expect this level of ineptness. It honestly is SO fascinating because of how much of a blunder this is. Like how the FUCK did you get actors that are this weak? Cara’s acting is relatively ok. She never wows, but she does her part has an occasional note of emotional expression that hits home. I liked her ending monologue about love, rule-breaking, and what she needs from commitment. It was directed at the wooden barn door that is Dane DeHaan, so it was effectively a monologue. Despite Cara’s best efforts, I was not inspired in any capacity, but I *can still* see why she was cast (those eyebrows, amirite?).\n\nI don’t want to sound incendiary, but I have no fucking idea why how Dehaan snagged this role. None. Like, what was Luc Besson going for with this? I really want to peep the source material comics to see if there’s some remnant of understanding it’ll denote as to why DeHaan was the most uncharismatic, phoned-in, annoyingly voiced, low-effort, semi-sarcastic, monotone leading man. There’s GOT to be some vision they were going for, right?\n\nThis fool had ZERO fucking screen presence. He had no energy, no chemistry with his lead (save for literally the final kiss which looked plausibly genuine), had no zest to his punchlines or jokes, and just behaved inconsistently as fuck between his “soldier” mentality and his grade-school attempt at playful banter. It was actually frustrating to endure. It made me realize just how important charm and energy matter in on-screen characters, and DeHaan’s depiction of this space-rogue/military agent/spy dude was probably the largest blemish of a leading man in an otherwise well-crafted movie I’ve seen in cinema. That seems hyperbolic, but fuck homies. **If you liked his acting, PLEASE let me know what you liked. I am genuinely curious what about his portrayal drew you to him, and how you related to him.** I feel like I could talk about the acting and how important it is have captivating characters that *can* be subdued or reserved yet still hold screen presence. Examples would be Gosling in Drive, or [Dan Steven’s in The Guest](https://www.reddit.com/r/TrueFilm/comments/2s6ozj/the_guest_and_the_cinematic_expression_of_human/).\n\nActing aside, the movie had no attempt at building Valerian as a character to give a shit about. So Valerian is a ladykiller…. That’s the only backstory we get? How? With THAT level of charm? It makes no sense. And Laureline makes fun of his lack of commitment, so his solution is to propose right then and there? How are these two into each other? And she’s *actually* pondering a life with him…. Why? He’s had about 40 other partners he brushed off, and then like, he’s inexplicably going to be faithful to Laureline for some reason? The fuck is this? And he’s a soldier says he “plays by the rules” yet is constantly shitting right where he eats and banging his partners? WHAT?! It’s a weird feeling when the most unrealistic thing about a sci-fi movie is the very human element and the only thing I can’t suspend my disbelief about.\n\nAnd it’s not like Luc Besson doesn’t understand good acting or how to NAIL this challenging tone of silly slapstick characters. You’ve seen The Fifth Element, right? If you haven’t go peep that immediately. I literally watched it right after Valerian to see how it stacked up. Korben Dallas, Leeloo, Zorg, and motherfuckin’ Ruby Rhod are DRIPPING with charm. They are all so over-the-top and adorable, flamboyant and energetic, emotive and they all have range. Korben’s sarcastic “fuck off with your bullshit” demeanor actually works and builds towards his character. In the first 2 minutes of him being on screen, we learn a TON about him. He’s an ex-marine, fucking up at his job, has mommy issues, has a bad smoking habit, and has amazing combat boots. I mean, Luc Besson directed these characters to success. It just makes the intention behind what happened with Valerian’s character make no sense at all.\n\n![beeep boop beep I have know idea what I am doing](https://68.media.tumblr.com/388b275bed68efaf981e3d6061ce1b86/tumblr_ogfugmWi8T1tamedoo1_500.gif)\n\nWhat happened? What am I missing? Are people relating to DeHaan in this role? Is he embodying something to aspire to, in any capacity? Somebody, please, send help. Help me understand. Please.\n\n## TL;DR\n\nLuc Besson made the Fifth Element with fun characters and tonally enjoyable scenes of goofy sci-fi shlockiness. Valerian’s lack of fun characters illustrate how quickly a movie can crash right into the ground. Beyond some lush visuals and richness, beyond incredible aesthetic design and especially incredible costuming (this could win an Oscar just like Suicide Squad did), and beyond Ri-Ri’s solid cabaret performance, this flick ground to a halt with its uncharismatic lead. Hopefully others can explain what Valerian’s character was going for and how it worked for them.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Yes. And only of this genre. This movie is for those that like hard sci-fi concepts and piecing together a lush universe and imagining better stories than what is currently on-screen. It’s for folks that care more about the aesthetic design and the way things might work than the characters.\n\n**Recommended for non-fans of this genre?** No. Honestly, no. I struggle to recommend this to anyone who would not like sci-fi because there is no emotional core to this film.\n\n## Semi-arbitrary score: 2 / 5 stars."
        },
        {
          "title": "Valerian Reviewwwwww",
          "author": "Megan",
          "markdown": "Mind-blowing advanced CGI? Check. An accomplished and highly regarded sci-fi director? Got him. An astronomical budget? Through the roof.\n\nSound like the formula for the next sci-fi cult classic? If so, then you forgot the same vital ingredients the creators of Valerian did: a compelling storyline and an engaging cast.\n\n![fuckin weather on this planet is ridiculous! (ಥ﹏ಥ) ](https://media.tenor.com/images/2aba59f067b1c2f43337953efeb91cee/tenor.gif)\n\nWhile the film was wrought with intriguing futuristic concepts and beautiful design, its visuals weren't enough to make up for the poor acting and sub par writing. Both starring actors, Cara Delevingne and Dane DeHaan, gave underwhelming performances. They failed to bring any charisma to their characters, establishing no chemistry with the audience or each other. They are not solely responsible for the flat tone of the film, however. After all, the script gave them little to work with.\n\nWe first meet Major Valerian and Sergeant Lorelaine while they are enjoying a virtual beach. A playful, choreographed wrestling match ensues, sparking hope for a sexy sort of tension. Unfortunately, that was the epitome of chemistry, and the rest of the film lacks any hint of flirtation, arousal or even close friendship. Even when he proposes marriage, there is no sense of romance, love or excitement. In fact, the only catalyst for his proposition is to combat Lorelaine for calling out his fear of commitment. What a great foundation for marriage, saving face. The lack of emotion isn’t limited to the title character, however. This sense of apathy expands through the length of the film. I would argue that this is due to a complete absence of backstory.\n\nThe gaping deficit of context surrounding the characters inhibits the viewer from empathizing with them. The information hole was so distracting that I actually turned to my partner to ask if the movie was a sequel. It seemed as though the title character was intended to be a smooth, charming Casanova of sorts. His empty lines and blank history made it nearly impossible to frame him this way or even find him attractive hero. The heaviest collateral damage from this oversight came in the death of Rihanna’s character, Bubbles. Because our main character was so devoid of substance, his emotional response came across as cheesy. A moment that was inserted as a sentimental motif was just too little too late.\n\nWhile the incredible imagery that accompanied this empty plot wasn’t enough to save the film, it does have merit and deserves some mention. Particularly, I found the technology presented very intriguing. Early on, we see a huge empty park in the desert with hundreds of people wandering around. It is then revealed that they are immersed in some kind of virtual travel to another dimension via a VR like headset. Even more fantastic is that they can purchase items and then somehow transport them back to their reality. Strangely enough though, their purchases are nothing exciting and seem a poor choice on the writer’s part. If one of the few redeeming qualities of your film is it’s science fiction concepts, why not have them purchase futuristic gadgets? Instead, they are excited about the pile of junk they’ve acquired. What a wasted opportunity.\n\nThere is no denying that Valerian was both innovative and technically impressive. It was fun to watch for the imagery alone. However, this doesn’t keep the film from feeling less like a cohesive and immersive story, and more like a highlight reel of a writers' rooms best sci-fi ideas."
        },
        {
          "title": "My thoughts on Valerian",
          "author": "Jacob",
          "markdown": "When I first walked away from Valerian and the City of a Thousand planets, I felt relieved.  Based on a comic book series of the same name, this adaptation contains very little to keep the audience engaged beyond the sex appeal that comes with flashy animations, handsome actors, and tip top visual design and direction.  This appeal fades quickly as the narrative, and dialog are not very engaging.\n\nThe main actors themselves deliver lines that feel sophomoric and are lacking poise and expertise of professional special forces agents. Valerian exudes a boastful air as a major in some galactic law enforcement institution, and comes across as Johnny Bravo.  He mentions his epic love life and his sky high aptitude as a special agent, but he is always unprepared and by sheer luck and the actions of those around him, he is able to succeed.  The problem with this is that the emotional resonance I have with this character is that of a stoic idiot with an enormous ego, which rubbed me the wrong way constantly.  I felt for Laureline as she complains about his behavior and attitude, until she somehow falls even more in love with him by the credits.  The advent of this decision brought about by a moral conflict/resolution between the two characters which felt contrived immediately.\n\n![Lots of cool aliens though ◔̯◔](http://cdn.movieweb.com/img.news.tops/NEoHmnwuKlNTsr_2_b/Valerian-City-Thousand-Planets-Character-Posters.jpg)\n\nI get that this is based on a comic, (which I have not read) and that for the most part the narrative of graphic novel can be allowed some leeway to showcase a more visually compelling experience, and in that sense this film is quite fun.  Character art and visual set pieces allow you to become lost and engrossed in the stories atmosphere and setting.  All of these aspects of the film are good, quite good, but there was a big gap for me in storytelling as Valerian and Laureline were just so one dimensional. I did not empathize with them and found myself wishing that they were replaced with different actors or received better direction or.. something.  Like watching two models blue steel their way through every and all situations, without a trail of breadcrumbs to connect the dots."
        }
      ]
    },
    {
      "movieId": 2,
      "submissions": [
        {
          "title": "Atomic Blonde’s Chemical Composition Shines Brighter than the Mix of Its Parts",
          "author": "e-vaughn",
          "markdown": "## The Action Landscape in 2017\n\nIt’s a great time to be an action movie cinaphile. While the 90s and early 2000s held their respective heads above water, the recent years’ entries have provided some interesting blends of incredibly well-choreographed action, solid editing, and stylistic cinematography. Moving away from the horrific shaky-cam, hyper-editing, sloppy action of the Bourne movies or Bond entries like Quantum of Solace, we find ourselves in a landscape with fresh action-flicks like The Raid 1 & 2, John Wick, and now Atomic Blonde.\n\nUnlike those other flicks which have a cemented identify in their action core, Atomic Blonde tries to be a bit more than a wonderfully well-crafted dynamo. Unfortunately, that ambition reveals several missteps that must be highlighted along with its successes.\n\n## Atomic Bombshells that Work\n\n![Charlize does kick some ass... like a lot of ass](https://peopledotcom.files.wordpress.com/2017/07/atomic-blonde.jpg)\n\nAtomic Blonde has much to be praised. I’ll get to the most exceptional component of its action in a little bit.\n\nIt’s got a stylistic tone and aesthetic that is reminiscent of its comic-book adaption roots. I love the soundtrack and 80’s vibe peppering the flick, while still maintaining a contemporary visual feel and cadence. The editing is fun and experimental early in the movie, but the latter half is strangely missing any editing gimmickery or flare.\n\nThe fashion is exceptional. Both Theron’s character and Macavoy’s are dripping with style and intentional clothing choices. There is a sexiness to the film and the color contrast is sharp throughout, without ever feeling too glossy or oversaturated. The movie is mostly cool hues that exaggerates the neon whenever it appears.\n\nAnd of course… the reason you likely watched the movie is the fighting and action. This is far from the first badass female protagonist we’ve seen leveraging physical combat to overcome her obstacles, but it might legitimately be the most well-constructed underdog fight scenes of any film in recent memory. The physicality of Theron’s performance, the style of martial arts she uses, the amount of brutal punishment she endures, the choice to contain abundant long takes and intimate hand-held camera footage… all of these make the action incredibly striking. Dripping with oomph, even.\n\nTo see a female combatant handle herself with such savagery is rare. To see a female fighter actually have grounded physics to her combat and deliver strikes and engagements that provide a realistic sense of momentum and weight is beyond rare. To see a female combatant clearly unable to outmaneuver a male opponent that has 100lbs on her is rare. To see a fighter that takes ridiculous punishment and showcase fight scenes where enemies visibly get winded and bleed out is rare. To have all of these massive action-focused positives embedded in a movie that tries to aim for more is also rare.\n\nThere are several note-worthy scenes to this flick. The hallway long-fight is exceptional. It’s an insanely long take (very likely interspersed with clever cuts when the camera hits flush against someone’s clothing or a wall, close-up) yet it moves dynamically and brutally. I can’t deny that I was in a state of awe for most of the fight scenes. Like John Wick’s palpable love of murdering goons, Theron’s character clearly enjoyed the physical struggle, which made me enjoy her struggle.\n\n## Atomic Elements that Fizzled\n\nWhile the intentional physical struggles were a sight to see, there were several components to this movie that prevent it from being a dazzling knockout.![Just shut up and be cool okay ](http://cinemavine.com/wp-content/uploads/2017/04/atomic-blonde-movie-charlize-theron-1-1.png)\n\nFirst and foremost, this movie is almost immediately comparable to John Wick in its style of action and combat (yet it very handily relies more on hand-to-hand combat, rather than gunplay). However, it isn’t a revenge thriller. It’s a spy flick. A spy flick that has a relatively weak plot, designed only to propel the story forward in search of a singular confidential “list” in the bowels of Berlin.\n\nThis plotting forces comparisons to much stronger spy-flicks like Mission Impossible, or character driven capers like the Bond franchise flicks. Unfortunately, the star player that is Theron’s character does not have the gravitas to hold down a spy-thriller. Her coldness makes her feel more like a Glacial Blonde rather than an Atomic one. I don’t recall a single moment where she is charming in her personality. There is never a moment where she actually uses disguises or persuasion, mental trickery, or anything that would normally be contained in an espionage picture. In fact, she’s so glamorous and beautiful that she sticks out like a sore thumb.\n\nFor a movie that should and will very likely aim for a franchise streak, we’ll need to see more dynamic expression from our Atomic Blonde in order to preserve any notion of credibility that she’s actually good at being a spy… and not just a blood-thirsty combatant. Oddly enough, James Macavoy’s character lays on the eccentricity and spy-skills throughout, so the movie does have a notion that these elements are somewhat important.\n\nIt’s a bit funny that the most realistic parts of the film are the physics-based fight scenes, yet the CIA sections and spy-bits feel untethered and in need of backstory, which I hope to see developed in future films.\n\n## [TL;DR] An Atomic Brew that Still Works\n\nAll in all, Atomic Blonde is a pretty enjoyable movie for anyone hungry for an excellent action film. For fans of well-crafted choregraphy and stunning camera work, definitely peep this bad boi. For fans of style of substance and bountiful eye candy, this one’s for you. For folks that don’t much care for the driving force of plot in their actioners, this’ll definitely be an easy one to give grace to. Here’s hoping that any future sequel or prequel or whatever film that stars Theron’s character once more has her demonstrating a bit more of her psychological competence. Keep the kicks and random-object fight scenes coming, and I’ll still be snagging a ticket to see if the next Blonde picture goes as nuclear as this one.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Yes! Most definitely, this is a strong entry in action. Did you read my praise for how well-constructed the action is? It’s the best part! Go peep this homie. It’s definitely got comparisons to John Wick in many ways.\n\n**Recommended for non-fans of this genre?** Maybe. There is enough of a crispy cool package here that is diverse and beautiful that many can enjoy it, even if they’re not action fans. However, the action is easily the greatest part and the strongest contributor, so if you’re averse to action, give this a pass.\n\n## Semi-arbitrary Score: 8.5/10"
        },
        {
          "title": "Great Noir Action with an Intriguing Narrative",
          "author": "Jacob",
          "markdown": "**I’m a big fan of the noir style of storytelling.**  The dark undertones and gritty characatures have always been appealing to me throughout many mediums.  There’s just something sexy about people acting joyless while swilling hard liquor and chain smoking.  Atomic Blonde captures many of those moments perfectly while dealing out a hefty dose of fighting.  The story itself is not half bad but it does trip over itself a little bit at the end, leaving a pretty satisfying taste of blood, vodka, and cigarette smoke in the air.\n\nAtomic Blonde is an adaptation of The Coldest City, a noir style graphic novel from earlier this decade.![Power Kiiiisss!](https://coronadotimes.com/wp-content/uploads/2017/07/delphine-and-lorraine.jpg)\n\nAnd as an adaptation it subscribes wholeheartedly to the stylized dark brooding unhappiness that noir is known for. The main characters live off a diet of booze and tobacco while shifting from bars, back rooms and alleyways of 1980s Berlin.  All of which are just a means to keep their toils in check as they come closer to unraveling the mystery of “Satchel” and the secrets kept between world powers.\n\n**This brings us to story.**  On the surface this story starts with the murder of British spy, some stolen top secret information, and the blonde bombshell sent into the fray to fix everything and find out who done it.  The story contains plenty of intrigue, espionage, and thrills to keep things moving along at pretty good pace, and slows down just enough to enjoy the action and steez the movie really wants to convey.  From the very beginning of the stories exposition, things have gone south for the West and there’s a hill of beans between our Protagonists and the answers they seek.\n\nThe plot points contains nothing crazy, pretty standard James Bond antics but what this movie did well was present the plot in a sexy stylized way.  The only real qualm I had with the movie was the very end when some of character's true intentions and motivations are revealed, living a bit of a head scratching feeling.  I think this really came down to Charlize Theron’s character Lorraine Broughton, whose character was very very cold.  It was hard to get a sense of what motivated her at one point as she was just felt like a machine.  And I think for me the right shade of miserable is necessary as a protagonist of a noir thriller.\n\n**The great bits of this movie for me were clearly its style and action.**  I very much enjoyed the fight scenes throughout the film.  The hand to hand combat felt pretty satisfying and the limited gunplay was handled very well.  Even though Charlize’s character was a skinny white girl, I felt her scrappiness really shone through, allowing her smarts and skill to really make up for her reduced stature.  She also gets the shit kicked out of her which feels appropriate.  Several action sequences also featured long extended shots, with the camera remaining close to the protagonist.  These added to the feeling of stylized grit that Atomic Blonde worked hard to portray.\n\nAll in all. This movie was a success.  The colors, music and overall aesthetic gave me all the right noir triggers to keep me excited.  The narrative does an okay job of providing the audience with mystery and intrigue but has a pretty unsatisfying ending featuring a main character that is unrelatable and cold.  Would watch again."
        },
        {
          "title": "Atomic Blonde",
          "author": "Megan",
          "markdown": "## Vodka on the rocks\n\n Not only the preferred drink of the title character, but a perfect metaphor for this film- cold, powerful and sure to lead to a good time. Charlize Theron plays Agent Lorraine Broughton, a top ranked M16 badass on the hunt for double agents in 80s Berlin.\n\nWhile the story was a little shaky (there were honestly points I was downright confused at what she was looking for), the incredible fight choreography more than made up for it. I can't recall another film where the fight scenes so realistically highlighted the struggle to come back after taking a hit. The violence felt real and raw, and her wins felt all the more satisfying. Charlize’s steely charm, the punk aesthetic, and the incredible fashion design all contribute to an immensely fun watch. Perhaps I was drawn in by the violence and the glamour...but is that such a bad thing?\n\n![Damn girl, rough night?](https://hips.hearstapps.com/esq.h-cdn.co/assets/17/10/1489174106-atomic-blonde-1.jpg)\n\nAfter the film, I was discussing it with some friends who suggested that Lorraine was almost too cold to be likable. They thought her character fell flat and lacked charm or charisma. It made me pause. A character I found empowering, they saw as a shell.\n\nLater that night, I thought of Wonder Woman. Anyone who has seen me in the last few months is aware of my passion for WW. I could go on and on (and I will in a review to come) about my feelings for this important film. It comes down to this- the thing I love most about Wonder Woman is the complexity of Diana. She is a character who not only exemplifies strength, but also compassion, intelligence, loyalty, and justice. She is not a one-dimensional character, not a stereotyped, flat excuse for progress in film, but an inspiration.\n\nCompared to WW, Atomic Blonde is definitely not the picture of honor. Her intentions are questionable and her loyalties are muddied. She does not embody compassion or diplomacy or embrace nurturing instincts, but she is intelligent, and competent, and a force to be reckoned with. So, was it empowering to see Charlize kick a ton of ass and see hollywood glorify a woman for her physical strength? Fuck yeah! The truth is, we need an increase in both the quantity and diversity of female representation in film. Not all women are empaths. Not all women have pure motivations. And not all women have the capacity to maintain a perfect poker face while being interrogated or take a punch to the gut like a champ or walk off a bodyslam. Women are complex, and I am glad to see a strong, complex, substantial female character in Lorraine Broughton. She isn’t perfect, but her strengths are inspiring and her humanity makes her engaging.\n\n## 4/5 Stars"
        }
      ]
    },
    {
      "movieId": 3,
      "submissions": [
        {
          "title": "Dunkirk – a movie that’s less cinema and more vicarious amusement park",
          "author": "e-vaughn",
          "markdown": "## The Lineage of Mr. Nolan\n\nChristopher Nolan has slowly and steadily crept his way up to the mantle of A-list Directors that I find consistently compelling. The moment I processed the entirety of Momento and rewatched it, I had a growing feeling this man possessed a cinematic flair that would be worth noting for years to come. Today, I am staggered by just how undershot my initial praise has been.\n\nBatman Begins, the Prestige, the Dark Knight, the incredibly well crafted Inception, and then Interstellar had Nolan on a hot hot hot streak. When it was announced that Dunkirk was a war movie that relied heavily on practical effects and it was to have one of the highest budgets, it was easy to get excited. When it was lauded during early reviews, it was easy to get excited. When it landed at 94% on Metacritic, with reviews claiming quips like it was along the lines of “a war movie that stands among greats like Saving Private Ryan and the Thin Red Line”, it was easy to get excited. But when I sat there, watching this movie, I was surprised as just how hard it was to get excited.\n\n## More of a Proof of Concept Rather Than a Film\n\nIt’s easy to watch Dunkirk and gawk at the craftsmenship. As a cinephile that appreciates the struggle of film making and will often praise uniqueness (even when it’s uniquely unpleasant), this movie is a safe bet for recommendations. In a way, this feels like a war movie that is unlike any other war movie, or almost any other movie I’ve laid eyes on. It’s much more of an experience or vicarious ride than most movies. Because it is this way, it also has many purposefully missing components that impact connectivity to it as a film and decrease relatability, interest, or investment in what is happening on screen.\n\n![The entire British army on a big frothy beach](http://cdn5.thr.com/sites/default/files/2017/07/dunkirk_still_8.jpg)\n\nThe technical proficiency is phenomenal. The movie is LOUD. It’s bombastic and physically hurts at times. It showcases dizzying cinematography and scope. It has a sense of presentness for the audience because of its framing and intimate proximity with the few character the camera follows. Right out of the gate as we’re shown the only footage in the actual town of Dunkirk, bullets start flying and immediately entranced me in this feeling of claustrophobia, hopelessness, and sheer luck. A squad of about ten min immediately is cut down to a single survivor, and there is no emotional affect apparent from the character we’re left with.\n\nThe other 3 fragmented storylines showcase a familial sea ship (one day’s timeline), a dogfighting aircraft (1 hour timeline), and the aforementioned stranded private on the coast awaiting pickup (approximately one week’s timeline, if I recall correctly). These characters have no backstory and very little personality, save for the seamen’s moral compass. These characters are purposefully removed from humanity in a depiction that lends them to be more like avatars, rather than characters. No backstory. No experiential motivations for their actions. No forward momentum other than saving themselves or someone else’s life.\n\n## Detached Action is Boring Action\n\nThis creates a viewing experience that is inherently detached, for me. As I watched bullets flying and sat gripping on my seat-rest due to the cacophony of war-mess, I found myself never really impressed by the action. I was constantly impressed by the shots and framing and scope, but never the action. These depictions of war feel huge, realistic, and completely not glamorous. There is no glory here on screen. No advocacy that lends our audience to ever want to be near these environments. Even when the heroism in the air causes the soldiers to erupt into applause, it feels like an insignificant moments as these faceless avatars are thrust into the next minute where they must continue to strive towards survival.\n\nAt the end of the relatively meager 106 minute runtime (especially small for a war film), I found myself physically exhausted from the action. It was an ordeal to sit through because it was never-ending noise and unemotional action. Not “poorly crafted”, action, mind you. But unattached action. I found myself yearning to take this intended experience a step further, and watch it in IMAX. Or better yet, snag a pair of VR goggles and experience the whole film in a 1st Person POV from someone’s perspective. Really put me in the action. If that’s the aim, that is.\n\nThere was one compelling thought provoking moment that really surprised me. And this stands as a spoiler. \n\nWhen the young boy on the sea vessel tells Cilian Murphy’s character that his friend will be fine, even when he won’t… I was quite shocked. This was the single rousing moment of surprise in the whole film, and I found the boy’s decision to be one that took more nobility than the majority of sacrificial acts constantly on display. It also required more processing than the entirety of the rest of the movie. I was simultaneous impressed and contemplative.![Aaaah... salty sea air and sadness](https://media1.popsugar-assets.com/files/thumbor/mHOiKUjNOEzftyHNJk3hItZLpzo/fit-in/2048xorig/filters:format_auto-!!-:strip_icc-!!-/2016/12/16/794/n/1922283/ddc0efbec1c70c9e_1.gif)\n\nOther than that, the credits rolling gave me a sense of relief. Not because of tension, but because I could now rest. I want to highlight that I am tying this sense of exhaustion as a unusual reaction in my that stems from feeling the characters have no life or audience investment ask of them. I’ve watched countless action films and rarely feel “tired” watching any movie. This reaction makes this movie feel truly unique in this way, for me, and I must say that its uniqueness makes it feel all at once novel, hard to recommend, and also pale in comparison to other War Movies that I might place above it (Saving Private Ryan, We Were Soldiers, Black Hawk Down, Full Metal Jacket, Fury, and even Enemy at the Gates).\n\n## Conclusions and whatnot (TL;DR):\n\nDunkirk is a unique experience. It doesn’t feel cinematic. It feels vicarious and detached. It feels abstract and ungrounded. It feels like a tour of war rather than a character journey. It abstains from compelling dialogue and characters, and embraces claustrophobia and a feeling of hopelessness. It’s not a fun movie to watch. I wouldn’t want to watch it again… I don’t think. But I admire and respect it. I feel it crafts an experience comparable to that of a videogame, yet is decidedly a passive interaction. It doesn’t give me much to chew on because my teeth were clenched a bit too hard throughout. It’s boom boom loud and expendably violent, yet it doesn’t reward us with gore for the gorehounds or style for the fashionistas. It rewards us for enduring… and that’s not exactly a fun experience for a movie. And that’s ok.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Yes. For fans of war movies specifically, this is a unique experience and its beyond well-crafted enough to recommend one endures the runtime. It’s realistic and detached and desensitizing and not beautiful…. And sometimes that’s just the right depiction of war we need in our lives.\n\n**Recommended for non-fans of this genre?** No. I wouldn’t recommend this movie to most folks. I wouldn’t recommend it to action movie fans. I wouldn’t recommend it to non-action fans, or folks that watch movies to get lost in the experience. I wouldn’t recommend this to folks who care more about characters than the visuals. I wouldn’t recommend this to anyone looking to mull over the complexities of life or be provoked into brainy discussions. I would recommend this to someone who’s looking for a ride rather than a movie though.\n\n## Semi-arbitrary Score: 6.0/10"
        },
        {
          "title": "A Visceral Portrayal of War and its Humanity",
          "author": "Jacob",
          "markdown": "Christopher Nolan has always done a pretty good job of instilling his own brand of cerebrality to his films.  Something for your brain to chew on while the story plays out in front of you.  His batman movies were clearly elevated beyond most other superhero movies, with characters and themes that felt a little more serious and poignant rather than fantastical.  Movies like Inception and Interstellar gave us a fantastical quest but broke them down to showcase the stories themselves, making the characters and their struggles the set pieces for the narrative.\n\n**Dunkirk has done this to the max.**  Everything in this movie is done to showcase the characters in this movie and the primal motivations they have in a very dire situation.![The beginning is very tense, sets a very consistent tone](http://ww3.hdnux.com/photos/63/77/22/13628578/3/920x920.jpg)\n\nThe movie starts off with a bit of slow exposition, hammering home that the entire British army is up against a wall and is trying to get home, then all hell breaks loose and the feelings of desperation mixed with fear begin and rarely cease.\n\n*The real character in this movie comes from the atmosphere.*  There is very little dialogue and the only characters that really have names are civilians.  The only thing we really get to know about these characters are their rank and what army they fight for. Everything else you need to know about them builds off of their behaviors as they try to escape their situation.\n\n**And their situation is pretty fucked.**  This movie does a great job at instilling that sentiment.  The story revolves around several groups of people caught up in what seems like a logistics nightmare mixed with the emotions of war.  Everyone is desperately trying to get off this beach and are sometimes acting irrational and deceitful.  Their story is one of base emotions and the ones that make a difference are able to put those emotions aside and act dutifully.![༼ つ  ͡° ͜ʖ ͡° ༽つ BRRRrrrrrr pew pew pew!](https://www.technobuffalo.com/wp-content/uploads/2017/05/Dunkirk-Trailer-2-35.jpg)\n\nI think what Dunkirk has done very successfully is build a sense of tension, it’s hard to deny Nolan that.  From the beginning to the end you feel as though there is a horrible and dire situation on this beach, and not only are these characters experiencing the stress from these moments, but you as the audience are as well.  There are really loud and unpleasant noises, unglamourous and subtle action sequences that only let you experience the fervor of war, and long periods of pregnant, silent pensiveness.  You are here to empathize and experience these events, not feel wonderment or an impression of intrigue through exposition and plot.\n\n**But where does Dunkirk fall Short?**  For it’s impressive feats of war portrayal Dunkirk did make me feel uncomfortable at times, but in an engrossing way.  I wasn’t wanting the movie to end but I was looking for some catharsis which is achieved in a very small way when the story's conclusion finally reveals itself.  It was somewhat satisfying, but generally I was felt like there wasn’t much here in terms of face value entertainment.  It is a very special film that makes you respect the act of war and makes you feel connected to it in a way few other war movies have been able to do.  But it’s not a Summer night burner that you want to watch with a bunch of buddies."
        }
      ]
    },
    {
      "movieId": 4,
      "submissions": [
        {
          "title": "Naked - Reviewing, Analyzing, and Liking the Unlikeable",
          "author": "e-vaughn",
          "markdown": "## Intentional Movie Choices\n\n![Marlon Wanyes in Naked](https://occ-0-2433-1001.1.nflxso.net/art/57bb1/499251a519853360002f0a4b26aead5896157bb1.jpg)\n\nThese days, I almost always watch my movies with a sense of intention. I almost always choose a movie that I know I want to watch, have read a bit about, believe it’ll have some tangible merit incased within its frames, and generally expect my time to be rewarded with something I can walk away from.\n\nEven if a movie has JUST ONE scene, or JUST ONE thought it elicited, I consider that movie a movie worth my time. If you read my other reviews, you’ll see that I based my recommendations on different profiles of folks who may/may not get that “lil bit of value” of that particular picture/game/experience.\n\nThe other night, I was feeling particularly apathetic towards choosing a piece of media to watch. This is a rarity for me. Instead of choosing a movie I had already read about, or progressing in whatever latest game I had been chipping away at (currently, it’s Hitman and Runbow), I yearned for a super low-brow, low effort, easy flick to enjoy.\n\n## Marlon Waynes and the Naked Premise\n\nMoving across the Netflix page, I immediately stumbled upon the movie for me. It was called “Naked” and it prominently featured Marlon Waynes on the cover. Now, I’ve grown up watching Marlon in a great many things. I have a serious soft-spot for this boi. He’s got an on-screen charm that is at once goofy and eccentric, and his use of physical comedy and gross-out humor has always led to a chuckle or two.\n\nI remember staying up past my bedtime as an 10 year old just to catch a half-hour of the [Waynes Brothers sitcom](https://en.wikipedia.org/wiki/The_Wayans_Bros.). I remember cackling like a hyena as a young kid in the theater watching Scary Movie 1. I remember Marlon’s demeanor and goofyness, his never-serious persona always seemingly able to roll with any on-screen punches. \n\nThen I remember being blown away by the only serious role I’ve seen him in as he destroyed our emotional center alongside Jarad Leto, Ellen Byrstyn, and Jennifer Connelly in Requiem for a Dream. Marlon was consistently entertaining to me, and now proved his ability to throw some cinematic heat in our direction. I then lost sight of him, until peeping a relatively low-effort but laughable “A Haunted House”. This movie was… ok, at best. Another parody in line with Scary Movie knew exactly what it was aiming for, and it hit with a self-awareness that one expects from a parody.\n\nThen years passed and I forgot about Marlon. Then, last night happened, and Naked popped up on the list of flicks. I pretty much started watching it immediately.\n\n“So it’s groundhogs day, but like, with Marlon Waynes’ style of goofball humor… and he wakes up naked in an elevator and has to get to his wedding on time?!” Ok, shit, that sounds fun.\n\nHonestly, I feel that this whole Groundhog’s Day/Edge of Tomorrow/Source Code/Westworld style of movie is always fun. Almost, literally, always. When is it not fun? It’s great to see the variations of shit played out, and I had no doubt that Marlon would throw down.\n\n![We see Marlon in this exact starting point like 40 times in this thing](https://www.dailydot.com/wp-content/uploads/ee3/cf/fa2d72f005b03ac6.png)\n\n## Laughs and Sillyness\n\nSo this movie did its exposition and set up towards a romcom. Marlon’s a passionate substitute teacher who’s clearly afraid of commitment. He has a cute interaction with his fiancée as they board the plane and Regina Hall and him have pretty solid on-screen chemistry from the getgo. Her father is sulking, rigid, hard-ass of a dude who has beef with Marlon cuz he ain’t go no ambition. That’s fine, but man am I stoked to see some resolution from this dad-dude’s cold af attitude.\n\nThe movie quickly moves into the timeloop set point, with Marlon waking up repeatedly in the elevator. Personally, it’s easy to enjoy the character problem solving his way through a ton of different set pieces in order to achieve a perfect 'wedding day' experience.\n\n![Some of these scenes are absolutely ridiculous](https://static1.squarespace.com/static/51b3dc8ee4b051b96ceb10de/t/5968d56d86e6c08c90fd0715/1500042672613/)\n\n**No matter how stupid or goofy, Marlon pretty much always goes in on every scene he’s doing.**\n\nIt rolls through different characters, attempts, fight scenes, solid usages (though nothing truly unique) of the resetting time loop, and Marlon is going in in pretty much every scene. This one scene where his broken arm looks like a crazy straw that he pretends to suckle in his drugged-up post-ambulance state had me rolling on my couch giggling like a lil youngin’.\n\nThere were enough scenes that actually had me chuckling out loud, and it wasn’t too long before I started to wonder if this is the most I’ve laughed at like… any romcom, ever? No… could it be? \n\n## RomCom Heavy Lifting\n\nA romcom needs more than laughs though, right? And as the second half of the movie plays out, the audience is beginning to get reflections of deeper romance insights. These aren’t on some high-brow, philosophical musings… but they are sweet and down-to-earth and encourage a reflection of the powers of relationships. Might I remind you that while the movie isn’t ever taking itself too seriously, it’s somehow comfortable sitting in some thickness round its depiction of romance.\n\nIn often more ways than one, the movie depicts several important themes regarding romance, the autonomy of choosing our own partners, and believing in our lovers even when all others don’t see “what you see in him”.  It also hits on the tangible milestones of our romantic society: writing one’s own vows, enduring the trivial traditions of marriage, and of course suffering through the uphill battle of trying to win the favor of your fiancé’s father.\n\nThe movie is almost always goofy and aware of how flabbergasting silly it is. And then it comes through with some solid lil romantic scenes. We see Marlon move closer and closer to redemption in this time-looped “hour” every time he is sent back. \n\nThe ending was cute. The final dance was cute. The climax and resolution were cute. The whole thing, for fuck’s sake, is pretty damn cute.\n\n**Haters Hating HEAVY**\n\nAs the movie wrapped, I found that I had transitioned from the sleepy, low-effort self I was when I picked the movie to an energized and intentional state. I enjoyed the movie enough that I believe it kind of rocketed into the top 3 RomComs I have ever seen. I listed 10 Things I Hate About You and PS I Love You as some other standouts, Crazy Stupid Love, and 500 Days of Summer, and of course, Groundhog’s Day. And maybe the Wedding Singer… and maybe like Knocked Up (which I love). Is Amelie a RomCom? Oh, and There’s Something About Mary is great. Aww, ok, maybe Naked is like top 10 then. Maybe top 5? I dunno, it was FUN, ok?\n\n![Expect to see Marlon screaming a TON, just like this, in this movie. Is this why haters be hating? Cuz of his high pitched startle-scream?](http://legacy.shadowandact.com/wp-content/uploads/2017/07/netflixnaked5.jpeg)\n\nExpect to see Marlon screaming a TON, just like this, in this movie. Is this why haters be hating? Cuz of his high pitched startle-scream?\n\nI expected this movie to have like, a 34% on Rottentomatoes… but it didn’t. It has a whopping ZERO percent. That’s horrifically low. I don’t know what folks were expecting, or whether the movie was viewed as too slapstick, too low-bro, or too raunchy… or if they were somehow annoyed by Marlon, but *damn* son, 0% is fucking harsh.\n\nI walked into this movie knowing it would be goofy and silly, and most like a B-movie at best. So “bad it’s actually phenomenal” doesn’t quite work here, because the movie is pretty damned fun and not really cringy. It felt like it was hitting every note it was trying to hit, just like nails on a chalkboard try to sound somewhat abrasive. It was pretty self-aware, and came away feeling really sweet.\n\nMaybe this is one of those movies where it’s just purely subjectively fielded, and your mileage is going to vary greatly.\n\n## TL;DR\n\nNaked was a surprisingly sweet and hilarious lil flick. Heart-warming and competently led by what I consider to be a charming leading man in Marlon Waynes, we get a fun time-loop RomCom similar to Gronudhog’s Day… except it doesn’t take itself seriously at all. It’s got abundantly dumb but still giggle-inducing scenes. It’s got characters that you either are rooting for or love to hate on. It’s got some solid time it set aside for real talk and grounded shit. It’s cute. Peep it.\n\n## Recommendations\n\n**Recommended for fans of this genre:** Yes. So if you’re a RomCom homie or a comedy homie, or want something definitively light, I’d say yes, absolutely. This movie has enough laughs and enough lightness that it’s just enjoyable. It’s not that crass and has enough scenes to make it worth your time, IMO.\n\n**Recommended for non-fans of this genre:** I also want to say yes. Mostly because I want to see how you react to this thing if you don’t like to laugh, and if you don’t like romance, and you don’t like sci-fi. Ok. Honestly, you probably won’t like it. You’ll think the comedy is low-brow and the romantic scenes are sappy, and the acting is childish. If you want something heavy to weigh you down, this movie will be a helium balloon that lifts you up, all begrudgingly and shit. Good luck!\n\n## Arbitrary score out of 10: 8.4/10"
        }
      ]
    },
    {
      "movieId": 5,
      "submissions": [
        {
          "title": "IT (2017) – When Copious Blood Meets Cinematic Polish",
          "author": "e-vaughn",
          "markdown": "## The Horror Landscape IT Stems From\n\n![Weeeeee Balloons \\ (•◡•) /]( https://upload.wikimedia.org/wikipedia/it/a/a9/It_film_2017.jpg)\n\nHorror’s been one of my most beloved genres for the longest time. I naturally gravitated towards horror when I was younger due to the visceralness of it, the special effects, the intensity, the sex, the comedy, the gore, and the idea that by watching these very “adult” films I was somehow shortcutting myself in the world of adulthood. I spent years learning about extreme horror films, studying the classics, reveling in the shlocky b-movieness of them, and even took a class at the University of Washington study the horror film genre.\n\nIt was in this class that I let my natural appreciation become a genuine love and respect for the genre. Horror films present to us a cinematic catharsis. They ground themselves in the most base and primal of human emotions: fear, lust, and humor. They are rides much more than most other genres, and while they may appear shallow on surface level viewing as a result of their visual, gripping nature… the masterful works imbue frequent symbolism and recurring themes to make statements about the human condition.\n\nWhether it’s a demonization of sex/promiscuity through the frequent murder of “loose” characters, a hard slap to the face of sinners to realign one’s religious “incentives”, or the constant use of a “final girl” to demonstrate progressiveness (feministic protagonists overcoming masculine horrors), persistence (last woman standing), and personality purity (character development and survival through desirable traits), horror movies have themes on themes on themes.\n\nHorror films often marinade in grotesquerie. They blossom amongst fear. They thrive from the disgust of their audience. In the miniseries and the 2017 version of IT, Pennywise the Dancing Clown exists to feed off of the fear of children. Much like the films themselves exist to leach off of the fear of the audience, the 2017 version of IT is a consistently polished and well-crafted traditional horror film.\n\n## The Polish and Concept of IT\n\nIT in 2017 is on a completely different level of budget and polish than the 1990 miniseries, and about 3 times the budget (12 mil compared to 35 mil, which is actually ridiculously low for 2017 anyhow). Instead of going towards a gritty, low-lighting, dirty aesthetic, the newest IT is glossy and polished through and through.\n\nThe premise of a fear-fueled paranormal clown that has little to no rules creates an easy horror concept to stick with. The rules are hardly etched in stone for the audience and the characters, so we are both stuck guessing about what could come next.\n\n## Filming and Visuals and Creepyness\n\nDue to this relatively easy premise, IT comes out the gate swinging for intensity, creepiness, and visual splendor. More than most other horror films, IT plays like a budding set piece of horror scenes designed primarily to take advantage of creepy and experimental cinematography techniques.\n\n**Macro Shots** ![IT uses the various techniques in the Horror wheelhouse liberally. Jump scares, macro shots, picture-to-black cutting, voice distortion, and much more]( http://68.media.tumblr.com/8682117f55d496a635e28959df2ee3c3/tumblr_onl5d9ufNz1qd4rf5o3_540.gif)\n\nAs Pennywise has the innate ability to identify the most feared component of a child’s psych, we are drawn into pulling characterization from each kid based on what they shit themselves freaking out about. A hypochondriac by proxy’s revulsion of disease, an orphan’s firey childhood memory, or a young woman’s period provide snippets into these kids’ background struggles and hint at some of the anxiety caused by avoiding our issues rather than confronting them directly.\n\nThroughout, the movie has ample room to play with horror imagery. It’s largest strength is how many film techniques it exploits to create vivid and creepy visuals. This movie doesn’t hit that hard on psychological horror, or bleak human horror. It’s main potency stems from the polish and craftsmenship each vignette or scene builds tension upon. Each scene has enough style and visual flair that it has the potential to imprint itself into your brain.\n\n![Mama Movement Test](http://33.media.tumblr.com/beee32d7b9942008f4cc5ff4af933d2d/tumblr_nw33emQihs1rdredko3_400.gif)\n\nThe director’s prior movie, Mama, had some experimental techniques that played with the actual movements of the monster. \n\nIT uses a large variety of filming and editing techniques to make each scene come alive. Pennywise’s attempts at personifying anything remotely human while evoking maximal fear is pretty easy to see in every scene.\n\n![Pennywise is pretty damn scary motherfucking clown](https://cdn.movieweb.com/img.news.tops/NEDHyxNg0XqoHE_2_a/It-Movie-2017-Pennywise-Footage-Description-Sxsw.jpg)\n\nFrom the way Bill Skarsgaard places emphasis on odd parts of his speech, to the way he drools and loses focus in his eyes (one eye often askew, locked onto the camera in a 4th wall breaking way), to the filming techniques used when he dances to exaggerate the unnaturalness of his movements… the movie is jam packed with visual luster that feels ripe for crafting nightmares.\n\n## The Shit that Scares Us\n\nI recall the strongest lingering visual from any horror movie came from the waterlogged snippet of the girl in the closet from the movie The Ring. I must have watched it when I was 14 or so, but that single second of menacing bloat on that girl’s face freaked me the fuck OUT. It remained in my memory for over a year, stalking my dreams and rising my heart rate whenever I thought of a waterlogged corpse. It wasn’t until I went back years later to stop the footage right on the screen and sat in the anxiety of that horrific face that I decompressed my fear.\n\nI feel that IT managed to pack in a great many visuals that approached the intensity of that particular scene. I really appreciated how intense it dropped its shit. It embraced its hard-R rating. It actually reminded me quite a bit of another well-received remake that I loved: The Evil Dead (2013).\n\n## Movement\n\n![IT plays heavily with various cinematraphic techniques to create a purposeful uncanny valley effect with the horror icons. Everyone moved unnaturally and creepily]( https://media.tenor.com/images/c56d833df8c57ffd5657d42b8c412f0b/tenor.gif)\n\nAs horror has most often relied on style over substance, IT double-down on the style and editing. Analyzing this movie from a cinematography perspective alone seems like it would be ripe for discussion. But all of its isolated scenes that worked wouldn’t resonate much without a strong cast and chemistry that, thankfully, was no absent.\n\nCast and Remake Comparisons\n\nThese young kids were great. They were funny, they were cute, and they displayed palpable fear in an incredibly believable way.\n\n## Reactions\n\n![The child actors nailed the expression of fear, friendship, and funniness. Nearly every one of these kids was top notch in their respective roles.]( http://digitalspyuk.cdnds.net/17/31/320x160/landscape-1501685544-giphy-43.gif)\n\nI’d venture to say that nearly every single component of this remake was better, and at the risk of over-using this word because it’s just so damned fitting --- polished. The kid actors were great. The freedom to swear added a great deal of comedy and “boys will be boys” language that had me giggling like I was 14 once more. The blood and gore caked on these children was a gore-hounds, and the way they often shook violently at some seizure made me wonder how some of these scenes were shot. Honestly, the bathroom blood volcano coloring had such a delightful crimson to it that reminded me, once again, of The Evil Dead remake.\n\nThe movie also chose to dig a bit deeper with psychological abuse that wasn’t really touched upon in the original miniseries. Here we see several catalysts for why the bullies are the bullies, through a cycle of abuse that is juxtaposed by Bev’s background story and her relatively well-composed demeanor. I don’t recall this level of psychological trauma in the original, but it was welcome and grounded the film just a little in the real life horrors some of us face day in day out.\n\nAnd of course there’s the comparisons of our two depictions of Pennywise. There is no knock against Tim Curry’s 1990 depiction of Pennywise, but Bill Skarsgard straight knocked it out of the park. Less human and less relatable than Curry’s depiction, Bill’s clown talks just a bit less, moves just a bit more, and feel much more alien and multi-dimensional.\n\nEven in the opening scene, we see Bill’s Pennywise effectively set the tone for the film. A strange accent mixed with actually making Georgie laugh mixed with blank-facing to pull back from providing the exact opposite emotions created this uneasy tug and pull experiencing Georgie’s confusion.\n\n“Creepiness” is a rather strange emotions to tease out. It seems to serve to explore the times we find a subject uneasy or increase tension in us. Does it stem from misalignments in expectations, or feelings of being watched, or chased? Either way, this new IT feels like he’s got creepiness on lock.\n\n## Themes and Symbolism\n\nOne doesn’t have to dig awfully deep to pick out some of these themes and motifs in IT. The balance of “belief” vs. “fear” as a double-edged sword is portrayed strongly, but ultimately begs more questions than it answers due to the film’s non-rigid rule set. When does Pennywise need to kill these kids? How much of a resource is fear, and is he using it efficiently? Why is he leading kids to kill adults? Is it based on some ancient quota that we touch on lightly but never fully explore?\n\nRecurring themes of the red balloon, floating, loss of innocence, and puberty are also explored in some capacity. We see bullies that push their violence more than most on-screen bullies do, and we’re tasked to weight the evils we see on screen. Is IT a worse evil than these near-homicidal kids, or are the negligent, physically abusive, or sexually abusive parental figures the stem of their problems? How do we derive hope amongst the reality that IT actually murders our friends, and how do we derive hope when our authority figures that are supposed to help us are the ones keeping us in a cycle of fear, limitations, and continued violence?\n\n## TL;DR\n\nAfter a single viewing, there are plenty of things to get hyped about in regards to IT. The child acting and delivery is solid throughout. The gore and violence should satisfy most of the gore-hounds out there, and horror aficionados should revel in the technical mastery displayed in the stylized editing and cinematography. People looking to be scared shitless will have heart-rates spiked due to the creepiness on screen and the loud, startling sound-design. People looking for relatable characters should find at least one bit of resonance amongst the various children, exploited phobias, and sense of foreboding.\n\nAll in all, this is one very polished horror film that knows its strengths and puts doubles-down on highlighting them.\n\n## Recommendations\n\n**Recommended for fans of this genre:** Duh. If you like horror, you should absolutely see this. Beyond the legacy, this movie has so many solidly crafted elements that gotta peak the interest of any horror buff.\n\n**Recommended for non-fans of this genre:** Yes. This is a harder recommendation as horror is very specific and abrasive for some folks. There are those that simply won’t want to experience this type of terror, and that’s understandable and I obviously can’t recommend this film to anyone that can’t consent to seeing gore, child-violence, experience terror, and be bombarded with horrific imagery. However, for those that can handle those things, the movie shines brightly enough in between the macabre moments to make it worthwhile for non-fans as well.\n\n## Arbitrary score out of 10: 9.2/10"
        },
        {
          "title": "Horror Tropes meet Summer Adventure",
          "author": "Jacob",
          "markdown": "*I’m not a huge fan of the horror genre.*  It contains many tropes which I consider to be a little cheap. It can sort of feel like embodying a rat in maze and the only way out it to brave the path ahead of you. There is often no subtlety and you can often feel the terrifying moments coming before they startle you.  But Horror movies do not have to be this way.  The genre has an incredible opportunity to push the creative envelope by being afforded the chance to push our imaginations to experience things that we may not want to think about. To push us and challenge our comfort zones.\n\n‘It’ comes from a great horror pedigree, based of a miniseries written by Stephen King.  The 1990 story I think did a pretty good job of pushing comfort zones, as well as having some pretty great disturbing scenes without relying on jump scares to make you uneasy.  Plus it birthed the classic clown as a supremely scary thing, using subtle imagery and lighting.  In this remake, Pennywise is every bit as horrifying and even feels like a more realised villain thanks to Bill Skarsgard and some exceptional camera and lighting work.  The story is also just as solid as the first, but contains some excellent child acting and a very compelling narrative of contemporary friendship.\n\n![Jesus dude, your eyes are fucked](http://horrorbuzz.com/wp-content/uploads/2017/09/IT1.jpg)\n\nThe general story of the movie without any spoilers is pretty simple: There is a town, and for some reason there is this fucking clown that eats kids.  Great premise, full of room for allegory and good juxtaposition of teleology.  *Clowns are supposed to make you feel better, not eat your offspring*.  So now that that’s out of the way, let's talk about this clown.  This clown is extremely unsettling and eerie.  Bill Skarsgard does a great job of nailing the mannerisms of a clown while obviously having an appetite for pre pubescent humans.  The way his eyes glow, the way he drools when around the kids, it’s all got a great attention to detail that immerses you in this ridiculous and terrifying reality.\n\nSomething that I really appreciated, which I’m not sure was in the original miniseries, was that we see Pennywise’s ability to change shape into some surreal and horrifying things.  His arms change into huge macabre looking claws that are agile and deadly, he takes the forms of terrors that the kids project, lending this sense of mystery and terror not knowing exactly what he is or what he is capable of.  His default form of a butt ass looking clown gives this presence of a silly albeit eerie thing that’s true purpose is supremely obfuscated since it clearly has a goal.  Toying with these kids is a priority and he does so in pretty terrifying and creative ways which I appreciated.\n\n![It children underground](https://pixel.nymag.com/imgs/daily/vulture/2017/09/06/06-it.w710.h473.jpg)\n\n**These poor kids**.   While they are pretty unlucky in terms of circumstance they are very good actors.  I felt like these kids were great friends and they behaved as legitimate friends do. They busted each others balls, made quips about their moms, and exhibited that give and take that like real relationship has.  Which was something the original nailed, and I am really glad that this remake made this a priority as well.  Each character felt like they had real personality that carried through the whole movie.  The jokes they make are legitimately funny, their conversations, their body language, their facial expressions. All very engrossing and most of all fun to watch.\n\n![You guys ready to fuck up a clown?](https://www.comicbookmovie.com/images/articles/banners/153918.jpg)\n\nThere were some interesting subtextual elements that I think are worth discussing as well that gives this movie some added thought fodder.  The main one was how cold and unsympathetic all the adult characters behaved throughout the film.  They were downright unlikable in every instance.  Either they acted angry and/or frustrated with the children or where cold and judgmental.  All acts of catharsis and importance seemed to be enacted by one of the children or another child actor.  FLoating was also a big theme, I won’t get into too much detail to avoid spoilers but the floating balloons, the floating kids in the well, which we may see play out a little more in the sequels.\n\n**Would I recommend It?** Totally.  All of it’s parts were quite fun and even though I’m not big horror fan, this movie has a lot of things going for it. The narrative, acting, and thrilling horror moments all play out quite well and I think should be experienced by any consumer of film."
        }
      ]
    },
    {
      "movieId": 6,
      "submissions": [
        {
          "title": "Megan Reviews Mother!",
          "author": "Megan",
          "markdown": "As long as I can remember, a recurring nightmare has haunted me. Every few months I’d find myself stuck in a horrific situation, a seeming hell with no escape. The situation itself varies- running into an alley while being chased by men, held hostage in a tortuous prison, being stranded on an island or deep in the woods. While each dream begins differently, they always end on the same chilling note. I try with all my might to scream for help, but my voice makes no sound. No matter how hard I try, my screams are silent.\n\nI have never seen another film which so accurately captures this feeling. Throughout the movie, I empathized deeply the main character, Jennifer Lawrence’s Mother. I could feel the fear and frustration strangling her. I found myself wanting to scream at the movie screen while she battled increasingly absurd and infuriating tribulations. The fact alone that mother! could pinpoint this experience made it a worthwhile watch.\n\n![Michelle still doing that Michelle thing](http://cinemavine.com/wp-content/uploads/2017/07/mother-movie-trailer-aronofksy-4.png)\n\nThe plot centers around Mother and her relationship with Him (Javier Bardem). Him is in the midst of a long bout of writer’s block. When a Man shows up at the door, Him ends up inviting him to stay in their house without consulting Mother first. Man’s wife, Woman soon joins, and Him continues his welcoming parade to the dismay of Mother. Tensions continue to raise when Man and Woman turn out to be less than ideal houseguests. They end up breaking Him’s most valuable possession- a precious stone. The plot snowballs into an absurd sequence of events. While far-fetched, the incredible acting blurs their plausibility. The guests’ sons show up and start a fight that ends with a death. The next day Mother shares with Him that she is pregnant. His joy melts his writer’s block, and he finishes his greatest work. Instantly super fans show at the house by the thousands, trying to catch a glimpse of the Poet.\n\nFrom this point forward, the religious parallels in the film are both abundant and disturbingly familiar. Well at least, familiar to me. Having been raised in a fundamentalist Christian church, I am well-versed in the the Bible’s account of Jesus. From the idolization of a seemingly philosophic leader, to the offering of a Son, to the sick cannibalistic ceremony that followed (*cough* Communion *cough*), the film was wrought with religious references.![Yeah, the ending of this movie was a bit fucked](http://digitalspyuk.cdnds.net/17/32/480x270/gallery-1502177969-giphy-82.gif)\n\nMany have written their own interpretations of this allegory. I might as well take my own stab at it, although the author’s intent is likely somewhere in the middle of all these theories.\n\nI think the story serves to warn the audience of the implications of blindly popularizing a leader. Arguably, it does so by breaking down the steps that cultivate a religious figure. It uses hyperbolic examples from the Bible as a history lesson. It says, “Audience, you know how a few people started following Jesus around, and then more and more joined and suddenly rumors flew that he could perform miracles? And everybody lost their shit trying to get to him? Remember how his death led to his reverence that continues 2000 years later (even though, ya know, no one these days has ever spoken to the guy)? Oh yeah, and remember how his followers now believe they can eat his body and blood for atonement? You know what that leads to, audience? Do you?\n\nIt leads to millions of people with a one track mind. Gargantuan communities filled with people willing to suspend their own critical thinking skills, judgment, and reasoning in exchange for a life on auto-pilot.”\n\nThe film showcases this phenomena with the uncontrollable mob. Their eagerness to get to the Poet trumps any moral responsibility they feel for the people or environment around them. And why do they adore him anyway? Why would they risk sacrificing their sanity? Because he provided them with some type of comfort or consolation that filled the “insert meaning here” gap in their lives. Though they knew nothing about Him, they put his words on a pedestal, and the fame and adoration went to his head.\n\n![Angry Javier!!](https://cdn.moviestillsdb.com/i/500x/fiu3pjjq/mother-lg.jpg)\n\nThis type of blind belief is dangerous. When people are born into or adopt belief systems that give them a script on how to live, it often costs them their autonomy. It is easier to be given a set of rules to live by than to actually think critically and develop your own values. There are millions of people who would rather apply one rule to a multitude of circumstances than to carefully examine each problem and make an informed decision about it. Though the film doesn’t establish a set of rules, it does display the “mob mentality” that results from a lack of independent thinking. When one person eats the baby, they all want to eat the baby.\n\nDoesn’t blind belief sound great already? Not only can submission to religion ease your mental load, it can strip you of any responsibility to your environment or the global community, too. What an exciting offer! In the film, the mob trashes the entire house, disregarding any respect or consideration for others. Often times religious groups are so inwardly focused that they isolate themselves from the rest of the world. I grew up in a church that cared very little about the “unbelievers” and taught that telling them how sinful they are is how to show them love.\n\nIs this allegory only limited to religion? I would argue not. How did we end up a reality TV star as a president, after all? Countless voters heard a vague but promising message and followed right along. Electing the guy who sounds good, but has questionable character and morals, relieves any personal responsibility to actually educate yourself on the issues as well as your encourages your isolation and biases against the rest of society. I can only hope the real-life consequences aren't as tragic.\n\nI am Mother. In this allegory, I am the one looking out at the tragedy that is my family, my former friends, my church. My heart is broken when I see the harm they are causing. I try to reason with them. I beg them to listen. I watch them destroying themselves, destroying me, and destroying the environment. I feel so filled with frustration I could scream.\n\n**But will anyone hear me?**"
        },
        {
          "title": "Mother! A Deep Well of Allegorical, Surrealist Horror Visualizations",
          "author": "e-vaughn",
          "markdown": "## A Polarizing Beast\n\nI been rattling off all kinds of thoughts ‘bout various flicks lately. There’s a lot of good cinema gracing us in 2017, and it’s exciting to spend energy processing why we like the shit we like. Err’body owes it to themselves to mindfully reflect on the what makes them “ooh” and what makes them “ewww”, or even what fails to make them so much as “mehh”.\n\nRecently I wrote about the value of uniqueness and how a single scene in a flick can make it one worth recommending (Dunkirk review). Mother! is the type of film that is unique and experiential enough that it’s easy to recommend to basically any mature viewer just for the sake of having them experience it, process it, and try to piece together what the fuck it’s about.\n\nIt’s polarizing in the sense that many will find it artistic, harrowing, and beautiful… while others will recoil from it in disgust, find its symbolism in place of plotting to be pretentious, and find it frustrating. I believe that this film is an experience that sort of has to be sat through and analyzed from one’s own point of view. In that advocacy comes an appraisal of this film’s existence.\n\n## Darren Aronofksy’s Mystique\n\nThis movie is the brain child of Darren Aronofsky. If you like thought-provoking and relentelessly disturbing cinema, he’s your man. He made Requiem for a Dream. Have you seen that shit? That might be one of cinema’s biggest gut-punches ever. He made the Wrestler, which was grounded and morose. He made Black Swan which explored the sacrificial drives of artists. And now he’s made Mother!, an intimate religious/environmentalist allegory that, like his other films, packs quite a punch.\n\n![Jennifer Lawrence is looking a lil broken](https://i.ytimg.com/vi/0T0EaIMamIQ/maxresdefault.jpg)\n\nOthers have touted that this is Aronofsky’s most disturbing movie, but I won’t uphold that belief. It’s way less potent than Requiem for a Dream due to its whimsical surrealism.\n\nIf you don’t care much about spoilers and want the movie explained to you, here’s a fun little synopsis and breakdown. I sincerely recommend you watch the movie first and experience it yourself, though.\n\n## Craftsmenship and Horror Techniques\n\nSo this movie establishes its cinematic fervor pretty much immediately. The movie is intimate. The camera is glued closely to our mother protagonist, Jennifer Lawrence for what feels like 70% of screentime. It’s about her journey and HER reactions. It’s her world, and we’re her audience, and she’s our vessel.\n\nThe movie uses extreme close ups on her face often. Like, I mean, all the time. Every reaction is almost always her reaction. Every point of emotional expression is viewed through her eyes. Any time a character appears on screen and reacts, it’s like we’re only seeing it through her eyes. It’s actually really intimate and beautifully crafted. The cinematography and lighting and setting are all so well crafted, as we journey through time and this house that represents a variety of things.\n\n![Pretty much all the actors right here](https://images.moviepilot.com/image/upload/c_fill,h_470,q_auto:good,w_620/mvdhgflwqdn8owqc4tk6.jpg)\n\nThis movie is surrealist. It’s going to bob and weave a bit and it’s going to feel untethered sometimes, yet things end up making sense when you start gathering your jigsaw pieces and assembling shit.\n\nThe sound design is great, and something I noticed pretty much immediately. It was, again, intimate and crisp and noticeable. Voices came loud up front and the house creaked and breathed with a life of its own.\n\nJLaw’s acting was, as per usual, pretty solid. She felt like another character in this (and didn’t feel like Jlaw) due to her demureness and meekness. Her expressions start out so hindered until they built to boiling points throughout the story, and especially during the climax. Her pain is easy to empathize with.\n\nThe movie achieves a feeling of claustrophobia and helplessness. It’s actively frustrating. There are times I was gritting my teeth in annoyance. The side characters are so well presented in their absolute dickishness that I kind of forgot good people existed while watching this movie.\n\nFrom a Horror standpoint, this movie doesn’t rely on jump scares. For the most part, it seeps in its images enough to get you to feel jilted and on-edge due to the grime on-screen – not due to the anxiety of a startling moment.\n\n## Scene after Scene after Scene\n\nI don’t think this movie is very fun. It’s not really meant to be fun. It does however, have scene after scene and performance after performance that gets under your skin. Whether it’s the blatant misogyny,![Ideal little house really](https://media1.popsugar-assets.com/files/thumbor/NJiZB_b10h281XzCmC55C5HAjtY/fit-in/2048xorig/filters:format_auto-!!-:strip_icc-!!-/2017/09/13/812/n/1922283/tmp_Y1XXtj_80a53f477952456f_House.jpg)\n\nthe disregarding of personal space, respect, or humanity, the juxtaposition of religious indoctrination against self-righteousness, or the motherfucking destruction of beautiful COUNTERTOPS! Fuck. That scene pissed me off so much. Those fucking assholes. It’s rare that side characters can fill me with such disdain but fuck, there were so many that got me borderline livid. And the countertops. My GOD. How could they do that?!\n\nThere are more scenes that feel like sandpaper against your eyes than not. And then the 3rd half of the movie kicks itself into overdrive and you just have to buckle up.\n\n## TL;DR\n\nWalk into this movie knowing it’s a trip. Walk into it with your expectations cut. Walk into it expecting to think and have to derive your own conclusions. The movie has so many off-the-wall moments and characters and scenes that get your gears grinding. It’s a worthwhile journey if you don’t mind a little abrasion when peeping flicks in the cinema.\n\n## Recommendations\n\n**Recommended for fans of this genre:** Yes. For fans of thought-provoking cinema, or horror for the style, or metaphors, or just batshit insane visualization. Peep this.\n\n**Recommended for non-fans of this genre:** Yes. I recommend this flick to non-fans of Horror as long they don’t mind a bit of mental gymnastics to understand what’s happening on-screen. Also, just gotta consent to being disturbed a bit and you’re good to go. It’s interesting enough of a flick that you should peep it and see how it makes you feel. Contrersial films can be great. Polarizing ones can be the most thought-prokoking. And you get to spend time wondering why you hated it so much, or why you loved it so much.\n\n## Semi-arbitrary score out of 10: 8.5/10"
        },
        {
          "title": "A Crescendo of Craziness",
          "author": "Jacob",
          "markdown": "*Boy oh boy what a crazy flick.*  I was expecting something wild when I walked into this movie, and I was not disappointed in the slightest.  When I first saw the previews for this film it seemed like your average ‘white girl in a house that is haunted‘ sort of affair, and my interest was not peaked at all.\n\n### *spoiler: this is not about a girl in a haunted house.*\n\n Then I learned that this film was directed by Darren Aronofsky, the same man that directed 2010’s Black Swan and 2000’s Requiem for a Dream.  After which I became quite curious and kept my eye on it as the promotional material for the film was released.  Now the Movie is released and I can say that the movie is quite **messed up** in the best way possible.\n\nFrom the beginning of the film, things are very ominous yet tranquil.  The audience becomes introduced to the House and Jennifer Lawrence’s character which have a special relationship to one another.  Things seem quite idyllic as the setting is set, and we are introduced to Jennifer’s husband Javier Bardem, what’s not to love?![Michelle and Jennifer getting into it](https://media.giphy.com/media/121GkWUHtEpPi/giphy.gif)\n\nBut very quickly things start to unravel.  Jennifer and Javier’s paradise is thrown a curve when some strangers show up and we begin to see the true nature of this arrangement.\n\nWe come to realize that these stranger’s aren’t just simple strangers but the **harbingers for a cycle that ties these characters together**, from the house to it’s creators and its inhabitants.  All of which is expertly shown, not told.  One thing that Mother! did a great job of was crafting a narrative that is always moving.  Even though there is not a ton of dialogue, there is so much going on all the time that has major consequences for the main characters.  The reactions and body language of the characters tell the story quite well and even though there is a ton of allegory and surreal moments the plot feels relatively straightforward and motivations seemed pretty clear.\n\n*Honestly there were a lot of WTF moments* when things seemed to be going in a direction that I could not foresee, but by the end things fit together pretty well and were rather Cathartic.  There was only one scene that I think could be described as fairly disturbing and it is quickly followed up with swift effective retribution by the main characters involved.\n\n![Yo, these people are the worst, lets choose a rosier alegory maybe?](https://static.rogerebert.com/uploads/review/primary_image/reviews/mother-2017/hero_Mother-TIFF-2017.jpg)\n\nWhat I appreciated the most from this movie was that it is very hard to describe what actually happened in this movie.  Of course there were characters, and they did things, but that’s not really the point of a movie like Mother!  Mother! is about ideas and the human condition, what it means to create and feel inspiration.  This movie did a great job of piecing together this patchwork of ideas and allegories in a pretty surreal manner that made me as an audience member kind of feel lost in it's both beautiful and grotesque presentation.  By the end I was no longer thinking of the characters as people experiencing the events unfolding in front of me, but as symbols on a sprawling tapestry.\n\nEven though this movie feels whimsical and allegorical when it comes to specific narrative plot points,  it never feels lost.  I was glued to my seat in awe as this crazy mystery of this house and these people swirls around the screen.  Every character represents something important to the story and every action is answered justly.\n\n I could talk about my interpretations of what the characters represent and what discussion this movie is trying to ignite but I think there is so much to talk about that it will have to wait for a different time and setting.  I’m so glad that movies like Mother! exist and I’m glad there are people like Darren Aronofsky that are trying to do something so intentional with their stories and expression.  Mother! is certainly not for everyone but it is a very unique and special film and one of my favorites this year by far."
        }
      ]
    },
    {
      "movieId": 7,
      "submissions": [
        {
          "title": "A Rare Flick That Makes Me Question What I Even Liked About the First One…",
          "author": "e-vaughn",
          "markdown": "## Intro Franchising and Praise for Kingsmen 1:\n\nIt’s rare that movies strike me as poor enough for me to actually recommend against seeing them. A small theme in my recent reviews is that a movie can contain even just *one* scene that makes it worthwhile for me. Just one…\n\nI don’t know if Kingsmen 2 had any such scene. That feels a lil wild to write considering that I recall seriously enjoying Kingsmen 1\n\nIt’s been over a year since I seen Kingsmen 1, but that movie had some serious badassery on screen. It was silly, almost satirical in its tone. This made it lighthearted and an interesting blend of comedy + action. Origin stories are often easier to nail than sequels, but Kingsmen 1 was *fun*. Fun to watch. Fun to see actors like Sam Jackson acting quirky and silly. [Fun to watch some of my favorite hobbies presented on-screen (like, this short snippet displays more character prowess from Eggsy in K1 then 90% of K2)](https://www.youtube.com/watch?v=onHfVUCKNGc).\n\n[And let’s never forget one of the most amazing and balls-to-the-wall brutal action scenes in the Church.](https://youtu.be/25683IE5v9g) There’s a fuck-ton of analysis to be done on this church scene ALONE, and it honestly stands as one of the better brawling action scenes I’ve ever seen in any action movie. The centralized chaos, the rhythmic and moving bodies, the complexity of choreography combined with the dynamic cinemagraphy that frames the action in a way that embraces the chaos yet demonstrates clarity… and the shock value. The music. The tension leading up to the violence. The amount of depravity and seeing our character completely unhinged.\n\nAs far as action movies go, it’s THAT fucking good. It might just be an action-cinema masterpiece\n\nKingsmen 2…. Has almost NONE of that dope shit in it.\n\nAs the sequel’s trailer played over and over before my eyes before the various movies I plopped my ass into theaters to watch, I found my already tempered excitement waning even more. [Something about the way the missile burrows a hole into the ground to rub-out the HQ rubs me the wrong way….](https://youtu.be/4PggfbzJcvA?t=29)\n\n## K2’s Characters Feel Different, K2’s Plot Drags:\n\nOk, so the movie basically reveals that Colin Firth is coming back in the very first trailer. I’m not too irked by this as far as trailer spoilers go, but while I remember enjoying most characters from the original, they are either killed off immediately in the sequel or dramatically change in terms of their personalities. Firth’s prior depiction and badassery from K1 is gone completely out the window and replaced by a amnesic meekness that just don’t fly. Egsy is still relatively charming, at points, but there are some off-kilter goofy character moments on display throughout.\n\nThe film squanders Channing Tatum, and introduces a variety of Statesmen that are apparently instantly trustable. This movie isn’t meant to be a bulletproof in its plotting, but man the pace and disregard for consistent realism is weak. We live in a sci-fi world with ridiculous gadgetry, but the encryption of the entire Kingsmen database is broken by a cyber-prosthetic in seconds?It’s hard to say what happened. The worst character depiction in the first movie was maybe Sam Jackson’s overly silly, lispy performance. And yet it worked. It was clearly silly and embraced the “hehe, look how much he’s like Bond villans” satirism. Yet Jackson has the swagger to pull off a blood-phobic super villain, and he shined in his role.\n\nKingsmen 2 has a villain that fell flat. Julianne Moore is a wonderful actress, but damn if her bubble-gum delivery throughout K2 didn’t continually miss the mark. Predictable in her sadism yet nonsensical in her actual motivations, she bordered on annoying. I mean, are we really going to see her methodically set up a meat grinder scene just to demonstrate her “villainy”? Not only was that scene tasteless in its content, it was wimpy in its shock-value, and made no sense in the character motivations. Why the fuck would anyone even want to join the Golden Circle? The entire antagonist circle feels so flimsy, it borders on half-assed.\n\nWe have 2 random dudes, 15 random guards, a Kingsmen reject and his festival-focused girlfriend… and handful of robo-cronies as the main circle. Then we have a grating performance by Sir Elton John, which I found neither charming nor humerous, despite liking Elton as a homie.\n\nAll in all, the characters I loved in K1 are replaced by impersonators. The largest grievance may have been Firth’s flip-flopping characterization. The fun of over-the-top agents in action falls apart when their badassery is completely neutered by weak plotting…  and even new characters like Whiskey end up betraying out hearts. I found myself not really rooting for any of them, and wondering if they were actually wonderful in the first movie as I had recalled.\n\n## Action and Violence:\n\nThe first movie had some unflinching violence in the vein of Mathew Vaughn’s other movies like Kick-Ass. That shit was incredible. Seeing people diced up, double-tapped in the dome, and fought using a variety of sci-fi gadgets was like watching a stylistic and slightly sociopathic Bond movie.\n\nApart from the very first car chase scene in K2… the action was weak. There wasn’t a single shocking moment or worthwhile fight scene after the introduction. I honestly found myself bored. Was it the editing? Was it the uninteresting characters? Was it the seemingly unfocused “kitchen sink” approach they had to action? “Oh, let’s bring in an electrified whip! We’ll kill one person with it. Then we’ll bring in headshots that don’t kill people! OH, and how about robot dogs? And a robot barber?”\n\nThese things can be cool when applied in the right way, or if applied with the right amount of force and tact. Instead, we have characters throwing away their lives while singing songs, when they simply could have taken off their shoes.\n\nEven a rehash of the iconic bar-scene from K1 of “Manners maketh man” is brought back here… but it’s limp due to a forced catalyst for the whole thing, and the fact it demonstrates one of our characters “falls from grace”.\n\n## Rethinking Shit:\n\nI don’t usually get salty about a movie or fail to find value in a movie, but it feels like every single “mediocre” component of K2 is better expressed through K1 and other action rompers. I am struggling to imagine what about this movie is recommendable to my homies. I have no doubt some will be able to forgive the movie’s shortcomings and even enjoy it. But more me, all components failed to essentially hit the mark\n\nI’mma have to go watch Kingsmen 1 again to see if it might change my view of K2, or if, shittily, K2 may have changed my view of K1.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** No. Nah. Pass. There’s better action and better satire in most other action flicks. There’s better dialogue and more enjoyable characters. Fuck, just watch Kingsmen 1.\n\n**Recommended for non-fans of this genre?** No. Not for comedy, action, or critical thinkers. Maybe… just maybe, and this is a HUGE maybe…. But fans of Elton John might like it? I don’t know. He’s not exactly a knock-out in this.\n\n## Semi-arbitrary Score: 4.5/10"
        }
      ]
    },
    {
      "movieId": 8,
      "submissions": [
        {
          "title": "Pulpy Sci-Fi Noir that Breathes Life in Every Frame",
          "author": "e-vaughn",
          "markdown": "## Blade Runner’s Cyberpunky Impact\n\nRidley Scott’s 1982 Cult Hit Blade Runner is often credited with a great many introductions. It’s often described as the first mainstream cyberpunk aesthetic put to film. The countless films and media it has influenced on its stylistic grit and fashion alone are many discussions in and of themselves. While earlier short stories have touched upon the disparaging slums of the future and painted them as technological outcasts, none imparted a unified vision quite like Blade Runner.\n\n![I see you little Ryan](https://cdn.vox-cdn.com/uploads/chorus_asset/file/9376591/blade3.jpg)\n\nI love hard Sci-Fi, thought provoking films, and I cherish tension and tone. When I watched Blade Runner years back, I recall not enjoying it, much like the early critics and audiences that were exposed to the film in theaters in the early 80s. it wasn’t until much later that it received its Cult Status and respect. I haven’t gone back to explore the movie since feeling disappointed by it many moons back, but I was quite excited about Blade Runner 2049. Not only was it obvious that Gosling, Ford, and Vileenveie were a powerhouse team, but each and every trailer was art in motion.\n\n## A Sci-Fi Fever Dream\n\n15 minutes into the movie, I was already in awe. Blade Runner 2049 is, upon first impressions from this Sci-Fi lover, a masterpiece. Straight up, I couldn’t get over the craftsmenship of the film and the attention to detail in every single scene. The movie is RICH.\n\nRunning at nearly 3 hours long, there wasn’t a single time that it dragged for me. Not a single feeling of slow pace among the lengthy and prolonged scenes that built on tone and world more than plot advancement. There are abundant scenes that exist purely to craft the world, immerse you in a neon-caked LA cityscape, douse you with ambient and overpowering music, and make you *feel*.\n\n![Hey, crazy lighting they put in here right?](https://s3.drafthouse.com/images/made/blade_runner_2049_5_758_426_81_s_c1.jpg)\n\nThe film flows from plot development and following a detective lead, noir style, to building a romantic connection between Gosling and his consumer-bought AI girlfriend. As the plot progresses and the lead builds, the next scene adds to the lushness of the world. In a world of so much stimulation, it’s unclear who is human, and what it even means to be human.\n\nI found myself never really sure of the motivations behind each character, whether they were synthetic, self-aware, or the rules they played by. Each scene dropped more hints, more clues, and more strands to follow as to how the world worked. Beyond the already-complex main plot, there were enough side-stories to fill a miniseries that I would gladly watch. And gladly discuss at length.\n\nI love science fiction. I believe that movies have the ability to inspire their audience to achieve greater things and build a world that they may want to see. When it’s a dark sci-fi flick like Blade Runner, it doesn’t even much matter to me that it sours most displays of technological progress with sorrow and pain. Whether it’s a probable human pain or a synthetized and designed pain, the catharsis exists for us and it really should make us question.\n\nThe morality of the film is so grayscale that I would be hardpressed to make any claims about who is a villain and who is a hero. Leto’s character commands each moment on-screen and purposefully disturbs with his violent nonchalance… but his achievements fall under the umbrella of beneficence. There is enough interesting shit on screen and in-world in this film that it can provide hours of discussion for those that have a desire to carry on with heavy mental lifting.\n\nAnd that’s not even the main plot alone, which requires actual focus and attention to parse. Even in the end… our 4 person viewing party talked for over an hour throwing out clues and hints and moments that stood out as evidence to some bewildering theory we thought the movie was casting upon us.This is definitely a movie one should watch twice. And I would very much love to.\n\n## The Frames Themselves\n\nThis movie is pure eye-candy. If you haven’t peeped the [cyberpunk aesthetic](https://www.reddit.com/r/cyberpunk) before, and the concept of a grimy, striving future appeals to you, you might find this movie to be art in motion. It’s gorgeous in every scene. The shots of hovercars cruising through the city coast you through a woozy simulation of actual flight.![Shit I broke the wall, run!](https://bloximages.newyork1.vip.townnews.com/omaha.com/content/tncms/assets/v3/editorial/f/75/f75bfafa-a02c-5237-8cf5-9168f1eaf48f/59d6ecd4b9001.image.jpg)\n\nThe combat scenes and action feels weighty, brutal, and rude in their disregard for humanity. Whose life has any meaning in this savage world? The replicants are portrayed as relatably human and bizarre, weird, and robotic. Human yet not ever quite human. With this portrayl comes a beauty in the acting. The pain on display. And the movie makes us wallow in it. In every death (and my god, some of these deaths are insanely visceral…. One of the most tense climaxes I’ve ever seen is on display here). In every gutwrenching realization or recognition of mistake, or foolishness that our characters reveal to themselves, there feels like a nuance and contemplation on display that these actors masterfully depict.\n\nPerhaps it’s because of the artistic merit, the tone, the lushness of the world, or the acting itself, but I found myself so much more sentimental of plot development than I do in most movies. The plot isn’t a doomsday scenario, or immediately threatening to this world, but it maintains a sense of weight. And it constantly builds on its sci-fi world by layering scene after scene of thought provoking content.\n\n![Uuugh, lets leave this room, this is weird](https://cdn.vox-cdn.com/uploads/chorus_asset/file/9376599/blade2.png)\n\nI’ve long held the opinion that sci-fi has the ability to create intrigue merely through images and world building. Just seeing future tech or a snippet of how society works gets my gears turning and trying to piece together the way this world works. This director’s slower pace in his films tends to lend itself the best to sci-fi and movies with lush world. To movies where the environment is a character itself. Where moments in Villeneuve’s Sicario tense but slow, Blade Runner’s genre crafted much more value in each slow moment. Even his latest effort, Arrival, while sci-fi, isn’t world-building or propelling the lore of the world in most scenes that the aliens aren’t on screen or being analyzed. Blade Runner, however, is generating detail every single second it’s depicting the world because it is so far into the future and so lush ins depictions of the world.\n\nThis is the exact reason that while others have claimed this movie felt slow, I found it constantly gripping. Not only is it atmospheric throughout, it’s showing characters or environments that are always interesting to analyze. I had similar experiences while watching Westworld.\n\n##  What Makes a Masterpiece?\n\nWhat a lofty question, right? How can one determine quality in a primarily subjective medium? More ways than one… that’s for sure. I look back on this film and ask myself “What could it have done better?” I don’t feel that adding gratuitous nudity, gore, or different dialogue would have aided the core of the film. It stands to reason that there isn’t anything this film needed to amplify the feelings and emotions it already evoked, then maybe it’s approaching perfection? Could it have been shorter? Not for me. Could it have had more plot development? Better acting? More of the “good stuff” that I’ve already called out? I mean, sure, I guess so. But I didn’t find myself yearning for those things, because it so effectively satiated me with its runtime and visual display.\n\n![Jared Leto, you beautiful crazy man](https://i0.wp.com/media2.slashfilm.com/slashfilm/wp/wp-content/images/Blade-Runner-2049-trailer-breakdown-6-700x293.jpg)\n\nI do believe that it’s hard to identify a masterpiece from a single viewing. I don’t even know if calling something so lofty serves it much more than simply explaining what makes it great. But you know what? This movie was so exceptional and hit so smoothly on so many cylinders that I think it is damn near perfect for what it was trying to be. So well realized in its own goals that it feels damn near flawless.\n\nAnd now we’re left with a discourse, and continued discussion of the movie. A discussion that blossoms the values of the film even more. We’re left with a desire to share in this experience. A lingering desire to let this film inspire other filmmakers or inspire the general public to contemplate, appreciate, and THINK. I’m happy leaving that here.\n\n## [TL;DR]\n\nIn the face of almost unobtainable expectations due to Blade Runner 2049 being a sequel to a beloved cult classic, it manages to succeed in being a better movie than Blade Runner in almost every way. It’s well-acted, it’s visually stunning, it’s tense and atmospheric, it’s thought-provoking, it’s intense, and has plenty of scenes in a film I’ve never seen. It makes me wonder and dream. It’s a joy to experience. For anyone that has the energy to engage and analyze, ponder and try to piece together this sci-fi film noir, I implore you peep this movie.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Absolutely. Any fan of sci-fi, dramas, thrillers, mysteries, noir, excellent film-making, or thought-provoking spectacle… you should see this movie. If you’ve got the attention and focus to process nearly 3 hours of complex science fiction, love discussing cinema, or want to be moved, fucking peep this jam.\n\n**Recommended for non-fans of this genre?** No. I don’t believe that every exceptional film is recommendable to everyone. Some individuals merely don’t have the attention to sit through slower scenes that run up to nearly 3 hours. Some aren’t going to enjoy the mental gymnastics required to understand the plot. Some won’t find the aesthetics or the eardrum smashing music to add to the experience. Some folks want every single movie to be a casual affair. One they can watch to veg-out. This isn’t that movie. I almost think it would be disrespectful to watch this movie with a half-asleep candor. As such this feels like an exquisite film that simply isn’t for all movie audiences…. And that’s totally ok.\n\n## Semi-arbitrary Score: 9.5/10"
        },
        {
          "title": "The Perfect Sequel to a Cult Classic",
          "author": "Jacob",
          "markdown": "There were so many opportunities that Director Denis Villeneuve had to cash in on the not super popular but very well respected Blade Runner of 1982.  *But he didn’t, and I so respect him for it.*  This new Blade Runner is very much its own thing, channeling the same things that made the first Blade Runner so great but adding new contemporary ideas that make for an engrossing, exciting, and thought provoking experience.  While it is quite a long journey with many lengthy mood setting shots, it succeeds in building a brutal yet cohesive sci-fi world, that will leave you with many questions about the future and humanity.\n\n![Ryan Gosling being badass as Agent K](https://i.kinja-img.com/gawker-media/image/upload/s--PqN-CkTw--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/vyrnkanrhbpcbdveomz6.jpg)\n\nFor the average movie goer, this film has parts that are sure to confuse.  The plot is dense, as the story is a continuation of the original, which presented a lot of opportunities for reflection and built a narrative around some philosophically ambiguous material.  What makes us human? What about human life is intrinsically valuable?  Questions that in my opinion do not have answers that the majority of people can agree upon… *but boy oh boy does almost everyone, from dogmatists to logicians, have something to say about it.*  At least if you give them the opportunity.\n\nThis brings us to the general plot of the movie which is overall very approachable.  In the future there are synthetic individuals, and they were once made illegal but are not any more.  Blade Runners are the people within law enforcement that are sent out to kill these synthetics and in this particular story we follow Agent K, a young Blade Runner played by Ryan Gosling.  K is sent to uncover the secrets of a potentially remarkable synthetic and bring them to justice.  A simple plot that quickly spirals out of control as the mysteries of synthetic existence and the connections to the previous movie reveal themselves.\n\nThere are some great twists and poignant moments that are really well scripted, and make for a story that really keeps the audience invested, even to the point where I legitimately wanted to know more about the world I was witnessing.  **Like How the fuck synthetic life works?** And why do these synthetics do what humanity wants? Or do they actually not? And who controls what in this crazy brutal sci-fi world of 2049.\n\nAll of these questions felt so appropriate, not misplaced due to sloppy writing or world building.  Questions that produce intrigue not confusion. It’s as though you as the audience member have been *gifted* a chance to witness this fantasy reality and be privy to it’s secrets.  Secrets that are potentially game changing in the world of synthetic creatures and thus to the future that is portrayed.\n\n![Late Blade Runner concept art](https://www.heyuguys.com/images/2016/10/Blade-Runner-2.jpg)\n\nAn impressive feature that this movie bears is an extremely cohesive storyline when put into context of the original film, yet not a storyline that requires prior knowledge of the events leading up to 2049.  If you have seen the original Blade Runner you will feel very comfortable with the Cinematography and the Soundtrack. The producers were able to score the masterful Roger Deacons (who was the Director of Photography for the Original film) as well as Hans Zimmer and Benjamin Wallfisch to compose the music. Hans Zimmer who of course cannot keep his dick out of contemporary sci-fi action films while never ceasing to bring an incredible atmosphere, tension and emotional resonance with his music.  Alongside him is Benjamin Wallfisch who seems to be composing almost every musical score for the movies in this blog.\n\nThe result is an incredibly colorful and vivid portrayal of a sci-fi future, that creates a remarkable cyberpunk aesthetic while building on the themes and emotions of the original film.  The frames showcase the setting in an extremely unique way, making the characters seem miniscule in a world being utilized in the most efficient way possible, an engineered machine.  Buildings, structures, monuments, and even refuse are massive while juxtaposed to the pygmy living spaces and transports that carry people.\n\nCombined with a brooding and enveloping soundscape that follows the characters and hangs in the air to give this future an uncomfortable feeling, the cinematics and overall presentation of this story is really really masterful.![The setting is beautiful yet aesthetically brutal](https://i.pinimg.com/originals/8b/4a/f2/8b4af2070c8debe29341531c391b90fc.jpg)\n\nAs the audience looks down on the world while they are transported from monolithic structure to overcrowded or cramped living space, we get the feeling that existence has progressed on a remarkable yet not too farfetched path.  To say the least the visuals and sound did a great job of telling a story as much as the actors and script writers themselves.\n\nThese strengths really carry the movie as a whole and make up for the fact that while the story was never boring and did drive my interest, it was pretty run of the mill as far as general plot and story arch.  This is not to say I felt disappointed by the story, but there was definitely room for innovation.  The original made such an impact by of telling a story that was not only thought provoking but super creative for its time. This sequel was a clear continuation of those concepts without too much innovation, instead it brought a more masterful execution.\n\nThis was super close to being a true masterpiece. It had all the potential, all the right people and was executed almost perfectly.  Comparing this to my favorite sci-fi movie of the past year, Arrival (also directed by Villeneuve), it has so much more moving visual and aesthetic moments, as well as pure brutal sci-fi concepts.  But the story in Arrival was so layered and rich, and even *Blade Runner Uno* stood up a little better in the story department.  Despite that, this movie was amazing and I think every sci-fi fan should see this and internalize its major successes while pondering the immense amount of great plot points it left untouched.\n\n"
        },
        {
          "title": "Megan Reviews Blade Runner",
          "author": "Megan",
          "markdown": "When I walked into the theater to see Blade Runner 2049, I was going in blind. Well, at least with heavily foggy vision. I have never seen the original Blade Runner, but my friend gave me a quick (somewhat muddled) plot summary on the car ride over. Regardless of my lack of background knowledge, the film proved engaging, snaking my attention from the first scene forward.\n\n![Agent K doesn't like fast women, oh no](https://pixel.nymag.com/imgs/daily/vulture/2017/10/11/11-bladerunner-2049-gosling-davis.w710.h473.2x.jpg)\n\nThe plot follows Agent K, a human-like manufactured replicant, on his quest to track down rogue replicants of prior generations. After the discovery of a pregnant replicant skeleton, K sets out to find the human/replicant offspring. If found, the child would be the first of its kind and proof that human/replicant reproduction is possible. Once word of the potential child reaches the Wallace Corporation, the creator of the replicant species, a deadly race ensues. While K seeks to rescue the offspring and discover its origins, Wallace sets out to eliminate the threat such a child could bring to his company.\n\nThe twists and turns unraveling throughout the film gripped my attention. I couldn't help but pitch my theories to my boyfriend's ear while we watched. My predictions aside, I must say I was pleasantly surprised with the resolution.\n\nComplementing the action and suspense, the sci-fi elements illuminated the screen. I felt like a kid on Christmas, dazzled by the various futuristic technology. One that stood out was K's AI companion, Joi. Not only could she be used to complete basic household tasks (a la Amazon's Alexa), ![joi and K](https://cdn.traileraddict.com/content/screencap/120683.jpg)\n\nbut she also provided an emotional relationship (much like Spike Jonze's Her). I couldn't help but wonder if someday similar AI might provide support and connection to people who may otherwise not have the opportunity to find a human companion.\n\nAnother striking piece of technology was used by Wallace, the physically blind antagonist. He is constantly accompanied by small flying camera bots that seemingly capture live images and instantaneously transmit them to his brain. The real world application of such a technology could eliminate a life altering barrier for millions.\n\nSuch innovations always intrigue as they hint at the potential tools we just might have the chance to experience.\n\nWhile I had to whisper clarifying questions here and there to keep up, I found the film accessible and enjoyable overall for someone new to the franchise.\n\n**8/10**"
        }
      ]
    },
    {
      "movieId": 9,
      "submissions": [
        {
          "title": "Sweet and Contemplative Poly Romance",
          "author": "e-vaughn",
          "markdown": "## A Display of Two Cultures\n\n![Superheros.... of Love!](https://media.aintitcool.com/media/uploads/2017/copernicus/professor-marston-and-the-wonder-women.jpg)\n\nComing hot off the popularity and success of Wonder Woman, Dr. Marston and the Wonder Women is a far cry away from the polish, color, and lightness of a superhero film. In fact, this much more adult film tackles not only the challenges of romance, psychology, and sexual partnership in complex and NOT action-packed ways, it also blends two relatively under-represented subcultures on the big screen. \n\nFor starters, it’s rare to see positive depictions of ethical and transparent non-monogamy onscreen, and much less common to see an entire film dedicated to discussing those particular themes and lifestyles. The film also gives voice and attempts to normalize BDSM and Kink communities and bring about an appreciation of the individuals engaging with it and demystifying the behaviors and psyches.\n\nAs it stands, Dr. M and his Wonder Women compile a film with an eye towards encouraging tolerance and perhaps even inspiring growth. At the very, very least, it demonstrates a pretty respectable blending of these subcultures that left me with more interest and appreciation than I had prior to seeing the movie.\n\nDuring the course of the picture, there wasn’t a single moment that felt disrespectful or abrasive in a way that might paint these cultures in an overtly negative light. As I watched the biopic, I found myself both titillated and curious about how these onscreen depictions might play out. I walked out of the cinema with a warmer heart and a higher appreciation for the cultures the film so gracefully handled.\n\n## Simple Yet Genuine Storytelling\n\nSo while the cultural depictions might be respectful, the film wouldn’t really be worthwhile unless it managed to be an impacting piece of cinema. Thankfully, the movie is cute and full of giggle-inducing moments. As far as bioics go, I can’t think of another that’s been as romantically infused like this one, and had the relationships at a focused level beyond the life of our subject. Having 3 subjects as the focus, and the interplay between them paid off in how the story unfolds.\n\n![I can love all dees bitches (☞ﾟ∀ﾟ)☞](https://static.rogerebert.com/uploads/review/primary_image/reviews/professor-marston-and-the-wonder-women-2017/hero_Professor-Marston-2017.jpg)\n\nWhile there isn’t much to say about the cinematography, the film is competently put together. Biopics tend to require a bit more grace in terms of pacing, often feeling like large gaps in time are covered quickly and without segue. This occurs once or twice here, but it’s an easy grace to give a biopic. The film lingers on the romantic scenes and attempts to build audience rapport with the sexiness and connectivity of our characters, and honestly, it works pretty well. While dealing with group sex or BDSM, the film maintains a tone of caring and compassion, as opposed to exploitation. Capturing that tone felt impressive, and mature.\n\nMuch of these moments are powered by the impressive acting by our three leads. Emotions are highly charged throughout the picture, and the acting is captivating. The climactic scene with our three leads nearly made me tear up in how it was handled. Looking left and right to my adjacent cinema-partners, tears were flowing freely.\n\nThese moments came through in a warming way. Everything felt relatively “feel good”, and while there was some cognitive provocation towards the societal complexities for our romantic heroes that may have tainted vibes, the movie aims for inspiration rather than a colder potential reality.\n\n![Sometimes you just wanna dress like a warrior princess](https://nerdist.com/wp-content/uploads/2017/10/terry-moore-wonder-women-970.jpg)\n\nOne of the most surprising components to this was the humor embedded in the movie. While romcoms are usually good for a chuckle or two, I rarely frame them as serious comedy contenders. Here though, I laughed on par with my favorite rom-coms that I’ve seen. Mostly giggles and guffaws, and potentially influenced by the theater-going audience I watched it with, but man, some of the delivery of these lines was magnificent.\n\n## TL;DR\n\nProviding laughs, a couple of juicy mind-grapes, and sensory stimulation of various flavors… the movie worked pretty damn well. More than anything, I appreciate the themes, respect towards the cultures and potential to inspire that this film attempts to display. Without strong performances and a decent script, these cultural outreaches wouldn’t work, so I’m also thankful that the film itself was adorable, sexy, exploratory, maturely themed, and well-acted. On top of that, it’s cute, warm, and jazzed up with enough romance that it probably works best to watch it when holding the hands of two loving partners at the same time.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?**  Yes. For fans of romance, or fans of biopics, this is a pretty easy to recommend romantic film. However, for more conservatively leaning individuals, there may be some controversy on-screen that should provide thought-provoking meat to chew, but could just as easily offend… especially for viewers that happen to hold an immovable framing around the values of monogamy.\n\n**Recommended for non-fans of this genre?** No… not really. Well… maybe. Hmm. This is a movie that has the potential to unlock some new lifestyle conceptions for people that may have never once pondered the plausibility of ethical non-monogamy. It has a normalization factor around kink and love-making, and submission, and psychology. It’s also maybe, not immediately accessible, or may require someone to have an already open mind to enjoy it. Maybe. Maybe it won’t convert folks who aren’t open to these thoughts already. If they aren’t, the humor, sexiness, and wonderfully acted interactions may not hit home.\n\n## Semi-arbitrary Score: 8.5/10"
        }
      ]
    },
    {
      "movieId": 10,
      "submissions": [
        {
          "title": "A Sub-Par Slasher Film Where the Name is Literally the Best Part About it",
          "author": "e-vaughn",
          "markdown": "## A Strong Concept Wasted\n\nIt’s not very often that I walk out of a movie thinking “Hmm, I hope they remake that… immediately, and better.” Such is the case for some flicks that have such excellent and lush premises combined with lackluster execution. Happy Death Day is a prime example of letting a concept go to waste. It’s derivative, it fails to add anything to the “Groundhog’s Day” repeated day motif, and it’s plain old shitty as a horror movie.\n\n![That guys face is pretty silly](https://www.destructoid.com//ul/467264-1100x620_happy-death-day.jpg)\n\nI’m not going to lie. I saw the trailer for Happy Death Day and thought immediately that it looked like a lot of fun and had a bunch of potential. This is likely because the Groundhog’s Day genre (yes, I’m going to go ahead and dub this a genre as it’s the first film I am aware of that uses this narrative structure) pretty much comes primed with fun moments. You know you’ll be seeing the main character confused. You know you’ll probably see the main character become ridiculously skilled at trivial things. You know you’ll see the same scenes played out multiple times in slightly different ways. You suspect, and hope, that there will be some sort of revelation that hits upon why the hell our main character was cursed to repeated the same day, day after day after day. These are the structural expectations inherent in this type of film, and it almost always works!\n\n![Awww, you been dying a lil?](https://dailyreview.com.au/wp-content/uploads/2017/10/Happy-Death-Day-04.jpg)\n\n **Groundhog’s Day is a fun watch and has aged incredibly well.**\n\nDay After Tomorrow with Tom Cruise is a blast! The action sequences, the experimentation, and the charisma of our lead as he exploits his powers are mucho fun to watch.\n\nSource Code is a great movie with a fun mystery that plays at this genre a bit too.\n\nAnd Naked, a movie that has 0% on RT, that I recently reviewed here on Slick Flicks (and gave it a warm review), even played this genre just right with a focus on slapstick comedy. This movie had more to say about the Groundhog’s Day genre and romance and learnings about life than Happy Death Day.\n\n## A Flimsy Horror Movie\n\nAs a horror cineaphile, I can stomach when horror movies are hindered by a PG-13 rating. I mean, I totally get it, sometimes. Some movies don’t need extreme gore, or adult themes, or sexuality, or really any of the visceral elements that solid horror films use as tropes and often subvert. Some of the greatest scares come from PG-13 capers (Ring, you beast you). But… a SLASHER film that PG-13? Honestly, I should have known. What’s a slasher film without a visercal payoff? What’s a slasher film that is afraid to show its teeth? What’s a wonderful concept where our main protagonist can survive countless horrific deaths, yet the film has no guts to show any of that bloodshed? I’ll tell ya what it is: Unrewarding. Like a ruined climax, this movie wanders from scene to scene and repeated death to repeated death while our main character slowly (and I really do mean slowly) about her powers. Gah, it’s borderline frustrating, not to mention boring.\n\n## Components of a Viewing\n\nI don’t have all that much positive shit to say about this flick. The filming techniques are not very inventive, or inspiring. The film more or less looked like it was filmed on an iPhone. The soundtrack is weak, and peppered with typical pop and “empowerment” balladry when appropriate, and an action score when there’s intensity. It’s not great stuff.\n\nThe side-role sorority ladies are pretty much jerks, and don’t add anything to the story other than reminding you that some movies still revel in their insensitivity (a particular joke targeting the disabled rang quite offensive to my viewing partner, for good reason). In fact, majority of our characters range from vile to shallow, including our protagonist. The second best part of the movie is the acting of our leading lady, which covers a decently wide variety of ranges… and I think she could actually have a decent performance with a wittier script and attention to horror detail.\n\nWith the deaths being boring, the plotting being mundane, and a slow-moving vehicle that manages to make an exciting concept seem phoned-in, what else are we left with?\n\n## A Cumulative Sum – and a Waste of Time\n\n![(╯°□°）╯︵ ┻━┻](https://assets1.ignimgs.com/thumbs/userUploaded/2017/10/5/happydeath-1507226399083_270h.jpg)\n\nHere’s where I stop being mindful of spoilers, so, be warned. I also do away with some of my civility in how I review this bad boi, so, there’s also that.\n\nI wasn’t kidding about the waste of concept. On the second day of her experience (the first rewind), she immediately recalls where the Tylenol is with crystal precision. “Whoa!”, I think to myself, “she’s a quick learner. Alright alright, this movie’s gonna pace things quickly. I like that. It recognizes that this genre’s been done before so it’s going to play at the most important bits!” Except NO. I was thrown a fucking curveball here! She’s smart for ONLY this very beginning, Tylenol recalling scene (and she didn’t even look where the dude grabbed the Tylenol on day 1, what the fuck?!), followed by literally a FULL day of déjà vu and playing connect-the-dots with a facial expression that looks like she’s a Neanderthal confronted with a toothbrush for the first time. Like, listen, homegurl, didn’t you pay attention to 1 of the 15 events we get to see, like 10 times? This 2nd’ day had me raising my hands aghast, questioning the writing of the film very quickly.\n\nThe tension in the horror scenes, oh gosh. Well, it tries. No lie, there is some tension in the first scene or two, and maybe a single successful jump scare, but then it’s flimsy as fuck. The villain’s costume is laughably bad and schlocky. Not intimidating in the slightest.\n\nAnd, while the movie bludgeons the audience with hints about what might get her to resolve her issue, it’s never really all that clear about what she actually has to do to get the day to stop. At first it seems like all she has to do is survive the night, but then fuck, she’s SO bad at actually surviving it’s laughable. We don’t get any scenes like in Groundhog’s Day or Naked where our hero has memorized a trial-and-error response style and perfected it. No, our character is a tad too lazy and unattentive for that. She can’t even muster the courage to ask her new boy-toy, Carter, to simply chill with her for the night… even AFTER she somehow convinces him that she’s living this day over and over again. Goddamn it. This movie quickly became frustrating.\n\nAnd then, she’s kind of mean throughout the whole experience… until she’s suddenly not. It’s like she says “I guess I had to live the same day over and over enough to really find out about who I am.” Oh really? A bit of blunt mindfulness and forced intention did that for you? Ok. She chats with her dad and has a blasé emotional scene where she tries to connect with him, and then she manages to figure out who her killer is…. And the payoff is so absent.\n\n![Boop... ( ˘ ³˘)♥](https://media3.giphy.com/media/3oKIPp0Dq3h8I8J5MQ/giphy.gif)\n\nThere isn’t any particularly captivating motivation for the villain. There isn’t any hint or notion of why this protagonist is given the chance for redemption over and over again, by whatever supernatural deity has given her this chance. I’m fine with the Groundhog’s Day magic not being explained, but there should be something the movie says about life, reflection on one’s routines, how to empathize with others, how to use each seemingly similar day as a new lesson, or, fuck, something! The movie leaves us with crumbs, and I find myself yearning to re-watch Naked just so I can actually get a couple of nuggets of philosophy. Yes. Naked. A movie with 0% on RT. That movie was much better written in every way. Fuck, it even had a better scene of gore! How is that even possible?\n\nCan we just remake this movie with a hard-R, Final Destination level of creativity of gore and deaths, and get Marlon Waynes to play our female protagonist? Please. Hollywood?\n\n## TL;DR\n\nThis movie doesn’t have much going for it. It’s got a great title! Happy Death Day. Look at it! It’s like Happy Birthday, but instead of being born every day, she dies every day. And is also kind of reborn. Hmm. Well, is there a movie named Happy Birth Day? They could have called this movie Happy Re-Birth Day and it would have made sense. I’d watch that.\n\nOther than the name, and the decent range yet kinda vile performance of our lead, the movie basically sucked. I feel harsh saying that, but it was bad. The villain was weak. The costume design was trash. The soundtrack blew. The lack of gore and tension felt like a cop-out. The use of Groundhog’s Day genre structure felt derivative and borderline lazy. This movie was frustrating. Don’t, uh, don’t watch it.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?**  No. If you’re a horror fan, don’t watch this. If you’re a fan of comedy, avoid this. If you like sharply written wit and compelling character motivations, look elsewhere. If you like Groundhog’s Day genre flicks, let’s get together to do a horror version of it that doesn’t feel like a waste of time. If you like really bad, B-movies that ham up their badness, then this isn’t even for you either cuz it’s just bland, not laughable. If you like watching movies based on titles alone regardless of their quality, then this movie is just for you.\n\n**Recommended for non-fans of this genre?** Did you read my previous recommendations? It’s not really recommendable to anyone. I wouldn’t even recommend it to folks who simply haven’t seen any single Groundhog’s Day genre movie because, frankly, just watch any number of the better version of it. I hope that Happy Death Day gets remade into something more palatable.\n\n## Semi-arbitrary Score: 4.3/10"
        }
      ]
    },
    {
      "movieId": 11,
      "submissions": [
        {
          "title": "Marvel’s Most Fun and Digestible Popcorn Flick",
          "author": "e-vaughn",
          "markdown": "## Superhero Fatigue\n\nIf you like comic or Superhero movies, you’re living in the best timeline right now. One could say that we’re consistently blessed with polished cinematic filaments yearly, thanks to Marvel and occasionally DC. There are so many “good” superhero movies now, that it’s hard to differentiate the good from the great from the “oh my goodness you HAVE to see this”.\n\nSome of the best reviewed ones, like Cap Am’s Civil War or Guardians of the Galaxy 2, had me in a lukewarm state. It seems like it’s taking more and more to differentiate the Marvel movies, and while the Deadpool, Dr. Strange, and the upcoming Black Panther movies having fancy all peaked, I just ain’t getting all that hyped about them. Consistently good means consistently unsurprising, I suppose.\n\n## Polished Fun\n\nWhile I liked Thor 1 for its humor and blend of “whacky space God dealing with modern life”, Thor 2 was incredibly forgettable and bland to me. Thor 3 proved to reclaim the mantle and blend so many different flavors into one giant, delicious, graveyard drink.\n\nThe comedy is fantastic. Thor’s silliness and childlike, puffy-chest delivery of his lines work so well for his demi-God posturing. He lights up the screen and his combat is framed in mythical, devastatingly powerful ways.\n\n![Thor: meet short haired Thor](https://cdn.images.express.co.uk/img/dynamic/36/590x/thor-ragnarok-chris-hemsworth-854499.jpg)\n\nThe visuals of the film are colorful and lush. The sci-fi cityscapes and diverse fashion on screen provide ample estimations about the world the characters fell into while remaining fun and lively. Thor + Hulk on screen is a treat that feels like a bromance superhero plotline, and Jeff Goldblum’s sinister glam-role is a treat, cuz, well, Jeff Goldblum is the man.\n\nThe fashion is top notch. I love the blend of fantasy armor that transitions towards sci-fi cacophony. The visual mix-and-match is wild, yet it works to express how much of a hodgepodge the world feels like. All of these components fit seamlessly together.\n\nThe pace is great, and treks along quickly without any jarring tie ins.\n\nIn fact, the whole of its individually polished parts all create a rather fun, light, action vehicle.\n\n## Deeper Messages and Misstep\n\nI watched some analyses (thanks, Wisecrack) about how there’s a deeper meaning to the film, with each side character wholly focused on battling elements of their past. It seems that each side-character and even main-characters are wrestling with who they “were” and they are to become, yet apart from a very blasé plotline targeting how “winners re-write” history, these are interestingly woven together but don’t go to say much about how our past affects our present. This isn’t a misstep as far as writing goes, but it is mostly a recognition of “attempted” thematic complexity. It’s not deep, and that’s ok.\n\nThere are some actual, mild missteps that I took note of as I watched. Number 1 being the opposite of a Deus Ex Machina that instead of an all-powerful thing that appears out of nowhere to find a resolution to the hero’s problems, we get an all-powerful being that appears out of nowhere to cause problems.![Whoooaa, an 8 point evil Norse beeeatch](https://img.cinemablend.com/quill/a/2/a/0/b/9/a2a0b9abb89991c701bd1d03fa6cb864f015f310.jpg)\n\nPretty much with no foreshadowing or purpose, a problem appears to drive our characters. This might be a much more common thing that I notice, but for some reason it felt so blatant in this film.\n\nThe second misstep is the rather weak villain of the movie. She’s weak because of the aforementioned sudden appearance, but also because she doesn’t do much to embody or characterize her position as the God of Death. Her motives can be broken down to A: She kills things because she’s the God of Death, and B: She has ambitions to conquer… because her papa showed her how that feels. Beyond being a destructive force, there isn’t much to her. Her sisterhood to Thor has no connectivity either, and she may as well have been any other hero. There is no dialogue about Odin’s decision making, his cowardice at hiding the true “past”, or what might happen for the future.\n\nSubjectively, I found her design to be a little weak as well. Her acting didn’t mesh well with the attempts at levity, while also attempting to evoke menace and power. She just felt flat.\n\nUltimately, these minor quibbles feel pretty damn minor. They didn’t impact my enjoyment of the film all that much, and the film was, for the most part, just a lot of fun.\n\n## TL;DR\n\n I laughed, a lot. I gawked at the action and impact of the swings. I marveled at the cinematography, visuals, and costume design. I loved the lavish landscapes. I found so many of the characters to be beyond endearing. I loved Mr. Goldblum. I pretty much liked all of it, save for some weak writing here and there, but that didn’t harm the movie. I don’t know if it deserves too much praise, because I found myself not really thinking about it for much longer after I saw it, but I had a blast in the theater with it.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Yes, most definitely. Superhero genre fans, action genre fans, comedy fans, all of y’all will appreciate it.\n\n**Recommended for non-fans of this genre?** I think if there’s any Superhero movie that might convey the “essence” of modern day Superhero movies while feeling like a comic book more than any, this is it. There is a huge ensemble of characters. There is hilarious dialogue, and there is incredible action. It’s got enough that non-fans might love it too.\n\n## Semi-arbitrary Score: 8.8/10"
        },
        {
          "title": "Megan Reviews Thor: Ragnarok",
          "author": "Megan",
          "markdown": "I have never been one for superhero movies. Growing up I found them cheesy and childish. The reconstituted formula of bad guy comes to destroy the world, good guy superhero comes to save the world and charm a beautiful woman in the process seemed stale even in my youth. I had pretty much written them off. Any exception I made to see one just tended to reinforce my distaste. Within the last few years, however, a few superhero movies seemed to revive the genre, lacing the action with newfound wit and playful aesthetics. Guardians of the Galaxy and Deadpool had me laughing both with and at the protagonists.![Chris Hemsworth is looking a little... not like Chris Hemsworth](https://images.moviepilot.com/image/upload/c_fill,h_470,q_auto:good,w_620/zaqhkjbcprbgrrvai8sm.jpg)\n\nThis comedic spin made the heroes more relatable and less formulaic. The release of Wonder Woman this past summer solidified my optimism in superhero films. Not only did it have its fair share of comedy, it portrayed a strong, compassionate, charming complex woman and is, in my opinion, one of the most important and far-reaching films for the feminist movement thus far.\n\nAnd so, with my past experiences in mind, I hesitated in my desire to see Thor. I feared for its potential to embody a played-out archetype, while reserving hope that it could contend with the aforementioned titles I revere. After 2 hours and 10 minutes of candy-colored charm, Thor: Ragnorak joined the ranks of enjoyable superhero films in my book. (Even not having seen the first two I'm the franchise!) \n\nFirst off, this movie was beautiful! The visuals and camera angles were creative and impressive. A particular battle inside a teleportation vortex was stunning. The sharp rhythm of camera angles during fight scenes were so satisfying. At one point the camera quickly zooms to the point of view of Thor's flying hammer, achieving a video game-like rush. Each movement is choreographed perfectly to the soundtrack. The result is a flow that is perfectly paced and consistent throughout the movie.\n\nThe acting and comedic wit are on point, similar in tone to Guardians of the Galaxy, but arguably funnier.![Thor has many silly self referencial moments](https://media.giphy.com/media/1uQg9WE9JLuX6/source.gif)\n\nEach new character, with the exception of Thor's villanous sister, is funny in their own right. As the lead, Chris Hemsworth effortlessly charms with his optimistic and earnest nature. A rock like monster named Krog (played by director Taika Waititi) deserves credit for the most LOL moments I had in the theater. He meets Thor in a gladiator style dungeon. He quickly establishes himself as the Eeyore to Thor's Winnie the Pooh. The Grandmaster of the gladiator planet is played by Jeff Goldblum who delivers another outstanding performance with another unique style of humor- pure, ruthless, narcissism. Later, the dynamic between Thor and the Hulk feels both frustrating and sentimental - a brotherhood Thor never found in Loki, his prodigal sibling. Finally, Valkyrie, a female scrapper with a different agenda, delivers biting dialogue that serves the audience a fifth flavor of quality humor.\n\nAs wholesome as the jokes were, the variety of quality characters were more than enough for me to want to re-watch. If you are looking for a truly fun cinematic experience that appeals to a wide audience, I would highly recommend Thor. In a time when we feel so divided, it is heartening to watch a movie we can all enjoy."
        },
        {
          "title": "Pure Comic Book Fantasy",
          "author": "Jacob",
          "markdown": "So I must confess that I am one of those people that really enjoyed comic books as a child.  I would make a beeline to the newsstand at the supermarket and read comics while my mom would shop for groceries every single week.  It was one of my main methods of realizing my power fantasies as a young person and it was blissful!  A lot of what has been coming out of Marvel Studios has been giving me a lot of those same feelings and Thor: Ragnarok is no exception, with the action between and amongst superheroes and villains as well as conflicts that span multiple movies and set piece battle.  In short I feel it’s never been a better time to be a fanboy (or fangirl) of fantasy digest!\n\n##  Action and Narrative\n\n![One of these Avengers is not like the others](https://bloximages.newyork1.vip.townnews.com/southbendtribune.com/content/tncms/assets/v3/editorial/d/3a/d3a7986f-7635-5f52-aca5-f7efc66e1c3d/59fbfb5c00d09.image.jpg)\n\nWhen I think back to the feelings I got from reading comics I can distinctly remember the images I got from fantasy violence.  There was so much catharsis that I felt from simply pretending to be a creature of pure will and destiny.  Thor’s newest film has this nailed down perfectly.  Thor’s character has the brashness of a superhero of ultimate willpower and power to be generally badass.  Yet his conflicts seem totally worthy of requiring a Thunder God to save Asgard from the evils that have beset it.\n\nThis is a pretty lighthearted film at it’s core.  The characters crack jokes constantly and the tone of the narrative is over the top self referential.  With characters often overstating their importance as super creatures and making grandiose generalizations about their powers and relations to one another.  Which is not necessarily a bad thing in my opinion.  The original comic's thrived off of this type of stuff and it reinforced our thoughts about how cool and powerful our heros were.  But sometimes it feels a little bit kitschy which is something that some people might either need to reconcile with or check their tastes at the door before embarking on the ultimate quest of goofy badassery.\n\n## Superhero storytelling\n\nSo the story here one is nice and easy.  Thor is out to stop an apocalyptic event from taking over and destroying his beloved hometown of Asgard, an event know as Ragnarok.  All of which flows nicely into the norse mythological timeline if your jimmies get rustled by that sort of thing.  But essentially Odin dies and a new character emerges out of nowhere to bring pain and suffering to all asgardians including Thor and Loki.  The Norse God brothers find themselves banished and must find a way to get back to Asgard and defeat their new rival: Hela.\n\n![Hela: Stopper of magic hammers](https://nerdist.com/wp-content/uploads/2017/10/Thor-Ragnarok-Hela.jpg)\n\nHela is an interesting lass as she is related to the royal brothers and to Asgard in a very poignant way.  It seems the that Asgard was not always a place of peace and happiness and Odin was not always a God king with the most benevolent intentions.  As such, Odin’s passing seems to bring about a reckoning that requires a small portion of the Avengers to bring the new foe to justice.\n\nHela is an interesting lass as she is related to the royal brothers and to Asgard in a very poignant way.  It seems the that Asgard was not always a place of peace and happiness and Odin was not always a God king with the most benevolent intentions.  As such, Odin’s passing seems to bring about a reckoning that requires a small portion of the Avengers to bring the new foe to justice.\n\nAnd the action I think is a big part of the storytelling here.![I felt like this scene was straight out of a comic](https://cdn.flickeringmyth.com/wp-content/uploads/2017/07/Thor-promo-art-21394-2-600x450.jpg)\n\nWhat all of this conflict really wants to showcase is what kind of power these characters can deal out.  Who is the most powerful demigod in the pool of super things.  Much like in the way dragonball Z and other Manga use violence and power, the audience can get a sense of how each battle and conflict might play out, and the tension that each encounter brings.\n\nFor instance, towards the beginning of the movie we see Hela absolutely dominate both Loki and Thor.  Her domination and use of power tells the audience that in order for this conflict to be resolved a different use of force is required.  This sort of tension is expected in all forms of storytelling, but for comics this is the bread and butter as it shows how much will and strength must be dug up to reach that a satisfying level of catharsis.   Thor has many great examples of this being executed well. Action that lets one live out their power fantasies.\n\n## Comic Book Movies and You\n\nI think marvel has carved out a good place for itself and Thor is yet another example by Marvel of how a great *Comic Book* can turn into a really entertaining *Comic Book Movie*.  It has all the elements that made reading comics so great, with the ability to let me lose myself in the action and conflicts of larger than life characters and action.  If you are a fan of action movies and comics in general, or are up for a fun movie to watch with friends or on the weekend, this movie is great.  But if you are in the mood for something serious and moving, with nuance beyond demigods dealing with their demigod past, maybe have a few drinks."
        }
      ]
    },
    {
      "movieId": 12,
      "submissions": [
        {
          "title": "Formulaic + Predictable = A Blasé Ensemble Flick",
          "author": "e-vaughn",
          "markdown": "## DC’s Strike Outs and Ensemble Challenge\n\nCompared to Marvel’s incredible output of a variety of content (from impressively dark, extended series like Daredevil to the colorful and poppy Thor 3), DC movies have come from a troubled history. While I rather enjoyed The Man of Steel that Zach Snyder directed, almost all other outputs have been a struggle in tone, pacing, and storytelling (except Wonder Woman, which was great).\n\n![Demigods n shit](https://www.europalace.com/blog/wp-content/uploads/www_europalace_com/2016/10/Marvel-vs-DC-1.jpg)\n\nTrying desperately to give the criticized [Batman vs. Superman](https://hopefulhomies.com/2016/12/01/staying-neutral-in-a-world-of-hate-analyzing-media-sans-bias-part-1-batman-vs-superman/) a chance, I was blown away by how poorly written and nonsensical it was.\n\nI did give [Suicide Squad](https://hopefulhomies.com/2016/12/01/staying-neutral-in-a-world-of-hate-analyzing-media-sans-bias-part-2-suicide-squad/) a rather favorable review while giving it the same type of critical eye, which I was pleasantly surprised by. In fact, in spite of its ensemble nature, I found Suicide Squad to be fun due to its handful of strong characterizations and fresh takes on familiar characters (yes, I did like Jared Leto’s Joker quite a bit).\n\nAs I say in that review, ensemble pictures are hard to pace out, hard to make the audience care about the characters, and hard to give meaningful screen time to each character.\n\nWhere Suicide Squad succeeded in several areas, Justice League failed in nearly every regard.\n\n## Poor Pacing and Plot\n\nThere are 5 characters that immediately demand our attention, and 3 of them are brand new to the DC universe. Neither Aquaman, Flash, nor Cyborg are given enough backstory to make me give a single shit about them. There is nothing charming about Aquaman’s backstory, nor a clear answer to why he helps out his little fishing village. Teases about his powers and his abilities never receive confirmation, which upon retrospect simply act as a smoking Chekov’s Gun.\n\nBruce (who IMO Affleck cannot nail in any compelling way) appears from place to place gathering a crew in a very traditional 'hero squad' kind of way. Cyborg gets the most minuscule backstory possible, and it appears insanely convenient to have a character that can magically incorporate with any type of tech.\n\nThe Flash has the potential to be an exciting character ala Quiksilver from X-Men… but every scene he has is a waste. There is nothing exciting about his action scenes, little to nothing humorous about his poorly wedged-in comic relief, and his chemistry with the JL feels off. It’s Big Bang Theory type comedy up in here. He claims he needs to 'eat constantly', and yet… he is seen eating a single slice of pizza ONE single time. The movie doesn’t even have consistency with its own ideas\n\nWonder Woman’s previously charming depiction in her own movie is all but forgotten here as she simply acts as the powerful female hero without much excitement. The film’s best moment does have her fighting our main baddie in her Amazonian vista, but that stands as the most exciting moment in the film.![justice friends!](https://i0.wp.com/media2.slashfilm.com/slashfilm/wp/wp-content/images/justice-league-clip.png)\n\nMuch of the movie is bogged down by terrible writing and dialogue. Characters simply dictate the events on screen and don’t add anything of value with their words. At one point Batman remarks about the enemy infestation. 'They’re coming. They’re ALL coming!' Yes Batman, we can see that they are swarming you, what are you trying to add here? This felt like it was a constant problem with the dialogue, and it made for a strange experience that was comparable to the Martha scenes in Batman vs. Superman.\n\n## Straight Up Boredom\n\nThere feels like an crucial missing component to the whole thing: Suspense. The main villain shows up with no motive and no rhyme or reason. He simply wants to 'conquer'. We’ve heard this tale before. It’s a weak one. And without any deeper themes happening here, it’s straight up boring.\n\n![Poor Bruce](https://cdn.images.express.co.uk/img/dynamic/36/590x/secondary/BEN-AFFLECK-1127800.png)\n\n## SPOILERS\n\nThe worst grievance is that the entire ending is predictable as SOON as they bring someone back to life. How could they blow any mounting tension by revealing this? How could they show Superman, have him be slightly bad for a second, and then revert back to his hero state without much conflict at all? How could they completely ruin any tension or suspense by clearly hinting that Superman would basically fly in whenever things looked dire to save the whole squad? I mean come on. The amount of predictability was stifling.\n\nMore often than not, I had my hands up in pure confusion, cringing with dissatisfaction at the contents on-screen. Be it the untethered characters, the cheesy one-liners that failed to hit home in any capacity, or the dramatic shift in action tone as we see Wonder Woman kick ass compared to Batman fighting a single goon soldier, the movie was a mess.\n\nWe live in an age where almost every movie has some merit. This movie is not a flaming pile of incomprehensible shit. It’s not so bad that I am offended by its very existence. It is however, a seemingly worse cinematic piece than basically any of the Superhero movies I’ve watched yet. I can’t think of a recent superhero movie I enjoyed less than this one, and that includes the ridiculousness of Batman vs. Superman.\n\n**TL;DR**\n\nAll in all, don’t watch this shit. It’s not good. It has too many characters to care about, poor pacing, an all-too-familiar plotline, weak dialogue.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** No. This is the worst superhero I think I’ve seen in the last 5 years. Pass on this one.\n\n**Recommended for non-fans of this genre?** No. This is not a great depiction of superhero movies, and seeing this will likely make viewers have a distaste for the entire genre.\n\n## Semi-arbitrary Score: 3.3/10"
        },
        {
          "title": "What is Zack Snyder Doing?",
          "author": "Jacob",
          "markdown": "## DC vs. Marvel: Superhero Tentpoles\n\nHot off the heels of Wonder Woman, which was quite enjoyable.  DC has decided to bring the bulk of their super hero ensemble into the franchise’s first large tentpole film: Justice League.  A raging action film that might leave many comic book fans thinking: ‘man I really miss the comics’.  The film has some fun action scenes with all the superheroes raising fisticuffs at each other and evil doers, but the story and characters really fall flat for most of the exposition that takes place.  Along with backstory that feels like it was written just to check off a requirement box instead of provide any narrative that makes sense.  But does the sum of its parts make for a good superhero film?\n\n## The Major Problems\n\nSo this film felt pretty bad when it came to story, and many of those bits came down to narrative plot points.  The general synopsis is: There exist these Mother Cubes and they have the ability to bring about a destructive force that can pretty much destroy life as we know it on the planet.  And this dude named Steppenwolf has come to find them and bring them together in one spot, like Dragon Balls! But without a wish, and instead misery, yay!\n\n![Big Dumb Aquaman](https://www.cheatsheet.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-27-at-9.47.47-AM-e1490634281733.jpg)\n\nSo that’s all well and good, but the weirds parts come in when the tapestry of the Justice League comes to form. Batman feels in his stones that something is wrong, how? He just does, he’s batman and he can feel when evil is afoot, down in his big bat balls.   His solution is to bring a bunch of super people together to fight whatever he feels in causing his round, smooth bat testicles to tremble.  And how does he find these savior demigods?  For fucks sake! He’s batman alright, he already has Wonder Woman on his side but he’s rich and has a bat cave.  Somehow he finds aquaman and the flash and they have all but 10 minutes to explain why they exist and decide to help batman when they feel the evil in their stones as well.\n\n![Look at all that Justice we made you guys...](https://cnet4.cbsistatic.com/img/X3jAHT3OYd34VsQK4fbcCNrfyhs=/724x407/2017/03/26/eb2e7ba7-9ddf-4f13-a368-0025a5b48cf4/justice-league-group-warner-bros-uk.png)\n\nThese small oversights in narrative could have been fine on their own but the fact that almost every plot point dragged on in the same manner, really made the movie feel like it didn’t really try to piece together a story that made sense.  It just really wanted to put all these characters in a room together and have them fight.  But it did try, there were short bits that attempted to explain the toils and existence of the **never before seen** heros that are now appearing to fight amongst the ranks of Batman, Superman, and Wonder Woman.  But they ultimately didn’t really matter in the long run, which was too bad.  I feel like some of these characters like Cyborg and the Flash (Fuck Aquaman) had some interesting backstory that could be done better.\n\nLastly, this Justice League really didn’t feel that effective in the end. They had great intentions, but really **(SPOILER)** it came down to ol’ Superman in the end.  They did need to go through a lot of effort to bring him back, which was a very strange series of events on their own.  But they eventually bring him back to life and he is not his same rosy self.\n\n![I think superman is mega hangry when he comes back](https://cdn3.whatculture.com/images/2017/06/90231ecfc6b90247-600x400.jpg)\n\nSuperman in this feels very strange. A lot of Justice League rides on him and his struggle coming back from the dead but again, there where a bunch of events and points in the narrative that made the story feel off.  I can understand that after the events of Superman vs Batman that Superman would feel sour, but his behavior in this and the 180 he makes felt phony.  His motivations were clear, but it came off as the plot needing to progress, and someone didn’t have the time or know how to bring the tension involved in that situation back to a point where all the Justice could unite.  It didn’t even need to be resolved, Superman could still have hated the Justice League but realized that the planet needed his help.  But alas.\n\n ## So is this worth seeing?\n\nI think that for a superhero or comic fan this movie will draw you in.  It has lots of scenes that are filled with superhero action, and some of those are great, some are okay.  But for the most part the storytelling and narrative make this a rather boring and uninspired comic book film.  If you love Batman, Superman, or really any of the major DC heroes there is a good chance that this will disappoint you.  But if you are trying something on netflix and like these big set piece superhero battles, you can have an okay time.\n\n"
        }
      ]
    },
    {
      "movieId": 13,
      "submissions": [
        {
          "title": "Incredible Mustache, Intrigueing Little Mystery",
          "author": "Jacob",
          "markdown": "## New Poirot, Same Story (for the most part)\n\nAgatha Christie is well known for her famous crime consultant: Hercule Poirot.  An adept Belgian detective, often portrayed as being very pleasant, modest, and thoughtful yet seemingly physically fragile.  And there of course was his iconic curly mustache that looked like it was painted on each morning.  In the most recent series he was played by David Suchet where he was slightly rotund, quite cheery and always polite.  In the new Adaptation of Christie’s Murder On the Orient Express,  we see a much more contemporary version of the French speaking sleuth.  And while the story is very faithful to the the original, this new Poirot takes things to new places that Agatha may not have intended for her Detetive.  Regardless, the characters and new take on Poirot make for pretty engaging murder mystery.\n\n## Mystery Stories and Poirot’s New Self\n\n![Look at that happy little man :)](https://peopledotcom.files.wordpress.com/2017/05/murder-orient-secondary.jpg)\n\nI can really appreciate a plot that gives the audience some easter eggs if they are paying attention.  Murder mysteries in particular are great opportunities to show off subtleties and give hints as to where the story is going and if the writers feel: yank the rug out from under you with a fat plot twist, or let the audience piece together the ending.  This version falls sort of in the middle.  I think that the audience can have some sense of where things are going, but probably won’t see the gravity of the final unveiling. Which if you have seen the original is a pretty outrageous plot to murder someone.\n\nFor anyone that has seen or read the story, the overall plot has remained mostly same. The beginning is bit different and provides the groundwork for setting itself apart from Christie’s version of events (for the most part).  The beginning is actually a pretty great little intro, in it we see who Poirot is and his new characteristics that make him a little more dynamic detective.  He meets some of the players that will lead him through his journey and we get a sense that Poirot has this obsession with the truth and a new brashness, making him seem much more self centered and not at all modest compared to his previous selves.\n\nThis new Poirot fits his new outlandish mustache well, he still tends to keep to himself but now he seems bothered by all the attention he receives for his amazing detective skills.  I can’t quite remember his attitude in the previous adaptation of the book, but now it seems all he wants is some time alone and to not think about murder, which is usually his number one task.  Because of his new goal of rest and peace, he often seems insulted and frustrated by others since it seems all they do is pester him about his job, which even according to him: he is the best at.\n\n## Storytime and Characters\n\nJust like in the book, the plot is filled with characters that take up this ridiculously small train traveling through the Orient.  Where someone has decided to carry out some homicide, even when a last moment ‘greatest detective alive’ is added to the train riders’ company.  Now throw in a snowstorm that derails the train and strands everyone in the middle of nowhere, giving people plenty of time to wallow and potentially solve the mystery behind the events that have occured. That’s pretty much the whole plot and it’s worked for a long time ( I believe the book was written in the 30’s? ).\n\n![Looking Like Clue up in here](https://i1.wp.com/awardswatch.com/wp-content/uploads/2017/06/oscar-profile-murder-on-the-orient-express.jpg)\n\nIt’s a good little story, I haven’t read the book but I have seen the adaptation made in the 70’s and I enjoyed it.  I also have seen the adaption made for TV, as well as many episodes of the Poirot show, which put me at a bit of an advantage when walking into this movie and it’s story.   But I felt like I was at a bit of a disadvantage when approaching the character of Poirot, who has a new actor and new characteristics brought into him.  He is no longer the same happy little man, he feels much more serious, like a man who doesn’t like his time wasted nor does he like being bothered.  Perhaps this is just the circumstances of the events leading up to the main plot, but he’s just different, something that I think might be good as we bring an early 20th century character into contemporary media, but be warned for any Poirot fans\n\nThen there is the cast, which is incredibly star studded and I think a big selling point of the film.  Almost every secondary character that makes it onto the train is an A list actor and that really rounds out the screen time.  Most of the movie takes place in interviews with these characters and their motivations and behavior are what really drive this narrative.  And every character does a really good job.  Johnny Depp is great as the rapscallious art crook, and Judi Dench plays great Princess What’s-Her-Face.  All play excellent participants for this little scenario, which turns out to be quite the scenario.\n\n![Johnny Depp don’t know, Johnny Depp don’t know nothing](https://cdn.vox-cdn.com/uploads/chorus_asset/file/9639701/murder4.jpg)\n\n## Things that felt strange\n\nI can’t quite remember how things played out in earlier version of the story, but I don’t recall feeling like this event was so odd when the conclusion was revealed.  I think I mostly blame the tone.  The movie has pretty serious tone throughout the train ride, foreboding and tense as it should be.  But then the ending feels a little bit ridiculous as when the final solution is deduced.  All these characters end up having such crazy connections that somewhere along the way I felt Poirot could have shouted something about how many coincidences are occurring and it would have relieved some of those strange feelings.  In short there were some strange discoveries that kept the tone from matching reality, but it is still a compelling story with no glaring problems.\n\n## Who should see this movie?\n\nThose who are fans of the old Poirot and fans of mystery stories in general I think will enjoy this film. The plot is as good as it was before and the acting and character changes give the old story a fresh feel.  There is the potential that fans of Christie’s Poirot might feel like the new one is kinda mean with his fancy new mustache but all in all I think an easy flick for mystery fans.  For those that aren't into narrative based movies or flashy facial hair this is not so straight forward.  There is not a ton of humor or action to mix things up with, nor is there any fancy storytelling or really compelling drama.  So keep an open mind if decide to give this a go."
        }
      ]
    },
    {
      "movieId": 14,
      "submissions": [
        {
          "title": "A Most Uncomfortable, Yet Hilarious, Movie Experience",
          "author": "e-vaughn",
          "markdown": "## Cult Classics and The Room\n\n  Phew! What a movie The Disaster Artist was. Having been in the know about The Room for about the ten years it’s been out and having seen countless Reddit memes about it, I was always curious to see how this movie would be embraced by the masses. Reddit satirized, reviled, and eventually embraced Tommy Wiseau’s unbelievable vibe for about as long as I had been aware of this flick. The Room became the cous-de-grace, crème de la crème of “so bad it’s good” style movies and created an experience unlike any other.\n\nThe Room is physically difficult to watch. It’s painfully bad and a true test of endurance without friends and a solid drinking game to accompany it. Now that it has become embraced in a way that the Rocky Horror Picture Show has been embraced, it exists in the land of late night viewings and inside jokes.\n\nThe James Franco directed biopic of the making of The Room, appropriately titled The Disaster Artist is a movie watching experience that is also unlike anything I’ve experienced before.\n\n## Profound Discomfort and Vicarious Cringe\n\n![Tommy Wiseau: Genius or Crazed Narcissist](https://static.highsnobiety.com/wp-content/uploads/2017/09/12182128/the-disaster-artist-trailer-00.jpg)\n\nThe Disaster Artist is at once hilarious, incredibly well-acted, self-aware, cringy, and painful. It is profoundly uncomfortable to sit through. I squirmed in my seat and felt embarrassed. I felt vicarious insecurity as I related to Tommy’s efforts, lack of attention to detail, and questioned how a human like this could come to be. I marveled at the mystery of it all, and I laughed and laughed and laughed.\n\nWe watched The Disaster Artists at 11:00PM at a sold-out show at the Egyptian Theater in Seattle. The crowd was clearly well-versed in The Room history, and came to partake, roar with laughter, and make for one of the most unique movie-watching experiences I’ve sat had the pleasure of sitting through.\n\nThe movie made me feel a lot of things. It was well-crafted, but also very confusing. I wanted it to end much earlier than it did, and yet I found the full experience so worthwhile in the end. It was so hard to stomach, and even harder to process.\n\nIt feels as if it aimed to inspire through and also shame. Wiseau’s antics were framed as uplifting and even courageous in one scene, and then aloof and completely lacking any self-awareness the next. His passion for some sort of ideal he held in his head overtook almost all other social, environmental, and personal cues for how he was acting. He was simultaneously an enigma and also a deeply flawed and insecure human. The complexity of his personhood and how he treated people made him a very interesting character to watch and relate to, and it also made him of the most mysterious characters I’ve seen in a biopic.\n\nHe’s somehow larger than life, unbelievable, and never a complete picture.\n\n## The Mystery of Wiseau\n\nWhere the fuck did Tommy get his money? Where is he from? Why is he so afraid to share his backstory? Is everything he did a representation of no self-awareness, or is it genius in its craftsmenship? Is he a modern day Kaufman, taking his role to an extreme? I have SO many questions!\n\nThe Disaster Artist had a lot of hilarious moments. My favorite parts of the movie were the initial introductions of Wiseau, his blossoming friendship with Greg, and the possibility that Wiseau actually had some untenable wisdom behind his complex eyes. The weirdness of his responses to Greg and his mystery here pulled me into Tommy’s world and created a character I was rooting for. These seemingly authentic moments of alien behavior made me curious about the way Tommy’s brain worked. It made me empathize with him about his unrelatability, feelings of isolation, and so-odd-I-can’t-even-handle persona.\n\nThese were also the funniest moments in the whole movie, in my opinion. As soon as the movie transitioned to the on-screen trainwreck that was the making of The Room, my empathy turned to embarrassment. Vicarious cringe of the cast members swayed into vicarious jealousy and insecurity that Tommy expressed at every point and turn. The brazen forward momentum of a man consumed by desire for fame displayed the idea that wanting something hard enough just isn’t enough. Questions of talent, work ethic, and embracing feedback peppered the screen and it made for a very uncomfortable watching experience.\n\nWhat we see on screen is a battle against failure. Failure is not only glorified on screen, it is embraced because we know that these missteps lead to something greater than could have been conceived. And while the movie has some clear-cut suggestions about whether Tommy had engineered the film to be a comedy from the get-go as opposed to actually trying to make something artistic, this question plays well into the mystery of Mr. Wiseau.\n\n![Everyone afraid of all american Tommy](https://media.giphy.com/media/xT9IgM4EZxg9CMLdEk/giphy.gif)\n\nAs I watched the film, I found myself sitting in a profound sadness. How can Tommy, a man so clearly troubled and lonely, be happy? Clearly he is much better off now that The Room was a success and he is adored by countless fans, but is he adored because he’s a veritable punching bag? I couldn’t help but feel a sense of tragedy at how he must process his experience.\n\n## Recreating The Room\n\nOnce the movie got into the making of The Room, I found myself in a state of discomfort that I couldn’t quite shake. Tommy’s pronounced insecurity reverberated throughout the set. He shat upon people’s feelings, experiences, and successes with reckless abandon. He expressed the smallest amounts of empathy occasionally when he talked to Greg, but as a man that very likely always got the shit-end of social interactions, it’s not hard to see why his emotional stability may have been so unhinged.\n\nThe recreation scenes, more than anything, painted a picture of a very flawed human that failed to seek counsel from any of the experienced individuals on set. The constant undermining of friendship and disrespect were baffling and borderline vile. Rooting for Tommy became a bit of a challenge during these moments.\n\n## A Bubble that Pops\n\nThis film was perhaps one of the more uncomfortable viewings I’ve experienced. The final scene in the film is the first screening of The Room. The very palpable tension that emanates through the on-screen theater was mirrored in my theater, or at least in me. I tensed up as the movie was flopping, and our cast stifled embarrassment and simply didn’t know how to react to what was on-screen. When the shift from cringe to laughter happened, and that bubble broke in the movie, the bubble broke in me as well. The audience’s embrace of the movie as a film so bad it’s good, or at least so bad it’s unlike anything else. This moment felt like such sweet relief. I don’t think I’ve ever experienced anything quite like it before.\n\nThis movie was a very unique experience. I don’t think I want to watch it again, but damn I’m glad I watched it once.\n\n## TL;DR\n\nLike The Room, The Disaster Artist was legitimately painful, and that feels like how it should be. Feeling like it wanted to capture the essence of the Room, and nailing it so perfectly is a tremendous achievement. The entire production was well-crafted from start to finish. While I can’t say I liked the emotions I felt during the movie, nor was I inspired, nor was I uplifted… I think it was amazingly successful. Props to everyone involved, and I hope that Tommy Wiseau is able to find comfort in his remarkable, unique achievements.\n\n## RECOMMENDATIONS\n\n **Recommended for fans of this genre?** Yes. I don’t know what genre this is. Biopic? Pseudo-documentary?  Drama? Comedy? Either way, it’s definitely worth a watch. At least once.\n\n**Recommended for non-fans of this genre?** Yes. This is a unique movie experience that tells that tale of a man who is insanely unique. There is so much food for thought that you might be eating for weeks after seeing this… or you might walk out of the theater feeling confused as fuck and uncomfortable. Either way, sometimes it’s a good thing to feel intense emotions that you can’t explain. You’ll probably find them here.\n\n## Semi-arbitrary Score: 8.4/10"
        },
        {
          "title": "A Meditation on the Creative Process",
          "author": "Jacob",
          "markdown": "## The Room and its Legacy\n\nFor those of you who may not know, the Room is one of the most infamous movies out there right now, with a reputation for being a great bad movie.  It has weird moments that often leave the audience confused yet entertained by the wild behavior of Johnny, played by Tommy Wiseau, as he does... well, whatever the fuck happens in The Room.  It’s a movie you can watch with a big viewing party and make silly remarks about its clear flaws: how odd and inhuman the acting and dialogue feels, and how pretty much everything that typically goes into a movie is very off.\n\nI first watched the room by renting it from an actual video store, sat down with a bunch of friends and beer, then proceeded to bust up laughing at how strange the entire film actually is.  As far as I could tell, there was no ‘Room’ and all the acting was so inorganic and the dialogue made little sense.  So much so that you can’t help but find it humorous.\n\n![Creepy Danny and his father figure: Johnny](https://www.tvovermind.com/wp-content/uploads/2017/11/27-the-room-3.w529.h352.jpg)\n\nBut through its unique and most likely botched execution, comes a movie that I think we can consider a success in producing something entertaining and somehow profitable after all these years.\n\n## Expectation vs Reality\n\nThe Disaster Artist is a great addition to The Room’s legacy. It takes a very insightful perspective by looking at the two characters most principally involved in The Room’s production, and paints a picture explaining how the film came to be.  By doing so we see the process by which the two producers of the movie used to achieve their goal: Fame.\n\nThe story follows these two characters, Greg and Tommy, as they find themselves looking to start their careers as actors in San Francisco.  They meet at an acting class and Greg is immediately drawn towards Tommy’s I-don’t-give-a-fuck attitude and his ability to totally act out on stage.  Greg by comparison is timid and shy so he approaches Tommy for help, leading them to form a friendship based on pushing each other to be better actors.  Soon they are on their way to Los Angeles where they plan to find jobs as actors and make it big.  The Hollywood dream.\n\n![At least his image is consistent?](https://images-na.ssl-images-amazon.com/images/M/MV5BNzc3MDViMTMtM2ZkZC00ZjhjLTk0ZjctNzlmZjlhNmVlNzk3XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg)\n\n*Exceeeeept…* they turn out to be rather talentless when it comes to acting, and every executive, agent, and big shot in Hollywood is shitting on their optimism.  Tommy has this idea of himself as the all American hero archetype, even though he has a crazy accent and looks like a stoner Dracula.  Greg has good looks but just has a hard time breaking into the industry with his meekness.  The constant rejection leads them to perhaps their most ingenious idea yet: just make their own fucking movie, starring themselves.  Pretty good plan as Tommy has the cash (because he’s independently wealthy for some unknown reason).\n\n## The Artist’s struggle\n\nThe making of The Room is shown as what seems to be an incredibly frustrating process, and without a doubt is pretty anxiety inducing.  Tommy seems like a really difficult person to work with and judging from the portrayal in this film, is super vain and narcissistic.  Which would have been fine if he was just the star, but he was also the director and writer and executive producer.  This pretty much made him the boss and allowed him to breed what seemed to be a rather toxic vibe with all the cast and crew.\n\n![This scene is so strange, I really wonder how this went down in production](https://a468ba3fc2be117c5560-f9a6225d634730495a59b91d1543c5a4.ssl.cf5.rackcdn.com/TDA-HiMark-SiteGIF_V2.gif)\n\nHe constantly battled with his associates and was at times pretty darn disrespectful.  At least everyone was being paid, because that process did not seem helpful  or very productive to many people.  But what really makes this movie interesting is just how unique this process clearly was.  After all the filming was completed I don’t think anyone on that set had any idea what kind of movie they had produced.  In the film they all laugh at the final product, but I wonder how some people truly experienced it.  For some I bet it was a hard pill to swallow.\n\n##  How do creators know they are creating something good?\n\nThe biggest takeaway for me, and the thing that I found so tense during this film was how do creators know they are creating something worthwhile?  For Tommy, he seemed to have that manifest destiny mentality.  I can’t do anything wrong because I am clearly this amazing person, how do I know?... I just know.  His own life seemed to be his inspiration for the film, and all he needed was to show people what he could do on camera and he knew he would succeed.  But did he succeed or did he fail?\n\n If I asked this question 10 years ago all roads point to failure.  The film was reviewed terribly and it did not turn anything close to a profit.  But over the course of time, the movie has become a cult classic with viewings around the country and the film being well known as something that has merit in its own unique way.  We realize that the plot makes no sense, that the dialogue is unnatural, that the story itself is super boring, but Tommy on screen is like a dumpster fire filled with fireworks.  Throughout the film he is crazy and silly and unpredictable, he is so out of place that we can't help but watch and laugh!  There are *much better* displays of acting, storytelling, and media in general that will be *much less successful* than The Room.  Tommy’s Dream came true, he is now pretty darn famous because of his seminal project made in 2003.  I guess the real moral of the story is never give up on your dreams, no matter how ridiculous they are. And act the shit of everything.\n\n"
        }
      ]
    },
    {
      "movieId": 15,
      "submissions": [
        {
          "title": "A Remarkable Movie About Unremarkable Things",
          "author": "e-vaughn",
          "markdown": "## The Loftiest and Most Accessible of Acclaims\n\nLike many modern day film connoisseurs, I embrace and allow Rottentomatoes to influence me. Reviews aim to inform, but it’s near impossible to not allow the opinions of others to influence one’s perspective. Upon learning that Lady Bird broke the RT record for most consecutive positive reviews, I was flabbergasted and analytical.\n\nThis basically means that Lady Bird is INSANELY accessible. It’s got something that should appeal to everyone, and it’s so insanely likeable that one would be hardpressed to walk away not having enjoyed themselves.\n\nHaving just walked away from the Lady Bird experience just last night… I can see exactly why. This film is relatable as fuck. It’s charming as fuck. It’s an exquisitely crafted coming of age story about a flip-floppity young woman, and it’s strikingly about barely anything at all. It’s an equivalent sort of vicarious cinematic adventure akin to Dunkirk, but instead of presenting raw, unadulterated warfare, we’re watching an abused and naïve teenager learn about life.![Look at dat gurl in a car](https://cdn1.thr.com/sites/default/files/2017/09/s_0.png)\n\n## A Rambling Plot and Copious Laughs\n\nThe most is often hilarious and often feels aimless. We watched this movie sitting in the closest seats that made the movie gigantic, and because it’s not an action movie it worked wonderfully. During the first half of the movie, I laughed at an insanely high pace. The dialogue brought ample wit, genuine feeling interaction, and relatability at an insane pace.\n\nThe lack of predictable plot structure made for a rip-roaring ride where I felt myself surrendering to the film. Events were never life or death, and behaviors never really had immense impact, yet my vicariously invoked emotions careened deep into me. This movie made me feel a lot more than I expected it to, and that’s largely due to a very impressive character portrayal.\n\n## Characterizations Grounded in Averageness\n\n![Not your average dress tho ;)](https://typeset-beta.imgix.net/uploads/image/2017/11/28/284be512-cb15-45c7-bd66-6c6875e2f0b5-ladybird1.jpg)\n\nThe character’s and relationships are what this movie is about. Most every character was not only impeccably well-acted, but they were unexpectedly gray in their behaviors and complexity. Lady Bird’s boyfriend managed to snag the absolutely most stunning moment in the film, and had me on a tear’s edge. Sitting with such raw emotion on screen had me shell-shocked and empathetic even though the moment came unexpectedly. Without spoiling much, this scene was the most powerful scene in a film full of powerful scenes, and it unearthed the exact moment Lady Bird went from a self-centered cantankerous teen in my mind to someone that I rooted for.\n\nOther characters presented refreshingly non-tropy and believable portrayals and oft-represented characters. The popular girl who many movies pit the audience against was humanized in a way that allowed us to dig into her mindset, despite its flaws. The aloofly unpopular best friend with immense talent was sweet, troubled, and a believable homie through and through. The dickish older brother from another mother took over a mantle of responsibility and aided to provide complexity to the world of the family, while also hinting at a more complex backstory we’d never hear about. The “why-is-he-so-douchy” cool guy that makes us question why he feels so douchy, to be fair, doesn’t have much gray to him, but even that feels believable.\n\nFor a movie about growing up, the crux of Lady Bird’s drama and experience stems from her imposing and complicated mother. We’re presented with a verbally abusive, unsupportive, and emotionally manipulative mother. Her very first scene felt like a punch to the gut in how much she intentionally or habitually undercut Lady Bird’s confidence, and I would venture to say that many of my friends and myself and the mother’s I’ve interacted with have embody some of the less-than-desirable traits and behaviors.\n\nThe mother almost steals the show in how much her vileness acts as a foil for Lady Bird. It’s a little hard to swallow, but fuccccck, the mother was so painfully unmotherly that it hurt to watch.![Sometimes you just want your daughter to be a stunted little loser, right?](https://images-na.ssl-images-amazon.com/images/M/MV5BMjQ5ODM5OGUtNzZmNi00MWVlLWFkOTctYzljYzYxY2QwYzU3XkEyXkFqcGdeQXVyNTAzMTY4MDA@._V1_.jpg)\n\nWith a strong contrast to the father-figure, the parents are the two most non-average characters in the whole film. They are opposing forces of good and evil, and both act to subvert common parental tropes often seen in films. Lady Bird’s motivations and mistakes stem from the manipulation she’s tolerated from her mother, which is clearly expressed in many scenes and her walking-on-eggshells behavior twists the very essence of Lady Bird on screen. It’s beautiful acting, heart-wrenching, and empathetically grotesque. The dad, on the other hand, is warm, unassuming, insanely supportive, and such a joyfully pained sweetheart that his lack of success stings so much. While these two characters have plenty of gray, they frame the film in a way that reminded me this was a movie with something to say.\n\n## Themes and Conclusions\n\nThe movie has many themes, but most prominently is the sense of averageness. The sense that even when you try to become special, you aren’t special. The sense that “you begin as dust and will return to dust”. The sense that your own decisions will either match your expectations, or brutally slap you in the face with reality, laughing at your naiveté. The themes are not only evidence in a variety of religiously connected scenes, they are upheld by the flimsy plot structure and consistently average events. Perhaps it stands to claim just how much growing up is purely about coming to terms with our lack of specialness in the world, all whilst encapsulating a film that’s unusually relatable.\n\nIt also stands as a really hard movie to compare to others, and rate. I know that I really liked the movie, and it feels so recommendable to anyone, but what am I walking away with? A friend of mine mentioned another coming-of-age movie that feels insanely comparable: Juno. That movie must have been written in like 2003 or something, but even though I saw it over ten years ago, I still remember so many moments and quirks about it. I don’t know if Lady Bird is more successful or more enjoyable or more creative than Juno (or the other way around), but I do know that Lady Bird is phenomenal. Juno characters felt so much larger than life, and Lady Bird gave us an opportunity to enter into a life. Good shit.\n\n## [TL;DR] A Full Package that Resonates Ferociously\n\nAll in all, this film was hilarious. It also nearly made me cry. It was compelling all the way through. There were so many adorable scenes, witty dialogue, and genuinely contemplative moments that I was either swooning with cuteness, endeared to the charms of the characters, hurt by the abuse, or connecting the dots to my own life. And watching it felt effortless and fun.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Yes! I would recommend this coming-of-age picture above most others I can think of.  It reminds me of Boyhood, but felt much more fun.\n\n**Recommended for non-fans of this genre?** Yes. The movie has so many incredible characters, so much relatable content, and so much beauty on-screen that I would love to hear some mindful cinephiles speak about why they may have disliked it. I feel like it’s too likable (though perhaps I’m influenced by the record-breaking RT), but who’s beefing about an inoffensive flick like this?\n\n## Semi-arbitrary Score: 8.8/10\n\n*As mentioned, this movie feels particularly difficult to rate. I struggled with scoring this film above most any others films I’ve rated thus far. I actually enjoy the challenge of trying to quantify how much I enjoy a film, and I aim to identify that it’s a semi-arbitrary number. The score is no doubt influenced by the actual subjective enjoyment of that theater/watching experience, the actual content and craftsmenship of the film, and the message of the film and what it has to say beyond its narrative. Often a movie can have immense value simply from a single scene, and how much it made me feel, but that a hugely powerful scene will next accompanying text to parse out. This overall score represents the overall quality of the movie, and while far from perfect, I feel it’s an important metric for me to include in my reviews.*"
        },
        {
          "title": "Lady Bird Review",
          "author": "Megan",
          "markdown": "Growing up in modern America, I was spoon-fed the idea that every moment in adolescence holds some sort of pivotal value. Every sitcom I watched, every magazine I stole from my older sisters, and each and every movie about teenagers painted high school as an era of momentous occasions that held deep and far-reaching impacts. I recall yearning for these years when my life would suddenly become meaningful. I would spend hours with my sisters fantasizing about high school through our Barbie role-play. I couldn’t wait for the importance this foreign terrain would impart on my life. This longing for purpose is what made Ladybird such a relatable movie for me. The film in its essence is about a young girl trying desperately to inject significance, positive or negative, into the painstakingly average experiences of white middle-class female pubescence. And its execution is flawless\n\n![Adorbale little lady bird](https://images1.westword.com/imager/u/745xauto/9628999/lady_bird_saoirse_ronan_credit_merrick_morton_courtesy_a24.jpg)\n\nEven the title character's name, Ladybird, is self-endowed moniker crafted to set herself apart. The story follows her throughout her senior year as she finds her first relationship, loses her virginity, tries to fit in with a crowd she deems attractively defiant, navigates a relationship with an impossible mother, prepares for the prom and tries to get into college. Each step of the way, I found myself cringing as I saw myself on the screen, aching to reenact the glory of the scenes I had grown up seeing in every teen movie. And just like Ladybird, I was met with the crushing disappointment that adolescence is often nothing special.\n\nWhat made the film shine through Ladybird's discovery of personal mediocrity was its concise acting, its laugh-out-loud humor, and it’s deconstruction and humanization of characters so commonly troped in American teen movies. Instead of glorifying the moments we have all endured throughout high school, it  presented them in their actuality, warts and all. It managed to cover a vast range of teenage experiences. Almost everyone can find some aspect of Ladybird relatable. A first “love” turning out to be something less. A disenchanted bad boy who is actually a straight-up dick. Learning that leaving your friends for the cool group was a huge mistake. And perhaps the most universal of all, parents who are damaging, flawed human beings despite their efforts to be otherwise.\n\nSeveral scenes brought me to tears, many scenes made me laugh, and most made me think. I would recommend this film to anyone and know I will be seeing it again."
        },
        {
          "title": "Now I Want to Be Disenchanted in Sacramento",
          "author": "Jacob",
          "markdown": "**Lady Bird is a film that doesn’t throw a lot at you.**  It’s easy to approach, and what it does present you with is incredibly charming and endearing.  It’s a simple story about a teenage girl, and like many teenage girls, she wants to grow up suuuuuuper badly.  Her adventure is one of inexperience and discovery.  She is looking for something missing in her life and she believes that she needs to be far away, experiencing different exciting things to find it.  There are many movies that fall into this description but none of them have the charming, likeable qualities of Lady Bird, and I don’t think I have enjoyed any of them as much.\n\n## Why do I like this so much?\n\nI think it’s pretty hard to make a movie with a narrative like Lady Bird’s that I find enjoyable, which I thought Lady Bird did… Like, really well.  I found myself laughing a bunch and becoming invested in the characters that take up the screen, and just feeling happy.  The things that occur aren’t all that compelling or motivating, but still feel romantic and important.  Following Lady Bird through her teenage California life was a pretty fun and pleasant experience, but really.. Why?\n\n![Young love in Cali](https://atom-tickets-res.cloudinary.com/image/upload/c_fill,g_north,h_425,q_auto,w_992/v1506558027/ingestion-images-archive-prod/archive/1506558027397_254970_cops_4.jpg)\n\nThe tale of Lady Bird begins with: Lady Bird, but that’s not her given name, and given names are something that Lady Bird finds silly, so she gives herself another name: Lady Bird.  Christine “Lady Bird” McPherson is 17 going on 18 and she is tired of living her unremarkable life and wants things to change, she wants things to be different, to be away from her hometown.  While the character Lady Bird believes her life is boring, which it kind of is when talking movie standards, we as the audience get to see things with a different perspective.\n\nWhile Lady Bird believes her differences hold her back from living the life she thinks she wants, we see a dynamic young woman who’s differences make her endearing.  She has to deal with her mother for one, who can best be described as a mis intentioned helicopter mom.  She is constantly chastising her decisions and generally filling Lady Bird with Negativity, and not in a productive way. This dynamic between Lady Bird and her mother produces a great deal of tension in Lady Bird's life.  It appears the Mother wants Lady Bird to have low expectations for herself, even while Lady Bird continues to grow and live her teenage life, and even wants to do ambitious things (like go to an Ivy League college!).\n\nLady Bird is also quite socially skilled, maybe with new found motivations as her senior year is ending, but she takes up many social activities and is generally pretty positive about her behavior and personality, something that is nice to see in female protagonists.  She even runs for her school’s class president office every year, even though she has no hopes of winning, complete with hilarious posters advertising her oddness.\n\n![The constant political struggle](https://a468ba3fc2be117c5560-f9a6225d634730495a59b91d1543c5a4.ssl.cf5.rackcdn.com/_hero/lady-bird_printable_01.jpg)\n\nWe see her supporting her friends, being funny,  wholeheartedly joining extracurricular activities and sticking up for herself and her ideals, things that heros in films generally do.\n\n## Looking at Life from Different Perspectives\n\nThe theme that resonated the most for me in this film was how we are the arbiters of our own happiness.  We are in part a product of our surroundings, but we in fact are in control of the dynamic between our internal ability and our external environment.  In the case of Lady Bird, she was positive that her surroundings were stunting her ability to be happy, which they were in part thanks to some of the people in her life.  But she was convinced that her environment was something she disliked and could not thrive in.\n\n![Stealing is sometimes okay it seems](https://cdn.vox-cdn.com/uploads/chorus_asset/file/9588765/ladybird3.jpg)\n\nThis feeling exists in all of us in certain ways, and this movie challenges us to come to the realization that we are all like Lady Bird in those respects.  There are times in which we believe it is other people, places, or things that keep us from being happy, from achieving our life goals.  We can convince ourselves that these external forces are stunting us, and that we must go to perhaps extreme lengths to change our situations.  Don’t get me wrong, sometimes that is totally the case, but Lady Bird makes us consider an alternative.  Even though we may dislike aspects of our lives, these things have a hand in producing who we are.  Perhaps we shouldn’t be trying to run away from those things, but instead reconciling who we are with the circumstances that have produced us.\n\nBecause of this, I feel Lady Bird is the total package.  It had funny moments of dialogue, really great characters that were easy to empathize with and see as human beings living within a community, and an overarching theme that tied those aspect together in a poignant way\n\n## So… who is this movie for?\n\nThis is clearly not a film for everyone,  it has a rather slow narrative that tends to meander a bit.  But it is quite endearing and has a lot of wholesome values and charming humor baked throughout many scenes.  If you are a someone that likes that sort of thing, this movie is absolutely for you.  If you are someone that is more of an action fan, likes fast moving sharp narrative, wants a much more dynamic story, than this film might be a stretch, but I always like for to people to push their comfort zones.  I thought this movie was really well done, the ending feels a little pedantic ( I liked it, but some people thought it was really stupid and undermined the plot ) but I think the bulk of the movie is still worth a peep."
        }
      ]
    },
    {
      "movieId": 16,
      "submissions": [
        {
          "title": "Is This What Star Wars Fandom Feels Like?",
          "author": "e-vaughn",
          "markdown": "## The Pretty Shitty Star Wars Legacy (IMO)\n\nUp front, straight up, and right out the gate: I have never really enjoyed a Star Wars film before. I’ve tried… really hard. I’ve tried to give grace to the poor writing, the silly tone, the cheesy humor, the whack-as-fuck action scenes, the horrible CGI, and the contrived writing. I’ve given grace to the blatantly surface level themes of Dark/Light.\n\n![Sith morning standups are pretty tense](https://i0.wp.com/media2.slashfilm.com/slashfilm/wp/wp-content/images/starwars-lastjedi-snoke-throneroom.jpg)\n\nWhen The Force Awakens (TFA) came out years back, I went in with a really neutral head. I had no expectations at all, and thought it best to let the film speak for itself. I walked away thinking that I saw a rather uninspired re-trend of a very popular movie, polished to remove the old bits, yet containing a core of duct-taped foundation. Needless to say, TFA failed me on a variety of levels, and I walked away not caring about the characters.\n\nWhen The Force Awakens (TFA) came out years back, I went in with a really neutral head. I had no expectations at all, and thought it best to let the film speak for itself. I walked away thinking that I saw a rather uninspired re-trend of a very popular movie, polished to remove the old bits, yet containing a core of duct-taped foundation. Needless to say, TFA failed me on a variety of levels, and I walked away not caring about the characters.\n\nConvinced that the next Star Wars was another opportunity to appreciate the franchise (which, for a cinephile like myself, is impossible not to respect), I watched Rogue One (2015) with fresh and hopeful eyes. The swing-and-a-miss humor flopped on me, the action scenes that are purposefully devoid of any tension due to “force protection” were boring, and the whole film was predictable and unworthwhile. My outlook on Star Wars was not going well.\n\nMy favorite Star Wars entity was a videogame called Star Wars: Knights of the Old Republic. It had insanely fun world-building and characters. When I think about what I actually genuinely enjoy about Star Wars, I say that I love the world building, the alien races, the fashion/costume design, the eye for contrast, and the action.\n\nWith ALL THAT SAID, Star Wars: The Last Jedi was absolutely incredible. I can’t believe that I am saying, after ALL THIS TIME, that I actually and genuinely loved a Star Wars movie. My goodness! What a treat!\n\n## Art Design, Fashion, and Costumes\n\nSince I knew what I liked in the Star Wars movies, I’ll target how those were absolutely nailed and polished in this particular movie. I got to give props to Rian Johnson and his crew for nailing the most beautiful look of the franchise yet. The Star Wars aesthetic is like science fiction militaristic alien architecture, blended with 80’s computer UI and an overabundance of blaster fire.\n\nStrong and deep contrasts, sweeping vistas, and a myriad of vehicle designs frame our environments. meanwhile, cloaks, hood-coverings, and a desert-esque mix of militaristic cyberpunk seem to [house the fashion](www.vogue.it/en/fashion/trends/2017/12/13/fashion-of-the-future-inside-the-costumes-of-star-wars-the-last-jedi/) in the films.\n\n![Fashion: Rey style](https://media.vanityfair.com/photos/5924578952a3f44dc6f3a8a5/master/h_590,c_limit/star-wars-portfolio-06-2017-ss02.jpg)\n\nThe fashion and world building in the movies have been incredible, and here we have perhaps the pinnacle of Star Wars fashion. Everyone looks dressed to the stars, gorgeously lit, and well fitted. It’s a sight to behold at any given moment in screen-time.\n\nThe visuals go so much further than what everyone is wearing, as we get unbelievably lush depictions of Cyber-Posh lifestyles during a casino scene, overloaded particle effects in the numerous space-battles (with their density cranked up to a new level), and a gorgeously blood-red battle landscape near the end. Also, for some reason, any explosion in this film just looked downright incredible. Michael Bay should take notes.\n\n## Humor, Tone, and Themes\n\nWhile the film is dripping with style, it also manages to hit the right tone in its narrative and its presentation. Whereas this is primarily a dark film with cumulatively serious tone, the moments of levity peppered about didn’t add shlock or cheese as much as they provided a bit of light to the darkness. It almost feels like these infusions of humor shouldn’t work, and yet the execution somehow stands up. Be it Fin’s leaky lil suit, Luke milking the nipples of some weird alien-cow, or Chewbacca having an ethical dilemma before munching on a delicious looking cooked Porg, the humor worked throughout the film each time for me. And, it’s often adorable. There are a wide variety of lil alien pets and puppers in this thing, and they all have an exotic, cuddly, or otherwise elegant design.\n\nThe film not only has a strong balance of seriousness and humor, it also imparts the most provocative message that I’ve seen in any Star Wars yet. Not content to be a shallow surface exploration of Good vs. Evil or Light vs. Dark as nearly every prior film has explored, this one swings for the fences to explore heritage, faith, perseverance, and clearly most of all the theme of failure. Those that have already seen the movie would likely find much benefit in this thread [analyzing the overarching theme](https://l.facebook.com/l.php?u=https%3A%2F%2Fwww.reddit.com%2Fr%2Fmovies%2Fcomments%2F7jwxnd%2Fofficial_discussion_star_wars_episode_viii_the%2Fdra7c83&h=ATMOpsXKzjp2B7TC4FKqJekop_6CbKcqjCAvvZ4XiMPqarRnXTo-myDvDpi03MtvDHljVnvx9xauETSDRcyRl-8TfDM-gpM0YN_uJW7pEoHcPCrZaxh2JkFM-Q&s=1&enc=AZPf6yrfZEFGoELxKfzEJz-WIUv0Lxl2gqUKQAkmHomOE_Au_jnKOUWXQFlI7mHg7BGrOuothbJIQi9iAdWmT_E7) in this film.\n\nAs someone who’s viewed the prior films as set pieces for character moments that don’t amount to much else, the recurring theme in this film resonates much more than expected and felt like, maybe for the first time, Star Wars had an uplifting and inspiring message to deliver.\n\n## Plot, Character Moments, and Pacing\n\nWhereas The Force Awakens felt predictable and even a retread of A New Hope, this one’s bouncy plot structure allowed for exciting deviations and unexpected happenings all over the place. There are plenty of “gotchya” moments that acted as actual surprises, and even though the plot is far from “bullet proof”, it felt much more cohesively written and had more attention to detail than prior films in the story.\n\nWe still have a number of head-scratching “Force” solutions to problems that don’t make a lot of sense, but the execution aids in giving those scenes grace. And Star Wars is pretty well known for having nick of time support troops show up, a new Force power revealed for convenience, or having a character pull a heroic moment that only they could achieve. This is nothing new, but the difference with The Last Jedi is that these moments actually adds tension to each scene. There are a handful of legitimate spoilers that, if having no clue what will happen, can be actual shocks.\n\n![This set piece was legitimately sick](https://www.starwarsnewsnet.com/wp-content/uploads/2017/10/TLJ-Ships-04.jpg)\n\nMuch of the Star Wars ilk amongst the internet is up in arms about plot points, unfulfilling character moments, and poor dialogue. Whilst watching this, I didn’t feel any of that. Every moment felt plausible, easy to give grace to (specifically a couple of the new Force power moments), and I appreciated that this movie actually pushed the Star Wars lore much further than The Force Awakens or Rogue One. Many fans will say that something that happened in The Last Jedi felt out of character for Star Wars, but I get the sense that they need to clean their nostalgia goggles just a bit (the OG and Prequel trilogy was packed with cheesy humor, nonsensical plot points, and inconsistencies). Perhaps it’s the identification of a very clear and cohesive theme that cements the plotlines together for me.\n\nThe biggest gripe I had was the pacing of the film, which runs quite long at 2.5 hours. It’s dense, jumps from scene to scene as if escaping from a chase, and rarely lets up. During the climax, the breakneck pace actually lessens for a brief moment to provide an incredible character moment, and in one fell swoop I found myself marinating in the visuals and on screen craziness.\n\nThere are also several character moments that I could see grating die-hard Star Wars fan, but they worked so well for me. Perhaps it’s Luke’s desire to shit all over the Jedi Faith and also the audience’s faith in what made Star Wars a beloved franchise that makes this movie work so well. It feels like a movie so far askew from the traditional framing of Star Wars that it’s no wonder it’s sitting at 56% user score on RT, but [it’s well aware that it is tasking the audience to embrace a new framing.](www.slashfilm.com/the-last-jedi-defense/)\n\nAfter much contemplation, I conclude that it’s precisely because The Last Jedi aims to cast a canted eye on the Star Wars Legacy. Because it turns beloved heroes in contemplative ones. Because it muddles the purity, comfort, and safety that makes Star Wars so accessible, and because it does so by taking risks.\n\nFor the first time ever, I find myself genuinely excited for a Star Wars movie over the horizon.\n\n## TL;DR\n\nGreat acting, incredible visuals, lighthearted humor, unpredictable moments, a solid theme and narrative structure, high attention to detail, and a wild ride from start to finish, this Star Wars finally hits home for me where all other Star Wars have failed.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Yes. But I mean, what type of Star Wars fan ain’t gonna watch another Star Wars? It’s like the most beloved franchise in cinema history…. It’s like a no-brainer.\n\n**Recommended for non-fans of this genre?** Yes, mostly. For the first time, I think a Star Wars movie is actually a good movie. Not a good movie for Star Wars people, but like, an actual good movie. If you have zero understanding of the film though, the Star Wars legacy, or are unwilling to catch up with the narrative and characters, it may not work for you. However, we’re looking at like the 8th installment in a franchise. I think Last Jedi does OK at standing on its own legs, but I knew enough of the story prior to not let things go over my head. My partner who watched it, well, she had no clue what the fuck was going on.\n\n**Recommended for people who have yet to like Star Wars but really want to like Star Wars?** Yes. After stewing over this movie for a couple of days, pondering why I liked it so much and why it’s so intensely hated by many a hard-core Star Wars fan,  I am coming to two conclusions. This is probably the best movie of the Star Wars franchise that comes bundled with its own legs, it’s the gutsiest of the movies, the most beautiful, and also the most likely to piss of fans (maybe even more than Phantom Menace?!?). The other conclusion I’m struggling with is that it’s very possible I love this movie because I am finally impressed by a Star Wars movie in general. Maybe I’m slightly non-objective in the quality of this movie, and this review stands as more of a description of my experience watching it that first time. Nonetheless, it made me joyful as fuck, felt epic, and even kinda made me a fan almost. Oh man. Yah. Yah, this was good.\n\n## Semi-arbitrary Score: 8.8/10"
        },
        {
          "title": "The Force Slowly Returns To Star Wars",
          "author": "Jacob",
          "markdown": "I was disappointed by 2015’s Star Wars: The Force Awakens and I’m still reeling from that disappointment.  It was basically a return to the beginning of the original trilogy in terms of plot, and the antagonist was just someone I was not compelled by at all.  The worst part about this situation is that we are stuck with the groundwork laid by J.J. Abrams, which will go on to shape the rest of the Star Wars movies *for years* to come.\n\nNow that’s out of the way, The Last Jedi is is decent attempt to continue the Star Wars Saga with a story that doesn’t totally stink, but I think stumbles a bunch with plot execution.  It has great set pieces, fun dialogue and characters, and is generally a good time.  At its peak, there are some really great little twists and turns that feel fresh.  It’s as though we are finally seeing what hundreds of millions of dollars and super great talent can get us, but then unfortunately we see us how few risks the series is ultimately willing to take, making another movie that feels too scared to do something really innovative and unique.  There are just some very strange moments where it feels like a movie that does not know where it wanted to go.\n\n## Star Wars Trilogies\n\nWhen I was first exposed to Star Wars, I was not really in a place to be critical of the original and even the second trilogy of Star Wars films.  As a very young child, they were shown to me with a reverence that seemed like these films should be respected like your elderly relative who’s fought in The Great War.  They took risks and made our culture and society better so just shut up and listen.\n\nThis isn’t to poke fun at the previous trilogies, it’s just to say that Star Wars is so seminal in terms of Sci-Fi Fantasy filmmaking that it has had an enormous effect on how generations of filmmakers, storytellers, and writers have approached the genre and thusly laid the groundwork for the next great generation of films to come.  Now we are seeing what a cash cow the series has turned into, and how a series that was risk taking in it’s time is now just a continuation of the family saga that the original produced.\n\n## So What Do We Get?\n\n![Rey, coming into her own...  somehow](https://i.vimeocdn.com/video/669383189_1280x692.jpg)\n\n2017’s The Last Jedi feels like a fresh coat of paint on a rather stale franchise.  It is willing to take some risks and some of them pay off in unsuspecting ways and others make you scratch your head.  We see the rebellion acting as a cohesive unit for one, and making pretty big decisions.  But the execution in the film is so strange.\n\nFor any Star Wars fans that have a hard time forgiving plot holes, after that new car smell wears off about an hour or so after the credits role, you will say to yourself: ‘wait a sec, that doesn’t make any sense at all!’.  There are a handfull of places where it's just a darn shame that the writing didn’t have more time to flesh out some of these scenarios a bit more, because they are freakin' far fetched.\n\nBut what that **does** mean, is that we get some super flashy moments that are pretty badass, and as far as sci-fi action geekery goes, these moments are awesome.  Set piece battles are over the top and tense.  Lightsaber battles and villain face offs are dramatic and filmed very well.  The soundtrack is still great, and I felt legitimately surprised by the way some of the rebel narrative was executed.  These moments feel like a glimpse of what new Star Wars films could be, and I think having directorial and writing talent like Rian Johnson is to credit.  It’s overall a step in the right direction and if the main Star Wars canon can take similar steps, I think the next few iterations of Star Wars will be bearable, if not actually great.\n\n## To watch? Or not to Watch?\n\n![Startrooper on Startrooper Action ;)](https://i.vimeocdn.com/video/669383380_1280x693.jpg)\n\nOf course every Dick and Debra that has any connection to Star Wars in gonna see this film and may or may not enjoy this depending on their level of fandom.  If you are just a sucker for intergalactic family dramas, or mystical space wizards, you’ll find something here to enjoy.\n\nBut if you are a die hard Star Wars fan you might think that this film is just pomp and circumstance, something that tries half heartedly to bring some life back into a big blockbuster franchise but is just riddled with plot holes.  Honestly, some of the plot holes feel like they break that suspension of doubt that we all sort of agree upon when watching an act of fiction.  Which may or may not be a deal breaker when you sign up for a film like this.  Personally, I wasn’t too peeved until I looked back at the movie as a whole and thought, ‘oh jeez, why doesn’t the Empire have a way to defend against this?’ or ‘How hasn’t this happened before?’.\n\nI’m glad to see Star Wars take more risks, I’m glad the direction and acting is done extremely well, with a decent narrative that’s actually novel for once.  Hopefully we’ll see more creative risks and more characters join the ranks of the rebellion as the saga continues.  For myself, this is a step in the right direction but I’m hoping the studios take note write a more cohesive story."
        }
      ]
    },
    {
      "movieId": 17,
      "submissions": [
        {
          "title": "A French Love Story on the Fluidity of Love",
          "author": "e-vaughn",
          "markdown": "Days after watching the Shape of Water, I find myself struggling just a wee bit to remember its quirky charms, its emotional resonance, and the themes it may have conveyed. For a movie I recall liking quite a bit, there isn’t a huge moment in it that really stands out. Its wholeness stands as much more valuable than any individual scene, and that feels like it makes it a vivid movie-going experience, yet a hazy memory.\n\n## French Love and LoveCraft\n\n![Daydreamin about that weird fish man.](https://media.npr.org/assets/img/2017/11/30/the-shape-of-water-288_sow_dtlra_rev_f_t_final_r709_grd.088055_rgb_wide-4086f20d481cb39ddfbd23df6e9ab805498a224a-s900-c85.jpg)\n\nDirector Guillermo del Toro’s previous films include Blade 2, Pan’s Labyrinth, and Pacific Rim have housed various styles. He usually dips into his love of Horror (especially Lovecraftian horror), yet I’ve not seen much of his work that touched upon love, connectivity, and emotional risk.\n\nThe Shape of Water seems to be a memoir around the airy, indescribably feeling of being in love. Shot with warmth and a French Love story style, our main characters explore what it means to risk and fall into an emotional state that may neither may sense, nor need to. Uncontainable, shapeless, and able to be found everywhere, Love and the Shape of Water appear to go hand in hand.\n\nThe movie does a great job of portraying minimalistic dialogue as we see a connection form between mute and beast. It’s hard not to root for such warmth.\n\n## Acting and Intensity\n\nWith beastiality not only on display but also humanized to a level that feels relatable, I found myself appreciating the tone of the film. Much of this is accomplished by the incredible acting by our lead actress, who conveys various emotions through voice, mannerisms, and adorable dancing.\n\nOur human monster, played by Michael Shannon, is an intimidating and grotesque villain that acts as an opposing muse. Clearly meant to instigate, we see the face of horror through his actions. This dude was such a great villain, eschewing a flavor of 50’s-esque masculinity that is hard to chew.\n\n![So coy ;)](http://static4.businessinsider.com/image/59ac65296eac4020008b8286/guillermo-del-toros-the-shape-of-water-is-a-moving-monster-love-story--and-will-definitely-get-oscar-attention.jpg)\n\n## A Multitude of Tones\n\nI wouldn’t say that the movie has an identity crisis, because it clearly comes together to craft a charming film. There are however, so many different kinds of little scenes that don’t fit snuggly into a singular genre. There are hilariously light and dark moments. There’s witty scenes of philosophical dialogue and character mantras. There’s intense violence, torture, and gore. There’s sexiness, nudity, vulgarity, and even shocking descriptions of sexuality. And then there’s the tone that makes it feel entirely like a dark fairy tale.\n\n## [TL;DR] Charm, Leading to a Pleasant Single Viewing\n\nIn the end, it’s a unique film and it’s well-crafted, but it doesn’t feel like there’s all too many components of poignancy to this film. Perhaps however, that small scope helps retain its charm throughout.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Yah. For fans of quirky indie films, this is unique not commonly seen to have a horror/love blend. It may not act as a romcom, but it is a story that ponders the concept of love in a way that leaves more room emoting than thinking.\n\n**Recommended for non-fans of this genre?** Yes. I’d say that this film is unique and diverse enough in tone that mature audiences of various kinds may enjoy it. Like me, they may find various scenes to be interesting, and the overarching plot to be compelling enough (it moves at a solid pace), but I’d be willing to bet that the charms of the film may appeal to a variety of audiences.\n\n## Semi-arbitrary Score: 8.2/10"
        },
        {
          "title": "A Touching Metaphor for a Worthless Relationship",
          "author": "Jacob",
          "markdown":  "I had some pretty high expectations for this movie and after seeing it I walked away feeling a little underwhelmed.  For the most part it was an incredibly charming film with great music and style.  But throughout certain parts of the movie, I felt the main theme was undermined by the unrelatable and seemingly shallow relationship between the two main characters.  But apart from this, everything else throughout the film was spectacular.  The acting was wonderful, with all the characters feeling like they really hit home.  After the credits rolled, I would be hard pressed to say I didn’t enjoy the movie quite a bit, not just as an endearing love story, but as a metaphor for the power of love.\n\n## What Exactly Am I Getting Into?\n\nThe Shape of Water mostly revolves around one character: Elisa, who is a janitor in a mega secret government facility where they let janitors just walk about and fall in love with their closely guarded secrets.  The most closely guarded secret here though, is a strange South American river creature slash amphibious man being studied and maybe a teensy bit tortured.  His backstory is pretty washy but Eliza doesn’t care at all about her new obsession’s history, almost by some sort of divine intervention she is drawn to this creature by powers unforeseen.\n\n![Gemme back my monster please](https://www.dailydot.com/wp-content/uploads/d3f/89/69f23564c56b41b9-2048x1022.jpg)\n\nThis plot point in particular was one that I had a little bit of an issue with as the connection that Elisa and this creature shared seemed to only be felt by them.  I was not able to empathize with this relationship much at all as it was a little abrupt that these two creatures fell into such strong feelings, especially for the amphibious man.  He was pretty much a black box throughout the film.  By all accounts, after months of captivation he seems like he would need some time to adjust to someone not beating the shit out of slash probing him that he would be a little confused and a little more cautious when someone seems to be **outrageously attracted to him.**\n\n## Style and Charm\n\nThe greatest selling point by far was just how charming most of the story was.  Even the bits revolving around the most excellent Michael Shannon as the Antagonist Colonel Richard Strickland.  Every scene holds the audience’s attention as each of the character’s stories are being told, and there are indeed multiple stories being told here.  It felt like so much was going on as each character impacted the overall story arch.  Even seemingly minor scenes come back and show their faces in impactful ways, some subtle, some not so subtle.\n\n![An odd but adorable couple](https://screenwritingumagazine.com/wp-content/uploads/2017/11/TV-1024x668.jpg)\n\nAnd throughout most of these scenes a beautiful soundtrack to bring everything under one cohesive theme.  The music made this film feel a lot like a French style love story from the 1970s.  The film’s composer Alexandre Desplat put forth a score that really lets you lose yourself in the emotions and feelings of the characters on screen, giving the film a light and floaty feeling like you are surrounded by water.  As such the score of the film is just as important as the scenes and acting themselves. The charm of this movie relies heavily on the incredible music and score.\n\nThis is one of those films that was executed extremely well.  It evokes a very tangible feeling of hope, caring, and excitement, which powerful relationships typically evoke.  The little pieces that were crafted to make the audience feel those feelings are very present.\n\n## Will I Fall In Love With This Film?\n\nThe metaphors and feelings this movie delivers make this a really enjoyable experience, and the story is presented and executed very well. There is enough here to please most people.  Obviously though, this is a drama at the end of the day so don’t expect to laugh too much ( even though there are some chuckily bits ) and there is a little bit of violence.  If you are expecting a masterpiece by Guillermo Del Toro this is not it.  I don’t even think this is close to his best work, but it is a damn good film.\n\nFor me there should have been a little more time spent fleshing out the relationship between Elisa and the Amphibious Man so that there story has a bit more emotional resonance.  At least as much emotional resonance as you can have between two pretty different species."
        }
      ]
    },
    {
      "movieId": 18,
      "submissions": [
        {
          "title": "A Neon Spiritual Journey to One of Pixar’s Most Adult Films",
          "author": "e-vaughn",
          "markdown": "## Pure, Unadulterated Visual Beauty\n\nRight off the bat, Coco is phenomenally beautiful. The animations are more fluid, complex, and intricately designed than any previous outing I’ve seen. For a very human story, the more complex facial animation works well to evoke a variety of emotion (and you’ll be emoting quite a bit). Each frame, each layer of color, and each piece of dialogue aims to inspire the audience.\n\nThe dog companion in this film might be the most compelling mix of goofy adorableness put to the screen. Every time he was on screen, his Gumby-esque antics had my face permanently affixed into a grin. :D\n\nSuch is the nature of animation vs. live action, with animation illuminating a heavily designed and curated experience, hand-carved to perfection with every detail specifically considered… and with live action being a culmination of performances, naturalness, and complex interpretation. This animated film was so lush, so vibrant, and so lively that each conveyed emotion lingers and begged me to pour myself into analyzing it. That’s just how I tend to analyze films, but I’m quite confident that had I turned my brain completely off I would have found ample joy in each scene on looks alone.\n\n## Music and Sound\n\nFor a film that revolved heavily around the rhythm of music, I found it to be lovely and serviceable, but not quite something that made me want to revisit each song. For instance, the title track “Remember Me” pales in comparison to “How Far I’ll Go” in Moana, which still stands as my favorite Disney music to this day. Nonetheless, the music was emotive and captured the passion of our protagonist Miguel.\n\nThe voice acting was strong, and young Miguel’s singing abilities were also particularly noteworthy.\n\n## Narrative and Emotional Impact\n\nPixar is no slouch when it comes to world building, tear-jerking moments, or emotional impact. They’ve done it time and time again, creating incredibly believable worlds like in Toy Story, A Bugs Life, and Finding Nemo. Each compelling cast of characters comes personified for extra relatability and heart-warming humor, and it continued to astound me that they nail each and every movie they seem to make.\n\nCoco’s story centers around Miguel’s Mexican family, the importance of family and remembering the dead, and what it means to find one’s own place in the world. The story zips along at a quick pace and chugs along forward as Miguel enters the land of the dead, all whilst building an interesting an thought provoking narrative around death and memories. This strikes me as the most adult and complex storyline that Pixar has attempted, and it hits home in basically every way.\n\nI found myself cheering, groaning, and tearing up at all the right moments. Even when you see it coming, the finale is executed so well that it may have cemented Coco as top 3 Pixar material for me.\n\n## [TL;DR]\n\nAmidst countless exceptional Pixar movies, Coco makes a mark that resonates in thought-provoking ways. A movie that advocates respecting the memories of loved ones, emphasizes the connection of family, and frames it all through the beauty of musical notes. It’s beautiful, it’s well voiced, it has a lighting quick pace, and it seriously hits on the emotional notes it tries. Definitely worth a watch.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Absolutely. Any fan of Pixar, animated films, musicals, or family films is going to love this. It’s pretty hard not to love.\n\n**Recommended for non-fans of this genre?** Yes. This film is pretty wonderful, pretty thought-provoking, and deals with a bit of uplifting spirituality. It has enough complex themes that it has enough clearance to appeal to mature audiences, and it’s so gorgeous that visual alone should sustain any audience member.\n\n## Semi-arbitrary Score: 9.1/10"
        },
        {
          "title": "Another Fun, Loving, and Vibrant Film By Pixar",
          "author": "Jacob",
          "markdown": "It’s becoming a little difficult to review films made by Pixar. They put so much attention to detail in their animations and put so much effort into their production that they are almost immediately engrossing and just fun no matter what comes of the script and story.  In the case of Coco, everything comes together really well and if you are a fan of Pixar’s method of producing accessible and lighthearted animated features, it will delight and brighten your day.\n\n## Viva Mexico!\n\nThe themes and much of the content in Pixar’s latest are based around the Mexican tradition of Día De los Muertos, a holiday which celebrates the connection that the living share with their deceased loved ones.  Honoring the dead in one form or another is a tradition shared by almost all peoples and cultures, but this holiday in particular lends itself well to Pixar’s style of animated storytelling.\n\n![The man, the myth, the legend...](https://i.vimeocdn.com/video/668298553_1280x692.jpg)\n\nThe central idea is that on this day of the dead, your family members come back from the land of the dead as ghosts to visit and the living in return offer them their favorite items from the land the living. The holiday is an extremely jovial affair, one that very much celebrates the dead with colorful displays and offerings on beautiful altars.\n\nIt is a very tangible way of extending the connection between the dead and the living, and Pixar capitalizes on this very well by telling a very touching story of boy and his connection with his past.  In this way we are able to approach some very thought provoking concepts about life death in a way that is approachable to all audiences, and of course Pixar does an amazing job displaying those ideas in action.\n\n## Life and Death\n\nThe film deals with some pretty great concepts around life and death, and how the living and the dead are connected, the most central deals with the type of life we decide to live and how we are remembered by the family and friends that will carry on our legacy.  In the most spoiler free explanation I can give, our success in the afterlife is directly related to the connections and impact we make while we are alive.\n\nBecause of this fact, Día De los Muertos plays a pivotal role as the ghosts in the afterlife may ‘check in’ on the living and witness their legacy.  The idea is executed in a really fun way that gives the story a cohesive background revolving around a pretty accessible and fun cultural holiday.\n\n## The Living and The Dead\n\nThe characters in the film are also adorable and just as well rounded as one might expect from a Disney story.  Nothing too complex, just enough to build out a decent cast of animated antagonists and protagonists.  The main character, Miguel, is a joyful young boy with a passion for music, but was born into a family that has banned music for deep seated feelings of wrongdoing by musicians in their past.  His quest is one of redemption as he seeks a way to convince his family that his passion is something good instead of evil.  In doing so he ends up putting a curse on his family and must figure out how he can regain his honor while also getting their blessing as a musician.\n\n![The Grandma very much dislikes Mariachis](http://i2.wp.com/www.craftychica.com/wp-content/uploads/2017/08/COCO-RGB_c041_41a_pub.pub16.565.png)\n\nThis curse sends him to the afterlife where the plot really opens up and we get a glimpse of the land of the dead, which is a very pretty sight to behold.  The world is incredibly stylized through the lense of Día De los Muertos.  It has neon colored accents, mariachi skeletons and highrise platforms decorated and lit up like a multi colored starry night.  It is without a doubt a real treat for the eyes and the imagination.\n\n## Who Is This Movie For?\n\nI enjoyed this movie a lot.  It’s conceptualization of the living and the dead, ended up not only being a cute little idea for a children's narrative, but also a good philosophical way of connecting the lives we live with the existence we may experience afterwards.  The story is very good, nothing super crazy but an incredibly fun and heartfelt journey through a beautiful backdrop.  If you dig Disney and Pixar’s way of doing things then you will absolutely love this movie.  If that stuff feels cheesy or is just not your cup of tea, this movie will not change your mind."
        }
      ]
    },
    {
      "movieId": 19,
      "submissions": [
        {
          "title": "A Polite Sequel that Doesn’t Quite Live Up to the Original",
          "author": "e-vaughn",
          "markdown": "## A Love For Paddington\n\nWhen you tell someone that you, a 28 year old male, loves Paddington, you should receive high fives and an invitation to a slumber party where you make marmalade sandwiches and enjoy the warmth of Paddington’s nuanced life philosophy.\n\nInstead, people have looked at me with a raised eyebrow, confused how Paddington could be such a revelation. At least, that’s what happened when I told me 2 review mates about Paddington 1, before proceeding to show them the first five minutes which then led to watching the whole damn thing. Paddington 1 charmed the pants off of me. It is impossible to dislike young Paddington Brown and his good-natured yet clumsy bear self.\n\nPaddington 2 came out this past month in the US, and it became the 4th film ever on Rotten Tomatoes to receive 100% after 100 reviews, and while I found it to be enjoyable, sweet, savory, and loaded with fattening moments, it just didn’t quite carry the same weight as Paddington 1.\n\n## A Comparison of Paddingtons\n\nPaddington 1 is a witty, self-sustained slapstick romper. It’s goofy, silly, and cheek-pinchingly adorable. Paddington is well animated, grows on his adoptive family, and shows the world that it while it may always deserve his love, Paddington ain’t gonna hoard it all to himself. Everyone deserves a smile.\n\nThe first Paddington movie was, perhaps, a sleeper hit and clever beyond its station. Humorous, sappy, and impeccably well-acted by everyone on board, Paddington’s voice alone makes me want to curl up with a hot chocolate.\n\nThe sequel continues to bring the jolly goodness in basically every way. Artful, almost coloring book cinematography paired with the option to see Paddington make all batches of new friends, the sequel is equally inoffensive and sweet.\n\nMy only reservations come from a more distinct lack of humor or slapstick, a reuse of the same gags several times (but it’s hard not to love his hard stare), and bewilderment at all the trouble young Paddington manages to scrap together.\n\n## Conclusion [TL;DR]\n\nAll in all, Paddington 2 is sweet and a solid lil continuation of Paddington’s journey. It’s a bit more inconsistent and missing the embrace of family that Paddington 1 found, but it’s charming and cute and even though it’s not quite as good as Paddington 1, it’s still pretty gosh-darned worthwhile.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** D’uh. Why aren’t you watching Paddington 1 and 2 right now?\n\n**Recommended for non-fans of this genre?** Yah. If you’ve seen Paddington 1 and liked it, the whole world seems to agree that Paddington 2 is pretty dang great too. Still, if having to choose, I’d venture to say Paddington 1 is a better bet.\n\n## Semi-arbitrary Score: 8.4/10"
        },
        {
          "title": "An Experience That Just Wants You To Smile",
          "author": "Jacob",
          "markdown": "Paddington 2 was not a movie I was expecting to watch and review this year, but its critical reception and the praise from others made me intrigued.  I ended up watching the original Paddington and actually finding merit in the lighthearted little adventure.  Paddington 2 follows in its predecessors footsteps in a direct continuation of the storyline.  It has everything we’ve come to expect from a movie based on a children's story, with bubbly characters and slapstick antics.  These movies want you to giggle and smile at their happy-go-lucky adorable main character.\n\n## Always Be Polite\n\n![What a stylish lil bear](http://i.dailymail.co.uk/i/pix/2017/11/10/21/46366B3D00000578-0-image-a-11_1510348260853.jpg)\n\nPoliteness is pretty much the crux of this story, and continues to be the driving force in all of Paddington 2.  Those who are impolite will get what’s coming to them, a hard stare and maybe some incarceration depending on the extent of their impoliteness.  Which makes sense, as this is a children's story and feels like it quite often.  Not to say that the narrative feels hokey or juvenile, just that so much of this story is incredibly light hearted.  Even at the worst of times, the consequences of any characters actions seem quite pleasant compared to the ups and downs of reality.\n\nBut this is fantasy at the end of the day, a talking adorable humanoid bear cub is not a thing that exists (...yet),  but that’s pretty much where the extent of this fantasy universe’s powers.  Even though everything else is a possibility in the real world it certainly feels like a departure from the world I’m assuming most of us live everyday.\n\n## The World of Paddington\n\n![He is so goddamn adorable](https://i.vimeocdn.com/video/668246945_1280x692.jpg)\n\nPaddington exists very much in the realm of children's fantasy, pleasing to the eyes as cute silly bear, but exhibiting behavior we want to impart to children developing social skills.  He exists as an example of delightful behavior that we wish every child, and really person for that matter, exhibited in a developed society.  He is the prototypical gentleman: always polite and seems to always do the right thing in s selfless manner.\n\nAs a movie goer this pattern of behavior is very predictable, and is something that will rub someone the wrong way when they expect nuance and subtlety from a narrative.  But then again this is a children's story, which doesn’t completely excuse it, but is just something that is very engrained in this experience.\n\nEven in Prison, a place people get sent when we decide they exhibit counterproductive behavior to society, we see Paddington act as an example everyone behind bars. He single handedly does the job of which a correctional facility is designed to do.  A pretty impressive little bear, and a pretty fun set piece to showcase the power of politeness and the usefulness of agreed upon societal norms.\n\nEven the villain is just an eccentric washed up actor, with no real malice, just the desire to absolve his debts and achieve his dream of acting in a one-man production.  Even he is taught an important lesson by the cute little bear AND the processes now set forth in the revamped correctional facility.  Win win indeed.\n\n##  Should I Witness the Power of Paddington?\n\nLook, this is a very happy silly little movie.  If you enjoy slapstick antics and love to watch on screen cuteness, or if you have children you want to impart a little bit of Paddington into, you can’t go wrong with this film.  If you are not into a bunch of cutesy happy-go lucky shenanigans then maybe lighten up.  This movie is a fun family adventure with lots of physical comedy and should not be mistaken as anything else."
        }
      ]
    },
    {
      "movieId": 20,
      "submissions": [
        {
          "title": "A Caustic, Abuse-Focused Underdog Biopic that Somehow Earns Your Love",
          "author": "e-vaughn",
          "markdown": "## Snarl and punch and kick and fuck-off why don’tchya?\n\nI, Tonya is a fierce lil flick. It is so well-crafted and humorous and dark, and somehow simultaneously doesn’t seem to give a fuck what kind of preconceived ideas you had about Miss Harding before you plopped your ass into the seat.\n\nIt’s the type of movie to make you subvert the shit out of your expectations, dig into your own sense of empathy, and relate to a type of person maybe you ain’t never given the time of day before.\n\nIt’s got moments of inspiration, and a sense of larger than lifeness to it. It’s got darkness and sorrow and a feeling of failure and giving up. It’s got warmth and stupidity, and it’s vile and unpleasant. Some scenes display incredible performances, and some scenes are fucking annoying that provide important context, yet are still really fucking annoying.\n\nIt all kind of revolves around one thing: Margot Robbie’s performance.\n\n## A White Trash Ice Princess\n\n![Aint she a doll](https://media1.popsugar-assets.com/files/thumbor/57kRD_xPvGnLsurgy3PmwXo-Ybw/fit-in/2048xorig/filters:format_auto-!!-:strip_icc-!!-/2018/01/24/032/n/4852708/tmp_SYVusN_873b544e784a3a9f_i-tonya-1508426635.png)\n\nMargot Robbie disappears into this role. She’s fucking aces in it. Apart from the silly attempt to make this 27 year old actress look 15, her adult portrayals are excellent through and through. Several ending scenes showcase performance anxiety in ways that my formerly-competing gymnast-self hadn’t experienced in years.\n\nMuch of her performances hinges on the interactions between her abusive and incompetent doofus of a partner, Jeff, and the ego-dismantling grimyness that is her mother. Much like Lady Bird’s thematic elements focused on abusive parenting and finding one’s own way, this biopic frames abuse and manipulation as being at the forefront of Tonya’s life.\n\nAllison Janney plays Tonya’s mother, and she not only looks exactly like Tonya’s actual mother, she throws herself into role that should make any parent reconsider their own behavior. The cycle of abuse, and the build up to it were portrayed in shades of gray. Sometimes they were innocuous and minimal enough to hopefully make anyone consider what types of behavior might constitute as abuse, and sometimes they were egregious and overt. In a modern day age where abuse is taking on more and more meanings, heartfelt analysis of how we interact with other humans we claim to love will become all the more important. Her mother, partner, and even the Figure Skating Association all abuse her.\n\nIt also doesn’t hand hold its way to delivering a direct message about said abuse or what it means to become white trash.  It presents behaviors on screen as things that may have factually happened, but it doesn’t go out of its way to throw down character development or display change. You’re left, as a free thinker, to come to your own conclusions about these characters’ actions.\n\nThis is definitely the type of biopic that aims to brazenly shit all over side characters. Not to say it castes blame away from Tonya, and maybe it’s all contingent on Margot’s performance, but my opinion of Tonya went from public misnomers to that of an acute fan. She’s aight, this one.\n\n## Film Making and Shit\n\nThe whole movie is pretty damn great. Well, most of it is, anyway. Any moment with Tonya on screen is pretty much gold. The skating is pretty fucking great. They have some excellent slow-motion captures and minimally distracting CGI to make Margot look like she can actually skate, but it works pretty fucking well. There’s a gorgeous slow-motion shot that displays the body mechanics of Tonya’s triple-axel in riveting style. Most of the scenes with her skating are actually pretty compelling, and while I only sometimes felt a sense of anxiety during her performance, this isn’t a sports movie where there’s some big pay-off or some such nonsense. I cared when Tonya cared, and that marked it as a good performance.\n\n![Margot Robbie doing her thing](https://media0.giphy.com/media/xT0xejJBp7QiQ8mCHK/giphy.gif)\n\nThe movie lags a bit around 2/3rd of the way in, right as we start to get through the “incident”. I suspect that most audiences would be particularly intrigued with this section, as it was where her notoriety came from, but I found it to be worst paced part of the film. Annoying side characters, details, and recaps are given absent of Tonya’s presence and I found myself wanting to be with her, training, instead.\n\nOnce more, this seems like praise for her performance.\n\n## Conclusion [TL;DR]\n\nI, Tonya has a lot going for it. It’s fucking funny, it’s pretty damn sharp, and it’s often dark as all hell. Sometimes it actually stings to watch. But Margot Robbie’s performance is grand. It’s the type of depiction that I imagine Tonya Harding herself would have hoped for.\n\n## RECOMMENDATIONS\n\n**Recommended for fans of this genre?** Yeah. This is a great bioic. It’s stylish, it’s well composed, it lets you form your own opinion, and it kinda shits all over a lot of stuff. If that’s your thing, then peep this shit.\n\n**Recommended for non-fans of this genre?** Maybe. This is a hard one because the genre is biopic, comedy, drama. What else is there? You probably won’t like this film if you can’t handle watching heavy abuse. You won’t like it if you want a classic storyline. You won’t like it if you are easily offended. You won’t like it if you don’t find that it’s a true story to elevate it when it makes a misstep.\n\n## Semi-arbitrary Score: 8.6/10"
        }
      ]
    }
  ],
  "images": [
    {
      "movieId": 1,
      "imageName": "ValerianImage.jpg"
    },
    {
      "movieId": 2,
      "imageName": "atomic-blonde.jpg"
    },
    {
      "movieId": 3,
      "imageName": "dunkirk.jpg"
    },
    {
      "movieId": 4,
      "imageName": "naked.jpg"
    },
    {
      "movieId": 5,
      "imageName": "it.jpg"
    },
    {
      "movieId": 6,
      "imageName": "mother.jpg"
    },
    {
      "movieId": 7,
      "imageName": "kingsman2.png"
    },
    {
      "movieId": 8,
      "imageName": "blade-runner-2049.png"
    },
    {
      "movieId": 9,
      "imageName": "prof-marston.jpg"
    },
    {
      "movieId": 10,
      "imageName": "happy-death-day.jpg"
    },
    {
      "movieId": 11,
      "imageName": "thor-ragnarok.jpg"
    },
    {
      "movieId": 12,
      "imageName": "justice-league.jpg"
    },
    {
      "movieId": 13,
      "imageName": "murder-on-the-orient.jpg"
    },
    {
      "movieId": 14,
      "imageName": "disaster-artist.jpg"
    },
    {
      "movieId": 15,
      "imageName": "lady-bird.jpg"
    },
    {
      "movieId": 16,
      "imageName": "star-wars-the-last-jedi.jpg"
    },
    {
      "movieId": 17,
      "imageName": "the-shape-of-water.jpg"
    },
    {
      "movieId": 18,
      "imageName": "coco.jpg"
    },
    {
      "movieId": 19,
      "imageName": "paddington-2.jpg"
    },
    {
      "movieId": 20,
      "imageName": "i-tonya.jpg"
    }
  ]
}
